{
    "id": "0014",
    "name": "Senior managers - health, education, social and community services and membership organizations",
    "lead statement": "Senior managers in this unit group plan, organize, direct, control and evaluate, through middle managers, membership and other organizations or institutions that deliver health, education, social or community services. They formulate policies which establish the direction to be taken by these organizations, either alone or in conjunction with a board of directors. They are employed in health care organizations, educational services, social and community services and membership organizations or they may own and operate their own business.",
    "example titles": [
        "academic association president",
        "academic business vice-president",
        "alumni association executive director",
        "arts and culture association chairperson",
        "arts association executive director",
        "assistant executive director – health, education, social and community services and membership organizations",
        "association executive director",
        "automobile association executive director",
        "business association general manager",
        "business association president",
        "business general manager",
        "business school general manager",
        "chairman/woman – health, education, social and community services and membership organizations",
        "chairperson – health, education, social and community services and membership organizations",
        "chancellor – education",
        "charitable organization director",
        "charitable organization executive director",
        "chief executive officer (CEO) – health, education, social and community services and membership organizations",
        "chief financial officer (CFO) – health, education, social and community services and membership organizations",
        "chief operating officer – health, education, social and community services and membership organizations",
        "chief privacy officer – health, education, social and community services and membership organizations",
        "college chancellor",
        "college president",
        "community college president",
        "corporate controller – health, education, social and community services and membership organizations",
        "crafts guild executive director",
        "cultural association president",
        "deputy chief executive officer – health, education, social and community services and membership organizations",
        "director general – health, education, social and community services and membership organizations",
        "educational institution chief financial officer (CFO)",
        "educators association chairperson",
        "environmental group executive director",
        "ethnic association president",
        "executive director – health, education, social and community services and membership organizations",
        "executive director – teacher's federation",
        "executive general manager – health, education, social and community services and membership organizations",
        "executive vice-president – health, education, social and community services and membership organizations",
        "finance and administration vice-president – health, education, social and community services and membership organizations",
        "finance vice-president – health, education, social and community services and membership organizations",
        "general manager – health, education, social and community services and membership organizations",
        "health care association president",
        "health services institution executive director",
        "hockey association general manager",
        "hospital administrator",
        "hospital executive director",
        "human resources and organizational development vice-president – health, education, social and community services and membership organizations",
        "human resources vice-president – health, education, social and community services and membership organizations",
        "information systems vice-president – health, education, social and community services and membership organizations",
        "labour organization president",
        "lobby chief executive officer – health, education, social and community services and membership organizations",
        "marketing vice-president – health, education, social and community services and membership organizations",
        "medical vice-president – health services",
        "membership organization general manager",
        "music guild president",
        "non-governmental organization (NGO) executive director",
        "nurse's association executive director",
        "nursing vice-president – health, education, social and community services and membership organizations",
        "operations vice-president – health, education, social and community services and membership organizations",
        "personnel vice-president – health, education, social and community services and membership organizations",
        "planning vice-president – health, education, social and community services and membership organizations",
        "political organization general manager",
        "political party president",
        "president – health, education, social and community services and membership organizations",
        "president and general manager – health, education, social and community services and membership organizations",
        "professional association executive director",
        "recreational association executive director",
        "rector – education",
        "regional vice-president – health, education, social and community services and membership organizations",
        "scientific association chairperson",
        "social services institution corporate controller",
        "sports association president",
        "support services vice-president – health, education, social and community services and membership organizations",
        "trade school general manager",
        "union association president",
        "university president",
        "vice-president – health, education, social and community services and membership organizations",
        "voluntary organization executive director",
        "young men's christian association (YMCA) executive director"
    ],
    "main duties": [
        "Establish objectives for the organization or institution and formulate or approve policies and programs",
        "Authorize and organize the establishment of major departments and associated senior staff positions",
        "Allocate material, human and financial resources to implement organizational policies and programs; establish financial and administrative controls; formulate and approve promotional campaigns; and approve overall personnel planning",
        "Select middle managers, directors or other executive staff",
        "Co-ordinate the work of regions, divisions or departments",
        "Represent the organization, or delegate representatives to act on behalf of the organization, in negotiations or other official functions.",
        "Senior managers in this unit group may specialize in areas such as finance, marketing, human resources or in a particular service area."
    ],
    "employment requirements": [
        "A university degree or college diploma in business administration, hospital administration, finance or other discipline related to the service provided is usually required.",
        "Several years of experience as a middle manager in a related institution or organization are usually required.",
        "Specialization in a particular functional area or service is possible through specific university or college training in that area or through previous experience.",
        "Senior managers in finance usually require a professional accounting designation."
    ],
    "additional information": [
        "There is mobility among senior management occupations."
    ],
    "exclusions": [
        {
            "name": "Administrators - post-secondary education and vocational training (0421)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0421&ver=16"
        },
        {
            "name": "Government managers - education policy development and program administration (0413)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0413&ver=16"
        },
        {
            "name": "Government managers - health and social policy development and program administration (0411)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0411&ver=16"
        },
        {
            "name": "Managers in health care (0311)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0311&ver=16"
        },
        {
            "name": "Managers in social, community and correctional services (0423)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0423&ver=16"
        },
        {
            "name": "Other managers in public administration (0414)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0414&ver=16"
        },
        {
            "name": "School principals and administrators of elementary and secondary education (0422)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0422&ver=16"
        }
    ]
}