{
    "id": "0122",
    "name": "Banking, credit and other investment managers",
    "lead statement": "Banking, credit and other investment managers plan, organize, direct, control and evaluate the activities of financial establishments or operational departments within such establishments, or credit departments in industrial and commercial establishments. They oversee business development and manage overall performance in accordance with established strategic directions and policies. Banking managers are employed by banks, trust companies and credit unions. Credit managers are employed by credit departments in department stores, utility companies, car dealerships, insurance companies or other industrial or commercial organizations. Other investment managers are employed by credit card companies, consumer loan companies, mutual fund investment firms, mortgage investment companies or other financial establishments concerned with extending loans and financing and investments.",
    "example titles": [
        "accounts manager – banking, credit and investment",
        "area manager – banking, credit and investment",
        "assistant branch manager – banking, credit and investment",
        "assistant consumer credit manager",
        "assistant corporate banking services manager",
        "assistant credit manager",
        "assistant operations manager – banking, credit and investment",
        "assistant regional manager – banking",
        "bank branch manager",
        "bank director",
        "bank manager",
        "banking accounts manager",
        "banking operations manager",
        "branch administrative manager – banking, credit and investment",
        "branch manager – banking, credit and investment",
        "collection centre manager",
        "collection manager",
        "collection manager – bank or trust company",
        "commercial attaché",
        "commercial banking manager",
        "commercial mortgages accounts manager",
        "commercial mortgages manager",
        "consumer credit management trainee",
        "consumer credit services manager trainee",
        "corporate accounts manager – banking, credit and investment",
        "corporate banking centre manager",
        "corporate services manager – banking, credit and investment",
        "corporate trust services manager",
        "credit and accounts manager",
        "credit and collection department manager",
        "credit and collection manager",
        "credit approval and market development manager",
        "credit area co-ordinator",
        "credit card centre manager",
        "credit card company operations manager",
        "credit manager",
        "credit union manager",
        "financial services manager",
        "international banking manager",
        "investment manager – bank or trust company",
        "investment manager – banking, credit and investment",
        "loan and credit manager – banking or trust company",
        "loans manager",
        "loans manager trainee",
        "mortgage and consumer credit manager",
        "mortgage manager",
        "operations manager – banking, credit and investment",
        "personal services manager – banking, credit and investment",
        "personal trust manager",
        "regional bank manager",
        "regional collection manager",
        "regional credit manager",
        "senior accounts manager – banking, credit and investment",
        "senior manager – personal financial services",
        "trust company branch manager",
        "trust company investment manager",
        "trust company manager"
    ],
    "main duties": [
        "Plan, organize, direct, control and evaluate the branch operations of a bank, trust company, credit union or similar financial institution or of a department in such an institution responsible for administering personal and commercial loans, buying and selling securities, operating investment funds, administering trusts, settling estates or other related activities",
        "Ensure the institution's policies and procedures are followed according to established guidelines and make recommendations for improvement",
        "Network to develop business relations, promote the sale of loan, investment and other banking services and attract corporate and individual customers",
        "Interview corporate and individual customers and respond to customer enquiries",
        "Analyze, review and approve or reject loan and credit applications in accordance with authorized limits",
        "Monitor processing of loan applications and credit investigations",
        "Oversee preparation of monthly financial and branch progress reports",
        "Recruit personnel and identify their training needs.",
        "Plan, organize, direct, control and evaluate the activities of a credit department in an industrial or commercial organization",
        "Administer corporate, commercial and personal loan accounts",
        "Advise customers on the commercial and personal financial services corresponding to their needs",
        "Evaluate and review loan and credit applications and collateral and make recommendations",
        "Approve or reject credit applications, establish credit limits and determine repayment plans or schedules in accordance with authorized limits",
        "Ensure collection of overdue or delinquent accounts",
        "Ensure credit policies and procedures are followed according to established guidelines and applicable legislation",
        "Prepare credit and loan reports",
        "Recruit credit personnel and identify their training needs."
    ],
    "employment requirements": [
        "A university degree or college diploma in business administration, commerce, economics or a related field is usually required.",
        "A master's degree in business administration, finance or management science may be required for the management of large commercial loans.",
        "Completion of company or other management training programs is usually required.",
        "Several years of experience within the industry, including supervisory experience, are required."
    ],
    "additional information": [
        "Progression to senior management positions in this field is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Mortgage brokerage managers (in 0121 Insurance, real estate and financial brokerage managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0121&ver=16"
        },
        {
            "name": "Other business services managers (0125)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0125&ver=16"
        },
        {
            "name": "Senior managers - financial, communications and other business services (0013)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0013&ver=16"
        }
    ]
}