{
    "id": "0422",
    "name": "School principals and administrators of elementary and secondary education",
    "lead statement": "School principals plan, organize, direct, control and evaluate the activities of teachers and other staff of an elementary or secondary school. They are employed by public and private schools. Administrators of elementary and secondary education plan, organize, direct, control and evaluate the academic affairs of a school system. They are employed by school boards.",
    "example titles": [
        "Aboriginal school principal",
        "academic superintendent",
        "area superintendent – schools",
        "assistant district school superintendent",
        "assistant principal",
        "assistant school district superintendent",
        "assistant superintendent of schools",
        "associate superintendent – schools",
        "board of education administrator",
        "business college principal",
        "chief superintendent – schools",
        "college principal – secondary level",
        "community school principal",
        "deputy superintendent – schools",
        "director of education – correctional institution",
        "director of school for the blind or deaf",
        "director of school for the hearing impaired",
        "director of school for the visually impaired",
        "district school assistant superintendent",
        "district school superintendent",
        "elementary school principal",
        "hall principal – secondary school",
        "high school principal",
        "Native school principal",
        "principal",
        "private primary college principal",
        "private school headmaster/mistress",
        "private school principal",
        "regional schools superintendent",
        "regional superintendent – schools",
        "school board administrator",
        "school district assistant superintendent",
        "school district superintendent",
        "school principal",
        "school superintendent",
        "school vice-principal",
        "secondary school principal",
        "superintendent of academic affairs",
        "superintendent of education programs",
        "superintendent of education programs in public schools",
        "superintendent of educational services",
        "superintendent of elementary education",
        "superintendent of elementary schools",
        "superintendent of operations – schools",
        "superintendent of professional development – schools",
        "superintendent of secondary schools",
        "superintendent of special education",
        "superintendent of student services",
        "technical high school principal",
        "vocational high school principal"
    ],
    "main duties": [
        "Plan, organize, direct, control and evaluate, through department heads or supervisors, the activities of teachers and support staff",
        "Review programs to ensure conformance to school board or provincial standards and develop programs within limits of authority",
        "Co-ordinate teaching activities of the institution by making personnel assignments, determining class size and preparing timetables",
        "Organize and maintain procedures for the keeping of records",
        "Prepare and administer institution or program budget",
        "Direct and co-ordinate school maintenance services and the use of school facilities",
        "May recruit and hire teachers and other staff",
        "May teach.",
        "Plan, organize, direct, control and evaluate, through school principals, the academic affairs of a school district",
        "Evaluate curriculum, teaching methods and community participation in programs for a school district and revise programs as required",
        "Develop and administer programs for the education and training of students and adults",
        "Make recommendations concerning the annual operating budget of a school district",
        "Direct or supervise the recruitment, appointment, training, evaluation and promotion of teaching personnel."
    ],
    "employment requirements": [
        "A bachelor's degree in education is required.",
        "A master's degree in education may be required.",
        "Several years of experience as a senior teacher or department head are required.",
        "A teacher's certificate for the province of employment is required.",
        "School principals may require a principal's certificate.",
        "Administrators of elementary and secondary education may require a supervisory officer certificate."
    ],
    "additional information": [
        "There is little mobility between institutional settings, for example, between elementary and secondary schools."
    ],
    "exclusions": [
        {
            "name": "Administrators - post-secondary education and vocational training (0421)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0421&ver=16"
        },
        {
            "name": "Education policy researchers, consultants and program officers (4166)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4166&ver=16"
        },
        {
            "name": "Government managers - education policy development and program administration (0413)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0413&ver=16"
        },
        {
            "name": "Senior managers - health, education, social and community services and membership organizations (0014)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0014&ver=16"
        }
    ]
}