{
    "id": "0712",
    "name": "Home building and renovation managers",
    "lead statement": "Home building managers or builders own, operate and manage companies engaged in the construction of new residential homes. Home renovation managers or renovators own, operate and manage companies engaged in the renovation of existing residential homes.",
    "example titles": [
        "builder",
        "builder – renovation",
        "builder – residential",
        "home builder",
        "home building contractor",
        "home renovation contractor",
        "home renovator",
        "housing rehabilitation specialist – builder",
        "housing renovator",
        "low-rise residential home builder",
        "rehabilitation and renovation specialist",
        "renovation contractor",
        "residential home builder",
        "residential homes contractor",
        "residential renovation contractor"
    ],
    "main duties": [
        "Plan, organize, direct, control and evaluate the activities of a residential home building or renovating company",
        "Prepare bids for home construction or renovation projects",
        "Consult with customers, architects and engineers regarding plans and specifications",
        "Select, hire and supervise trade subcontractors to do specialized work, such as plumbing, heating and electrical work",
        "Plan and prepare work schedules and co-ordinate the activities of subcontractors",
        "Inspect work performed by subcontractors to ensure quality and conformity with plans and specifications",
        "Prepare and maintain a directory of suppliers and trade subcontractors",
        "Develop and implement marketing and advertising strategies to promote company's products and services",
        "May perform carpentry or other trade work during home construction or renovation activities."
    ],
    "employment requirements": [
        "Extensive experience in the home construction industry, including experience as a general supervisor, is usually required for self-employment as a home builder or a home renovator.",
        "Leading in Energy and Environmental Design (LEED) certification may be an asset in bidding on and obtaining building and renovation projects."
    ],
    "additional information": [
        "Progression to senior management positions is possible with extensive experience and training in management."
    ],
    "exclusions": [
        {
            "name": "Construction managers (0711)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0711&ver=16"
        },
        {
            "name": "Senior managers - construction, transportation, production and utilities (0016)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0016&ver=16"
        }
    ]
}