{
    "id": "1111",
    "name": "Financial auditors and accountants",
    "lead statement": "Financial auditors examine and analyze the accounting and financial records of individuals and establishments to ensure accuracy and compliance with established accounting standards and procedures. Accountants plan, organize and administer accounting systems for individuals and establishments. Financial auditors and accountants are employed by private sector accounting and auditing firms or departments and public sector accounting and auditing departments or units, or they may be self-employed. Articling students in accounting firms are included in this unit group.",
    "example titles": [
        "accountant",
        "accountant-controller",
        "accountants supervisor",
        "accounting controller",
        "analyst-accountant",
        "assistant controller",
        "audit unit head – taxation",
        "auditor – finance",
        "auditor-chartered accountant (CA)",
        "auditors supervisor",
        "bank branch accountant",
        "bank reserves auditor",
        "bankruptcy trustee",
        "budget accountant",
        "certified general accountant (CGA)",
        "certified management accountant (CMA)",
        "chartered accountant (CA)",
        "chartered accountant (CA) student",
        "chartered professional accountant, certified general accountant (CPA, CGA)",
        "chartered professional accountant, certified management accountant (CPA, CMA)",
        "chartered professional accountant, chartered accountant (CPA, CA)",
        "chief accountant",
        "claims accountant",
        "computer audit specialist",
        "cost accountant",
        "cost accounting supervisor",
        "departmental accountant",
        "division controller – accounting",
        "field auditor – finances",
        "financial accountant",
        "financial auditor",
        "financial control officer",
        "general accountant",
        "income tax adjuster",
        "income tax adviser",
        "income tax consultant",
        "income tax expert",
        "income tax investigator",
        "income tax specialist",
        "industrial accountant",
        "industrial auditor",
        "intermediate accountant",
        "internal audit project manager",
        "internal audit supervisor – finances",
        "internal auditor",
        "internal auditor – finances",
        "internal auditors supervisor – finances",
        "machine processing accountant",
        "management accountant",
        "management accounting chief",
        "manufacturing accountant",
        "plant accountant",
        "plant controller",
        "production accountant",
        "project accountant",
        "property accountant",
        "public accountant",
        "public accountants chief",
        "public accountants supervisor",
        "reinsurance analyst",
        "sales auditor – finances",
        "senior accounting analyst",
        "senior cost accountant",
        "senior intern auditor",
        "tax accountant",
        "tax adviser",
        "tax analyst",
        "tax auditor",
        "tax consultant",
        "tax evaluator",
        "tax examiner",
        "tax expert",
        "tax specialist",
        "taxation rulings officer"
    ],
    "main duties": [
        "Examine and analyze journal and ledger entries, bank statements, inventories, expenditures, tax returns and other accounting and financial records, documents and systems of individuals, departments within organizations, businesses or other establishments to ensure financial recording accuracy and compliance with established accounting standards, procedures and internal controls",
        "Prepare detailed reports on audit findings and make recommendations to improve individual or establishment's accounting and management practices",
        "Conduct field audits of businesses to ensure compliance with provisions of the Income Tax Act, Canadian Business Corporations Act or other statutory requirements",
        "May supervise other auditors or professionals in charge of accounting within client's establishment.",
        "Plan, set up and administer accounting systems and prepare financial information for individuals, departments within organizations, businesses and other establishments",
        "Examine accounting records and prepare financial statements and reports",
        "Develop and maintain cost finding, reporting and internal control procedures",
        "Examine financial accounts and records and prepare income tax returns from accounting records",
        "Analyze financial statements and reports and provide financial, business and tax advice",
        "May act as a trustee in bankruptcy proceedings",
        "May supervise and train articling students, other accountants or administrative technicians."
    ],
    "employment requirements": [
        "Chartered professional accountants, chartered accountants (CPA, CA) require a university degree\r\n and completion of a professional training program approved by a provincial Institute of Chartered Accountants and, depending on the province, either two years or 30 months of on-the-job training \r\n and membership in a provincial Institute of Chartered Accountants upon successful completion of the Uniform Evaluation (UFE).",
        "Chartered professional accountants, certified general accountants (CPA, CGA) and chartered professional accountants, certified management accountants (CPA, CMA) require a university degree \r\n and completion of an approved training program and several years of on-the-job training \r\n and certification with a regulatory body is required in all provinces and territories.",
        "Auditors require education, training and recognition as indicated for chartered professional accountants, chartered accountants (CPA, CA), chartered professional accountants, certified general accountants (CPA, CGA) or chartered professional accountants, certified management accountants (CPA, CMA)\r\n and some experience as an accountant.",
        "Auditors may require recognition by the Institute of Internal Auditors.",
        "To act as a trustee in bankruptcy proceedings, auditors and accountants must hold a licence as a trustee in bankruptcy.",
        "Licensing by the provincial or territorial governing body is usually required for accountants and auditors practising public accounting."
    ],
    "additional information": [
        "There is limited mobility among the three professional accounting designations: chartered professional accountant, chartered accountant (CPA, CA); chartered professional accountant, certified general accountant (CPA, CGA), and chartered professional accountant, certified management accountant (CPA, CMA).",
        "Progression to auditing or accounting management positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Accounting technicians and bookkeepers (1311)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1311&ver=16"
        },
        {
            "name": "Financial managers (0111)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0111&ver=16"
        }
    ]
}