{
    "id": "1312",
    "name": "Insurance adjusters and claims examiners",
    "lead statement": "Insurance adjusters investigate insurance claims and determine the amount of loss or damages covered by insurance policies. They are employed in claims departments of insurance companies or as independent adjusters. Insurance claims examiners examine claims investigated by insurance adjusters and authorize payments. They are employed at head offices or branches of insurance companies.",
    "example titles": [
        "adjuster",
        "adjuster – insurance",
        "adjuster trainee – insurance",
        "automobile claims technical adjuster",
        "casualty insurance adjuster",
        "claims adjuster – insurance",
        "claims approver – insurance",
        "claims consultant",
        "claims examiner",
        "claims examiner – insurance",
        "claims investigator",
        "claims investigator – insurance",
        "claims representative",
        "claims representative – insurance",
        "disability claims examiner – insurance",
        "disaster relief claims adjuster – insurance",
        "field adjuster – insurance",
        "fire insurance adjuster",
        "freight adjuster – insurance",
        "group life claims examiner – insurance",
        "health and dental claims examiner – insurance",
        "insurance adjuster",
        "insurance inspector",
        "liability adjuster – insurance",
        "loss examiner – insurance",
        "marine claims adjuster – insurance",
        "marine insurance adjuster",
        "medical claims assessor – insurance",
        "motor vehicle claims adjuster – insurance",
        "production examiner",
        "property adjuster – insurance",
        "public adjuster – insurance",
        "railroad claims adjuster – insurance",
        "settlement management associate",
        "settlement specialist",
        "staff adjuster – insurance",
        "telephone adjuster – insurance",
        "trainee adjuster – insurance",
        "workers' compensation adjuster – insurance"
    ],
    "main duties": [
        "Investigate circumstances surrounding insurance claims to determine validity of claim",
        "Inspect automobile, home or other property damage",
        "Take statements and consult with claimants, accident witnesses, doctors and other relevant individuals and examine records or reports",
        "Determine amount of loss or damages covered by insurance policies",
        "Negotiate settlement of claims",
        "Prepare adjustment reports.",
        "Review, examine, calculate and authorize insurance claims investigated by insurance adjusters",
        "Examine adjusters' reports and similar insurance claims or precedents to determine extent of insurance coverage",
        "Ensure claims are valid and settlements are made according to company practices and procedures",
        "Consult lawyers, doctors or other relevant individuals to discuss insurance claims",
        "Approve automobile, fire, life, disability, dental or other insurance claims."
    ],
    "employment requirements": [
        "Completion of secondary school is required.",
        "A bachelor's degree, college diploma or some post-secondary education \r\n or several years of experience as a clerk in the claims department or other general insurance experience is required.",
        "Several years of on-the-job training and completion of insurance industry courses and training programs are required.",
        "Independent adjusters require a provincial licence issued by the Superintendent of Insurance in the province or territory of employment."
    ],
    "additional information": [
        "Completion of educational programs through the Insurance Institute of Canada or its provincial counterparts entitles insurance adjusters and claims examiners to professional recognition as a Chartered Insurance Professional (CIP), and with additional university courses, as a Fellow Chartered Insurance Professional (FCIP)."
    ],
    "exclusions": [
        {
            "name": "Supervisors, finance and insurance office workers (1212)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1212&ver=16"
        }
    ]
}