{
    "id": "2111",
    "name": "Physicists and astronomers",
    "lead statement": "Physicists conduct theoretical and applied research to extend knowledge of natural phenomena and to develop new processes and devices in fields such as electronics, communications, power generation and distribution, aerodynamics, optics and lasers, remote sensing, biotechnology, medicine and health. They are employed by electronic, electrical and aerospace manufacturing companies, telecommunications companies, power utilities, university and government research laboratories, hospitals and by a wide range of other processing, manufacturing, and research and consulting firms. Astronomers conduct observational and theoretical research to extend knowledge of the universe. They are employed by government and universities.",
    "example titles": [
        "acoustics physicist",
        "aerodynamicist",
        "aerophysicist",
        "aerospace research scientist",
        "astronomer",
        "astrophysicist",
        "atmospheric physicist",
        "biophysicist",
        "chemical physicist",
        "communications research scientist",
        "cosmic ray physicist",
        "cosmologist",
        "cryogenics physicist",
        "crystal physicist",
        "electricity and magnetism physicist",
        "electronics physicist",
        "electronics research scientist",
        "elementary particle physicist",
        "elementary particle theorist",
        "experimental physicist",
        "fluid physicist",
        "health physicist",
        "high-temperature physicist",
        "laser physicist",
        "low-temperature physicist",
        "magnetism physicist",
        "mathematical biophysicist",
        "mechanics physicist",
        "medical biophysicist",
        "medical engineering biophysicist",
        "medical physicist",
        "metal physicist",
        "metrologist",
        "microwave physicist",
        "molecular biophysicist",
        "nanotechnology physicist",
        "nuclear physicist",
        "nuclear reactor physicist",
        "optics physicist",
        "particle accelerator physicist",
        "particle physicist",
        "photonics physicist",
        "physicist",
        "physics research scientist",
        "plasma physicist",
        "radiation biophysicist",
        "radio astronomer",
        "reactor physicist",
        "remote sensing research scientist",
        "rheologist",
        "semiconductor physicist",
        "solid-state physicist",
        "space physicist",
        "theoretical nuclear physicist",
        "thermal physicist",
        "X-ray physicist"
    ],
    "main duties": [
        {
            "duty_name": "Physicists",
            "duty_description": [
                "Design and conduct research in experimental and theoretical physics",
                "Carry out analysis of research data and prepare research reports",
                "Participate as a member of a research or development team in the design and development of experimental, industrial or medical equipment, instrumentation and procedures."
            ],
            "duty_comment": "Physicists may specialize in fields such as aeronomy and space, acoustics, atomic and molecular physics, biophysics, condensed matter or solid state physics, electromagnetics, fluids and aerodynamics, health physics, medical physics, metrology, particle physics, optics and laser physics, nuclear physics and plasma physics."
        },
        {
            "duty_name": "Astronomers",
            "duty_description": [
                "Design and conduct observational surveys, conduct detailed analyses and develop numerical models to extend knowledge of celestial bodies and cosmic radiation",
                "Develop or participate in the development of instrumentation and software for astronomical observation and analysis."
            ],
            "duty_comment": "Astronomers may specialize in fields such as astrophysics, observational or optical astronomy and radio astronomy."
        }
    ],
    "employment requirements": [
        "Physicists usually require a master's or doctoral degree in a field of physics, engineering physics, or in a related discipline.",
        "Astronomers usually require a master's or doctoral degree in astronomy or in a related discipline."
    ],
    "additional information": [
        "Mobility between specializations within physics and within astronomy is possible with experience.",
        "Physicists may work closely with and perform some of the duties of engineers.",
        "Mobility is possible to the fields of meteorology, geophysics and other fields of science.",
        "Progression to management positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Architecture and science managers (0212)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0212&ver=16"
        },
        {
            "name": "Atmospheric physicists (in 2114 Meteorologists and climatologists",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2114&ver=16"
        },
        {
            "name": "Computer engineers (except software engineers and designers) (2147)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2147&ver=16"
        },
        {
            "name": "Geophysicists and physical oceanographers (in 2113 Geoscientists and oceanographers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2113&ver=16"
        }
    ]
}