{
    "id": "2134",
    "name": "Chemical engineers",
    "lead statement": "Chemical engineers research, design, and develop chemical processes and equipment, oversee the operation and maintenance of industrial chemical, plastics, pharmaceutical, resource, pulp and paper, and food processing plants and perform duties related to chemical quality control, environmental protection and biochemical or biotechnical engineering. Chemical engineers are employed in a wide range of manufacturing and processing industries, consulting firms, government, research and educational institutions.",
    "example titles": [
        "adhesives engineer",
        "biochemical and biotechnical engineer",
        "biochemical development engineer",
        "biochemical engineer",
        "biotechnical engineer",
        "biotechnology engineer",
        "chemical coating engineer",
        "chemical engineer",
        "chemical process control engineer",
        "chemical process engineer",
        "chemical project engineer",
        "chief chemical engineer",
        "chief process engineer",
        "design and development chemical engineer",
        "electrochemical engineer",
        "environmental chemical engineer",
        "explosives engineer",
        "fuels engineer",
        "industrial hygiene engineer",
        "industrial waste treatment engineer",
        "liquid fuels engineer",
        "petrochemical engineer",
        "petroleum refinery process engineer",
        "pipeline transport engineer",
        "plastics engineer",
        "polymer engineer",
        "production chemical engineer",
        "pulp and paper chemical engineer",
        "pulp and paper engineer",
        "refinery engineer",
        "research chemical engineer",
        "waste treatment engineer"
    ],
    "main duties": [
        "Conduct economic and technical feasibility studies in areas related to chemical, petroleum, pulp and paper, food or other processing industries",
        "Conduct research into the development or improvement of chemical engineering processes, reactions and materials",
        "Evaluate chemical process technology and equipment and determine production specifications",
        "Design and test chemical processing and associated plants and equipment",
        "Oversee the construction, modification, operation and maintenance of pilot plants, processing units or processing plants",
        "Establish and conduct quality control programs, operating procedures and control strategies to ensure consistency and adherence to standards for raw materials, products and waste products or emissions",
        "Prepare contract documents and evaluate tenders for the process aspects of industrial construction",
        "Supervise technicians, technologists and other engineers",
        "May work in an administrative capacity, for example, in the development of guidelines and specifications for the handling of dangerous chemicals, environmental protection, or standards for foods, materials and consumer goods.",
        "Chemical engineers may specialize in the products and processes of a particular industry such as pulp and paper manufacturing, pharmaceuticals, petroleum refining, energy processing, plastics, metal extraction and refining, or adhesives and coatings production. They may also specialize in functional areas of various industries such as process control, pollution control or fermentation processes."
    ],
    "employment requirements": [
        "A bachelor's degree in chemical engineering or in a related engineering discipline is required.",
        "A master's degree or doctorate in a related engineering discipline may be required.",
        "Licensing by a provincial or territorial association of professional engineers is required to approve engineering drawings and reports and to practise as a Professional Engineer (P.Eng.).",
        "Engineers are eligible for registration following graduation from an accredited educational program, and after three or four years of supervised work experience in engineering and passing a professional practice examination."
    ],
    "additional information": [
        "There is considerable mobility between chemical engineering specializations at the less senior levels.",
        "Supervisory and senior positions in this unit group require experience.",
        "Engineers often work in a multidisciplinary environment and acquire knowledge and skills through work experience that may allow them to practise in associated areas of science, engineering, sales, marketing or management.",
        "Chemical engineers work closely with chemists and other scientists and engineers and mobility is possible between some fields of specialization."
    ],
    "exclusions": [
        {
            "name": "Agricultural and biomedical engineers (in 2148 Other professional engineers, n.e.c.",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2148&ver=16"
        },
        {
            "name": "Chemists (2112)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2112&ver=16"
        },
        {
            "name": "Civil environmental engineers (in 2131 Civil engineers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2131&ver=16"
        },
        {
            "name": "Engineering managers (0211)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0211&ver=16"
        },
        {
            "name": "Metallurgical and materials engineers (2142)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2142&ver=16"
        },
        {
            "name": "Petroleum engineers (2145)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2145&ver=16"
        },
        {
            "name": "Process control engineers with electrical or electronic specialization (in 2133 Electrical and electronics engineers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2133&ver=16"
        }
    ]
}