{
    "id": "2145",
    "name": "Petroleum engineers",
    "lead statement": "Petroleum engineers conduct studies for the exploration, development and extraction of oil and gas deposits; and plan, design, develop and supervise projects for the drilling, completion, testing and re-working of oil and gas wells. They are employed by petroleum producing companies, consulting companies, well logging or testing companies, government, and research and educational institutions.",
    "example titles": [
        "chief petroleum engineer",
        "drilling and recovery chief engineer",
        "drilling and recovery petroleum engineer",
        "exploitation engineer – oil and gas",
        "exploitation engineer – petroleum",
        "mud engineer",
        "mud engineer – petroleum drilling",
        "natural gas engineer",
        "offshore drilling engineer",
        "offshore drilling rig subsea equipment engineer",
        "oil and gas drilling engineer",
        "oil and gas production engineer",
        "oil well logging engineer",
        "petroleum engineer",
        "petroleum production engineer",
        "petroleum reservoir engineer",
        "petroleum well completion engineer",
        "subsea engineer",
        "well logging engineer"
    ],
    "main duties": [
        "Conduct  feasibility assessment studies for developing new oil and gas fields",
        "Direct and monitor oil and gas drilling operations",
        "Develop drilling programs, select sites and specify drilling fluids, bit selection, drill stem testing procedures and equipment",
        "Direct and monitor the completion and evaluation of wells, well testing and well surveys",
        "Design and select artificial lift machinery, and well and surface production equipment and systems, and specify programs for corrosion control and oil or gas treatment",
        "Develop specifications for and monitor and supervise well modification and stimulation programs to maximize oil and gas recovery",
        "Analyze reservoir rock and fluid data to design optimum recovery methods and to predict reservoir performance and reserves",
        "Monitor and forecast oil and gas reservoir performance and recommend oil recovery techniques which extend the economic life of wells",
        "Design, develop and co-ordinate the installation, maintenance and operation of subsea well-head and production equipment.",
        "Petroleum engineers may specialize in drilling, production, reservoir analysis or subsea operations."
    ],
    "employment requirements": [
        "A bachelor's degree in petroleum engineering or in a related engineering discipline is required.",
        "A master's degree or doctorate in a related engineering discipline may be required.",
        "Licensing by a provincial or territorial association of professional engineers is required to approve engineering drawings and reports and to practise as a Professional Engineer (P.Eng.).",
        "Engineers are eligible for registration following graduation from an accredited educational program, and after three or four years of supervised work experience in engineering and passing a professional practice examination."
    ],
    "additional information": [
        "There is mobility between petroleum engineering specializations at the less senior levels.",
        "Supervisory and senior positions in this unit group require experience.",
        "Engineers often work in a multidisciplinary environment and acquire knowledge and skills through work experience that may allow them to practise in associated areas of science, engineering, sales, marketing or management."
    ],
    "exclusions": [
        {
            "name": "Chemical engineers (2134)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2134&ver=16"
        },
        {
            "name": "Contractors and supervisors, oil and gas drilling and services (8222)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=8&val1=8222&ver=16"
        },
        {
            "name": "Engineering managers (0211)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0211&ver=16"
        },
        {
            "name": "Geological engineers (2144)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2144&ver=16"
        },
        {
            "name": "Geoscientists and oceanographers (2113)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2113&ver=16"
        }
    ]
}