{
    "id": "2152",
    "name": "Landscape architects",
    "lead statement": "Landscape architects conceptualize, design, plan and manage the construction of natural, cultural and built landscape development for commercial projects, office complexes, parks, golf courses and residential development. They are employed by government environmental and development agencies, landscape consulting firms and by architectural and engineering firms, or they are self-employed.",
    "example titles": [
        "landscape architect",
        "senior landscape architect"
    ],
    "main duties": [
        "Confer with clients to determine design needs",
        "Survey and assess designated sites and develop designs taking into consideration landscape features, buildings, climate, future usage and other aspects",
        "Prepare or oversee the preparation of detailed drawings for sites, including features such as trees, shrubs, gardens, lighting, walkways, patios, decks, benches, fences, retaining walls and fountains",
        "Prepare or oversee preparation of site plans, reports, sketches, models, photographs, maps, land use studies, design plans such as landscape grading, drainage or planting, and construction details",
        "Estimate costs, prepare specifications and evaluate tenders for landscape construction projects",
        "Conduct environmental design studies, including environmental assessment, planning and the preservation and re-creation of historical sites",
        "Conduct community and neighbourhood physical planning studies, participate in multidisciplinary urban design studies, prepare design guidelines, and develop master plans",
        "May manage and supervise landscape construction work."
    ],
    "employment requirements": [
        "A bachelor's degree in landscape architecture is required.",
        "A master's degree in landscape architecture may be required.",
        "Registration with a regulatory body is required in Ontario, Alberta and British Columbia.",
        "In the remaining provinces and territories, landscape architects usually require two years of landscape design experience and an interview by their respective provincial associations to receive association certification.",
        "Leadership in Energy and Environmental Design (LEED) certification is offered by the Canada Green Building Council and may be required by some employers."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Architects (2151)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2151&ver=16"
        },
        {
            "name": "Landscape and horticulture technicians and specialists (2225)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2225&ver=16"
        },
        {
            "name": "Landscape architecture managers (in 0212 Architecture and science managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0212&ver=16"
        },
        {
            "name": "Landscape design contractors (in 8255 Contractors and supervisors, landscaping, grounds maintenance and horticulture services",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=8&val1=8255&ver=16"
        },
        {
            "name": "Urban and land use planners (2153)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2153&ver=16"
        }
    ]
}