{
    "id": "2154",
    "name": "Land surveyors",
    "lead statement": "Land surveyors plan, direct and conduct legal surveys to establish the location of real property boundaries, contours and other natural or human-made features, and prepare and maintain cross-sectional drawings, official plans, records and documents pertaining to these surveys. They are employed by federal, provincial and municipal governments, private sector land surveying establishments, real estate development, natural resource, engineering and construction firms, or they may be self-employed.",
    "example titles": [
        "country surveyor",
        "land surveying party chief",
        "land surveyor",
        "pipeline surveyor",
        "port surveyor",
        "property surveyor",
        "provincial land surveyor",
        "railway surveyor"
    ],
    "main duties": [
        "Develop survey plans, methods and procedures for conducting legal surveys",
        "Plan, direct and supervise or conduct surveys to establish and mark legal boundaries of properties, parcels of lands, provincial and Canada Lands, Aboriginal land claims, wellsites, mining claims, utility rights-of-way, roadways and highways",
        "Survey and lay out subdivisions for rural and urban development",
        "Determine precise locations using electronic distance measuring equipment and global positioning systems (GPS)",
        "Analyze, manage and display data using geographic information systems (GIS) and computer-aided design and drafting (CAD)",
        "Record all measurements and other information obtained during survey activities",
        "Prepare or supervise the preparation and compilation of all data, plans, charts, records and documents related to surveys of real property boundaries",
        "Certify and assume liability for surveys made to establish real property boundaries",
        "Advise, provide consultation and testify as an expert witness on matters related to legal surveys",
        "May supervise other land surveyors, and land survey technologists and technicians."
    ],
    "employment requirements": [
        "A bachelor's degree in geomatics engineering or survey engineering \r or A college diploma in survey science or geomatics technology with additional academic credits and successful completion of equivalent examinations set by a regional board of examiners for land surveyors is required.",
        "A one- to three-year articling period is required.",
        "Successful completion of professional land surveyor examinations is required.",
        "A federal or provincial land surveyor's licence is required."
    ],
    "additional information": [
        "Federal statutes require a separate licence from the Association of Canada Land Surveyors to survey areas such as national parks, Aboriginal lands, offshore areas and northern territories."
    ],
    "exclusions": [
        {
            "name": "Engineering managers (0211)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0211&ver=16"
        },
        {
            "name": "Engineering technologists and technicians who apply geotechnical and topographical information to land use and urban planning (in 2231 Civil engineering technologists and technicians",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2231&ver=16"
        },
        {
            "name": "Geomatics and survey engineers (in 2131 Civil engineers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2131&ver=16"
        },
        {
            "name": "Hydrographic surveyors (in 2113 Geoscientists and oceanographers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2113&ver=16"
        },
        {
            "name": "Land survey technologists and technicians (2254)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2254&ver=16"
        },
        {
            "name": "Technical occupations in geomatics and meteorology (2255)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2255&ver=16"
        },
        {
            "name": "Urban and land use planners (2153)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2153&ver=16"
        }
    ]
}