{
    "id": "2232",
    "name": "Mechanical engineering technologists and technicians",
    "lead statement": "Mechanical engineering technologists and technicians provide technical support and services or may work independently in mechanical engineering fields such as the design, development, maintenance and testing of machines, components, tools, heating and ventilating systems, geothermal power plants, power generation and power conversion plants, manufacturing plants and equipment. They are employed by consulting engineering, manufacturing and processing companies, institutions and government departments.",
    "example titles": [
        "aeronautical technologist",
        "aerospace engineering technician",
        "aerospace engineering technologist",
        "automation technologist",
        "cryonics engineering technologist",
        "die designer",
        "equipment development technician",
        "heating designer",
        "heating, ventilating and air conditioning technician",
        "heating, ventilation and air conditioning (HVAC) systems specialist",
        "heating, ventilation and air conditioning (HVAC) technologist",
        "home automation technician",
        "house automation technician",
        "machine designer",
        "machine tool designer",
        "marine engineering technologist",
        "mechanical engineering design technologist",
        "mechanical engineering development technologist",
        "mechanical engineering equipment designer",
        "mechanical engineering technician",
        "mechanical engineering technologist",
        "mechanical equipment engineering assistant",
        "mechanical marine engineering technician",
        "mechanical technical inspector",
        "mechanical technologist",
        "mould designer",
        "nuclear engineering technician",
        "nuclear engineering technologist",
        "nuclear technologist",
        "power equipment design technician",
        "robotics servicing technician",
        "robotics systems installer and repairer",
        "robotics technician",
        "robotics technologist",
        "ship repair technician",
        "thermal station technician",
        "tool and die designer",
        "tool designer",
        "vibration technologist",
        "wind tunnel test technician",
        "wind tunnel test technologist"
    ],
    "main duties": [
        {
            "duty_name": "Mechanical engineering technologists",
            "duty_description": [
                "Prepare and interpret conventional and computer-assisted design (CAD) engineering designs, drawings, and specifications for machines and components, power transmission systems, process piping, heating, ventilating and air conditioning systems",
                "Prepare cost and material estimates, project schedules and reports",
                "Conduct tests and analyses of machines, components and materials to determine their performance, strength, response to stress and other characteristics",
                "Design moulds, tools, dies, jigs and fixtures for use in manufacturing processes",
                "Inspect mechanical installations and construction",
                "Prepare contract and tender documents",
                "Supervise, monitor and inspect mechanical installations and construction projects",
                "Prepare standards and schedules and supervise mechanical maintenance programs or operations of mechanical plants."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Mechanical engineering technicians",
            "duty_description": [
                "Assist in preparing conventional and computer-assisted design (CAD) engineering designs, drawings and specifications",
                "Carry out a limited range of mechanical tests and analyses of machines, components and materials",
                "Assist in the design of moulds, tools, dies, jigs and fixtures for use in manufacturing processes",
                "Assist in inspection of mechanical installations and construction projects",
                "Participate in the installation, repair and maintenance of machinery and equipment."
            ],
            "duty_comment": null
        }
    ],
    "employment requirements": [
        "Completion of a two- or three-year college program in mechanical engineering technology is usually required for mechanical engineering technologists.",
        "Completion of a one- or two-year college program in mechanical engineering technology is usually required for mechanical engineering technicians.",
        "Certification in mechanical engineering technology or in a related field is available through provincial associations of engineering/applied science technologists and technicians and may be required for some positions.",
        "A period of supervised work experience, usually two years, is required before certification.",
        "In Quebec, membership in the regulatory body is required to use the title \"Professional Technologist.\""
    ],
    "additional information": [
        "There is mobility to other related occupations such as technical sales or drafting technologists and technicians.",
        "Progression to supervisory occupations such as mechanical construction supervisor, manufacturing supervisor or operations maintenance manager is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Drafting technologists and technicians (2253)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2253&ver=16"
        },
        {
            "name": "Industrial designers (2252)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2252&ver=16"
        },
        {
            "name": "Technical sales specialists - wholesale trade (6221)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6221&ver=16"
        }
    ]
}