{
    "id": "2243",
    "name": "Industrial instrument technicians and mechanics",
    "lead statement": "Industrial instrument technicians and mechanics repair, maintain, calibrate, adjust, and install industrial measuring and controlling instrumentation. They are employed by pulp and paper processing companies, nuclear and hydro power generating companies, mining, petrochemical and natural gas companies, industrial instrument and other manufacturing companies, and by industrial instrument servicing establishments.",
    "example titles": [
        "apprentice industrial instrument mechanic",
        "apprentice instrument mechanic",
        "heavy water plant control technician",
        "industrial instrument mechanic",
        "industrial instrument panel repairer",
        "industrial instrument service technician",
        "industrial instrument technician",
        "industrial instrumentation and electrical technician",
        "industrial instrumentation technician",
        "industrial process control equipment repairer",
        "instrument maintenance mechanic",
        "instrument mechanic – utilities",
        "measurement technician – oil and gas installation",
        "nuclear generating station and heavy water plant control technician",
        "nucleonic controller repairer",
        "precision instrument mechanic",
        "process control equipment mechanic",
        "process control equipment repairer",
        "process control equipment service technician"
    ],
    "main duties": [
        "Consult manufacturer's manuals, circuit diagrams and blueprints to determine tests and maintenance procedures for instruments used for measuring and controlling flow, level, pressure, temperature, chemical composition and other variables in manufacturing and processing",
        "Inspect and test operation of instruments and systems to diagnose faults using pneumatic, electrical and electronic testing devices and precision measuring instruments",
        "Repair and adjust system components, such as sensors, transmitters and programmable logic controllers, or remove and replace defective parts",
        "Calibrate components and instruments according to manufacturers' specifications",
        "Perform scheduled preventive maintenance work and complete test and maintenance reports",
        "Install control and measurement instruments on existing and new plant equipment and processes",
        "Consult with and advise process operators."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a four- or five-year apprenticeship program in industrial instrument repair \r\n or completion of a two-year college program in industrial instrumentation technology and several years of work experience are usually required for trade certification.",
        "Instrumentation and control technician trade certification is available, but voluntary, in all provinces and territories, except in Quebec.",
        "Red Seal endorsement is also available to qualified instrumentation and control technicians upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Aircraft instrument technicians (in 2244 Aircraft instrument, electrical and avionics mechanics, technicians and inspectors",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2244&ver=16"
        },
        {
            "name": "Electrical and electronics engineering technologists and technicians (2241)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2241&ver=16"
        },
        {
            "name": "Industrial mechanics (in 7311 Construction millwrights and industrial mechanics",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7311&ver=16"
        },
        {
            "name": "Measurement technician – oil and gas inspection (in 2262 Engineering inspectors and regulatory officers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2262&ver=16"
        }
    ]
}