{
    "id": "2271",
    "name": "Air pilots, flight engineers and flying instructors",
    "lead statement": "Air pilots fly fixed wing aircraft and helicopters to provide air transportation and other services such as crop spraying and aerial surveying. Flight engineers assist air pilots with monitoring, troubleshooting and maintenance of aircraft systems and with pre- and post-flight inspections. Flying instructors teach flying techniques and procedures to student and licensed pilots. Air pilots, flight engineers and flight instructors are employed by airline and air freight companies, flying schools and by other public and private sector aircraft operators.",
    "example titles": [
        "aerial crop duster",
        "aerial sprayer",
        "aerial survey flight supervisor",
        "aerial survey pilot",
        "air navigator",
        "air patrol pilot",
        "air pilot",
        "air pilot and flight engineer supervisor",
        "air pilots and navigators supervisor",
        "airline pilot",
        "airline pilot instructor",
        "airline test pilot",
        "airplane pilot",
        "bush pilot",
        "business aircraft pilot",
        "captain – air transport",
        "charter pilot",
        "check pilot",
        "chief flying instructor",
        "chief pilot",
        "chief pilot – air transport",
        "commercial airline pilot",
        "commercial pilot",
        "co-pilot",
        "co-pilot – air transport",
        "corporate pilot",
        "crop duster",
        "engineering test pilot",
        "executive pilot",
        "experimental test pilot",
        "fire patrol pilot",
        "first officer – air transport",
        "flight engineer",
        "flight engineer – air transport",
        "flight instructor",
        "flight simulator instructor",
        "flying instructor",
        "forest spray pilot",
        "forestry patrol pilot",
        "helicopter chief pilot",
        "helicopter flight instructor",
        "helicopter pilot",
        "mapping pilot",
        "navigator – air transport",
        "pilot – air transport",
        "pilot instructor",
        "pipeline air patrol pilot",
        "power line air patrol pilot",
        "relief pilot",
        "remote sensing pilot",
        "second officer – air transport",
        "spray pilot",
        "survey pilot",
        "test pilot",
        "topographic survey pilot",
        "water bomber pilot"
    ],
    "main duties": [
        "Conduct pre-flight inspection of aircraft and check passenger and cargo distribution to ensure that weight and balance specifications are met",
        "Co-ordinate flight activities with ground crews and air-traffic control, inform crew members of flight and test procedures and direct activities of aircraft crew during flights",
        "Contact control towers for takeoff clearances, arrival instructions and other information",
        "Conduct in-flight tests and monitor functioning of aircraft equipment and systems during flights, maintain communications with flight dispatchers and weather forecasters and respond to and report in-flight emergencies and malfunctions",
        "Prepare flight evaluation reports",
        "Train pilots to use new equipment, or prepare them for examinations to revalidate or upgrade existing licences",
        "May fly new or experimental planes to examine their flight performance and safety",
        "May participate in search and rescue operations, forest firefighting, aerial surveying, crop dusting and other services.",
        "Inspect aircraft prior to takeoff according to pre-flight checklist and verify passenger and cargo distribution to ensure that weight and balance specifications are met",
        "Assist air pilots in monitoring aircraft systems, equipment and functions during flight",
        "Make in-flight repairs, such as replacing fuses and adjusting instruments, and follow emergency procedures to compensate for equipment malfunction or failure",
        "Perform post-flight inspections, record equipment malfunctions and corrective actions taken during flight and report required repairs to ground maintenance personnel.",
        "Instruct student pilots in procedures and techniques of flying aircraft and in ground-school subjects such as navigation, radio procedures and flying regulations",
        "Train licensed pilots for additional certification."
    ],
    "employment requirements": [
        "Completion of secondary school and graduation from a certified flying or aviation school are required.",
        "A university degree or college diploma may be required.",
        "A commercial pilot's licence or an air transport pilot's licence is required.",
        "Additional licences or endorsements to fly different types of aircraft are required.",
        "Flight engineers require a flight engineer licence issued by Transport Canada.",
        "Structured training is provided by employers.",
        "Completion of secondary school and graduation from a certified flying or aviation school are required.",
        "A university degree or college diploma may be required.",
        "A commercial pilot's or an air transport pilot's licence is required.",
        "Transport Canada ratings and endorsements to provide instructions on different types of aircraft are required."
    ],
    "additional information": [
        "Flight engineers may progress to co-pilot and pilot positions with required hours of flying experience and completion of licensing and endorsement requirements."
    ],
    "exclusions": [
        {
            "name": "Air traffic controllers and related occupations (2272)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2272&ver=16"
        },
        {
            "name": "Ground school instructors (in 4021 College and other vocational instructors",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4021&ver=16"
        }
    ]
}