{
    "id": "2275",
    "name": "Railway traffic controllers and marine traffic regulators",
    "lead statement": "Railway traffic controllers co-ordinate passenger and freight train traffic on railways. They are employed by rail transport companies. Marine traffic regulators monitor and regulate coastal and inland marine traffic within assigned waterways. They are employed by port, harbour, canal and lock authorities and by the Canadian Coast Guard.",
    "example titles": [
        "centralized traffic control (CTC) operator – railway traffic",
        "centralized traffic controller – railway traffic",
        "chief rail traffic controller",
        "chief train dispatcher",
        "head train dispatcher",
        "locomotive dispatcher",
        "marine traffic controller",
        "marine traffic regulator",
        "rail traffic controller",
        "train dispatcher",
        "train dispatchers supervisor",
        "train operator",
        "waterway traffic checker"
    ],
    "main duties": [
        {
            "duty_name": "Railway traffic controllers",
            "duty_description": [
                "Operate and monitor centralized traffic control systems to co-ordinate and follow railway traffic",
                "Chart train movements, calculate arrival and departure times and record rail traffic information",
                "Issue instructions to control the movement of passenger and freight train traffic and on-track mobile maintenance equipment",
                "Receive, record and relay train instructions to train crew by hand or radio telephone",
                "May supervise and train other railway traffic controllers."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Marine traffic regulators",
            "duty_description": [
                "Direct and monitor vessel movements using radar or closed circuit monitors, remote radio systems and other telecommunication equipment",
                "Obtain position, course, speed and estimated arrival time of vessels and monitor vessel progress through traffic zone",
                "Issue clearance instructions to vessels, advise vessels of traffic volumes and weather conditions, and relay information to next marine traffic control sector",
                "Report accidents, distress signals, navigational hazards and other emergencies to authorities",
                "Maintain radio and telephone contact with adjacent marine control sectors and with vessels within area of jurisdiction",
                "Maintain log of vessel movements, size and structure."
            ],
            "duty_comment": null
        }
    ],
    "employment requirements": [
        "Railway traffic controllers usually require completion of secondary school and several years of experience in the railway industry.",
        "Up to 35 weeks of a combination of classroom and on-the-job training is provided for railway traffic controllers.",
        "Railway traffic controllers require a Canadian Rail Operating Rules certificate.",
        "Marine traffic regulators require completion of secondary school and several months of formal traffic regulator training."
    ],
    "additional information": [
        "There is little mobility between traffic controlling occupations in the railway and marine sectors.",
        "With experience, railway traffic controllers may progress to supervisory positions in rail transport operations."
    ],
    "exclusions": [
        {
            "name": "Harbour masters (in 0714 Facility operation and maintenance managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0714&ver=16"
        },
        {
            "name": "Subway traffic controllers (in 7305 Supervisors, motor transport and other ground transit operators",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7305&ver=16"
        },
        {
            "name": "Supervisors, railway transport operations (7304)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7304&ver=16"
        }
    ]
}