{
    "id": "3122",
    "name": "Chiropractors",
    "lead statement": "Chiropractors diagnose, treat and prevent patients' neuromuscular-skeletal disorders of the spine, nervous system, pelvis and other body joints by adjusting the spinal column or through other corrective manipulation. Chiropractors are usually in private practice or in clinics with other health practitioners.",
    "example titles": [
        "chiropractic doctor",
        "chiropractor",
        "doctor of chiropractic (DC)"
    ],
    "main duties": [
        "Take patients' case history, conduct examinations, observe patients, and perform X-rays and other tests to diagnose patient's condition",
        "Diagnose neuromuscular-skeletal disorders of the spinal column, pelvis, extremities and associated tissues",
        "Treat health disorders in a natural manner through adjustments or articular manipulations and complementary treatments such as electrotherapy, acupuncture, heat therapy and massage with special attention given to the spine",
        "Advise patients on alternate treatment modalities such as corrective exercises, posture, lifestyle and nutrition that have positive effects on the spine, joints, muscles and nervous system. ",
        "Refer patients for medical care when appropriate."
    ],
    "employment requirements": [
        "A minimum of two years of university undergraduate studies in sciences \r\n and completion of a four- or five-year program at an institution accredited by the Accreditation Commission of the Council on Chiropractic Education \r\n and completion of the examinations of the Canadian Chiropractic Examining Board and of the provincial licensing body are required.",
        "Licensing by a regulatory body is required in all provinces and in the Yukon."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Chiropractic aides (in 3414 Other assisting occupations in support of health services",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=3&val1=3414&ver=16"
        }
    ]
}