{
    "id": "3125",
    "name": "Other professional occupations in health diagnosing and treating",
    "lead statement": "This unit group includes health professionals who diagnose and treat the diseases and injuries of patients and who are not elsewhere classified. This includes doctors of podiatric medicine, chiropodists and podiatrists, naturopaths, orthoptists and doctors of osteopathic medicine. They work in private practices, clinics and hospitals.",
    "example titles": [
        "chief orthoptist",
        "chiropodist",
        "clinical orthoptist",
        "doctor of naturopathic medicine",
        "doctor of naturopathy",
        "doctor of osteopathic medicine",
        "doctor of osteopathy",
        "doctor of podiatric medicine (D.P.M.)",
        "foot specialist",
        "naturopath",
        "naturopathic doctor (ND)",
        "naturopathic physician",
        "orthoptist",
        "osteopath – physician",
        "osteopathic doctor",
        "osteopathic physician",
        "podiatrist",
        "teaching orthoptist"
    ],
    "main duties": [
        {
            "duty_name": "Doctors of podiatric medicine",
            "duty_description": [
                "Diagnose diseases, deformities and injuries of the human foot and communicate diagnoses to patients",
                "Treat patients using braces, casts, shields, orthotic devices, physical therapy, or prescribed medications",
                "May also perform surgery on the bones of the forefoot and the subcutaneous soft tissues of the foot."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Chiropodists and diploma or first-degree trained podiatrists",
            "duty_description": [
                "Diagnose diseases, deformities and injuries of the human foot",
                "Treat patients using braces, casts, shields, orthotic devices, physical therapy and subcutaneous soft-tissue foot surgery."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Naturopaths",
            "duty_description": [
                "Diagnose patients' diseases and disorders",
                "Employ natural methods of healing such as acupuncture and acupressure, spinal manipulation, reflexology, hydrotherapy, herbal medicines, biochemical therapy, clinical nutrition, homeopathy and counselling in their treatment."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Orthoptists",
            "duty_description": [
                "Work alongside ophthalmologists to diagnose and treat eye disorders by performing specialized eye tests to measure and assess defective binocular vision or abnormal eye movement in patients",
                "Prescribe treatment such as eye exercises or patching regimens."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Doctors of osteopathic medicine",
            "duty_description": [
                "Diagnose disorders and injuries of the musculoskeletal, circulatory and nervous systems",
                "Treat patients with manipulative therapy, medications or surgery."
            ],
            "duty_comment": null
        }
    ],
    "employment requirements": [
        "A four-year doctoral degree program in podiatric medicine available in the United States and in Quebec, normally following completion of a bachelor's degree program, is required.",
        "A medical residency is required in Alberta and British Columbia.",
        "A doctor of podiatric medicine (D.P.M.) degree is required to practise podiatry in Quebec, Ontario, Alberta and British Columbia.",
        "A three-year diploma program in chiropody (DCh) obtained in Canada \r\n or a first-degree program in podiatric medicine (D.Pod.M.) obtained abroad (United Kingdom) is usually required.",
        "A licence is required in New Brunswick, Quebec, Ontario, Manitoba, Saskatchewan, Alberta and British Columbia.",
        "A university degree in pre-medical science is required.",
        "Completion of a university program in naturopathic medicine, obtained abroad \r\n or a four-year program in naturopathic medicine from a private institute is required.",
        "A licence is required in Nova Scotia, Ontario, Manitoba, Saskatchewan, Alberta and British Columbia.",
        "A bachelor's degree and completion of a two-year accredited training program in orthoptics are required.",
        "Certification with the Canadian Orthoptic Council is required.",
        "Continuing education is required for recertification with the Canadian Orthoptic Council.",
        "A bachelor's degree is required for admission to a doctor of osteopathic medicine program.",
        "A four-year program in osteopathic medicine leading to a doctor of osteopathy degree \r\n and a one-year medical residency are required. These qualifications are obtained in the United States.",
        "Completion of the certifying examinations of the Royal College of Physicians and Surgeons of Canada\r\n and licensing by the provincial or territorial licensing authority are required."
    ],
    "additional information": [
        "Chiropodist and podiatrist titles are used interchangeably in some provinces, although the title podiatrist is becoming more common. The use of the podiatrist job title does not necessarily refer to doctors of podiatric medicine (D.P.M.).",
        "Orthoptists often work as part of a medical team which includes ophthalmologists, opticians and other ophthalmic medical personnel.",
        "Orthoptists may also be trained as ophthalmic technicians or technologists.",
        "Doctors of osteopathic medicine may obtain a licence as general practitioners."
    ],
    "exclusions": [
        {
            "name": "Chiropractors (3122)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=3&val1=3122&ver=16"
        },
        {
            "name": "General practitioners and family physicians (3112)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=3&val1=3112&ver=16"
        },
        {
            "name": "Specialist physicians (3111)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=3&val1=3111&ver=16"
        },
        {
            "name": "Osteopathic manual therapists (in 3232 Practitioners of natural healing",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=3&val1=3232&ver=16"
        }
    ]
}