{
    "id": "3141",
    "name": "Audiologists and speech-language pathologists",
    "lead statement": "Audiologists diagnose, evaluate and treat individuals with peripheral and central hearing loss, tinnitus and balance problems. Speech-language pathologists diagnose, assess and treat human communication disorders including speech, fluency, language, voice and swallowing disorders. Audiologists and speech-language pathologists are employed in hospitals, community and public health centres, extended care facilities, day clinics, rehabilitation centres and educational institutions, or may work in private practice. Audiologists and speech-language pathologists who are supervisors are included in this unit group.",
    "example titles": [
        "amplification audiologist",
        "audiologist",
        "audiology clinician",
        "audiology specialist",
        "certified audiologist",
        "certified hearing aid audiologist",
        "clinical audiologist",
        "community audiologist",
        "community speech-language pathologist",
        "diagnostic audiologist",
        "dispensing audiologist",
        "educational audiologist",
        "educational speech-language pathologist",
        "human communication disorders specialist",
        "industrial audiologist",
        "logopedist",
        "pediatric audiologist",
        "research audiologist",
        "speech and hearing therapist",
        "speech pathologist",
        "speech therapist",
        "speech-language clinician",
        "speech-language pathologist",
        "speech-language pathologist clinician",
        "speech-language pathologist researcher"
    ],
    "main duties": [
        "Develop and administer audiometric tests and examinations using specialized instruments and electronic equipment to diagnose and evaluate the degree and type of patients' hearing impairment",
        "Plan and implement habilitation/rehabilitation programs for patients, including selection, fitting and adjustment of amplification devices, such as hearing aids, balance retraining exercises and teaching speech (lip) reading",
        "Educate and counsel patients and families regarding the nature, extent, impact and implications of hearing loss and treatment",
        "Establish personalized care plans working as a member of an interdisciplinary team",
        "Conduct research related to hearing and hearing disorders",
        "May instruct and supervise audiometric technicians, students and other health care personnel.",
        "Administer tests and examinations and observe patients to diagnose and evaluate speech, voice, resonance, language, fluency, cognitive-linguistic and swallowing disorders",
        "Develop, plan and implement remedial programs to correct speech, voice, language, fluency, resonance, cognitive-linguistic and swallowing disorders",
        "Establish group and personalized care plans working as a member of an interdisciplinary team",
        "Educate and counsel patients and families regarding communication and swallowing disorders",
        "Conduct research on speech and other communication disorders and on the development and design of diagnostic procedures and devices",
        "May instruct and supervise communicative disorders assistants, students and other health care personnel."
    ],
    "employment requirements": [
        "Audiologists require a master's degree in audiology.",
        "Speech-language pathologists require a master's degree in speech-language pathology.",
        "Registration with a regulatory body is required for audiologists and speech-language pathologists in Newfoundland and Labrador, New Brunswick, Quebec, Ontario, Manitoba, Saskatchewan, Alberta and British Columbia.",
        "Membership in the national association, Canadian Association of Speech-Language Pathologists and Audiologists, is usually required.",
        "In some jurisdictions, audiologists may be required to obtain a separate licence to dispense hearing aids."
    ],
    "additional information": [
        "Progression into management positions, such as chief audiologist or director of speech-language pathology, is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Audiology and speech-language technical and assisting occupations (in 3237 Other technical occupations in therapy and assessment",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=3&val1=3237&ver=16"
        },
        {
            "name": "Braille, lip-reading and sign language instructors (in 4215 Instructors of persons with disabilities",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4215&ver=16"
        },
        {
            "name": "Managers in health care (0311)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0311&ver=16"
        },
        {
            "name": "Phoniatricians (in 3111 Specialist physicians",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=3&val1=3111&ver=16"
        }
    ]
}