{
    "id": "4153",
    "name": "Family, marriage and other related counsellors",
    "lead statement": "Family, marriage and other related counsellors assist individuals and groups of clients to identify, understand and overcome personal problems and achieve personal objectives. They are employed by counselling centres, social service agencies, group homes, government agencies, family therapy centres, and health care and rehabilitation facilities, or they may work in private practice.",
    "example titles": [
        "addictions counsellor",
        "alcohol addiction counsellor",
        "behavioural consultant",
        "bereavement counsellor",
        "child and family counsellor",
        "child and youth counsellor",
        "children's counsellor",
        "clinical counsellor",
        "community mental health counsellor",
        "counselling program supervisor",
        "counsellor for persons who are intellectually impaired",
        "couples therapist",
        "crisis counsellor",
        "disability consultant",
        "drug addiction counsellor",
        "eating disorder therapist",
        "family counsellor",
        "family planning counsellor",
        "family therapist",
        "family therapist (FT)",
        "gambling addictions counsellor",
        "gambling addictions therapist",
        "genetic counsellor",
        "grief counsellor",
        "group home counsellor",
        "human relations officer – family and children's services",
        "human relations officer – family therapy",
        "marital counsellor",
        "marriage and family therapist",
        "marriage and family therapist (MFT)",
        "marriage consultant",
        "marriage counsellor",
        "marriage therapist",
        "marriage therapist (MT)",
        "mental health counsellor",
        "play therapist",
        "preretirement counsellor",
        "psychoeducational consultant",
        "psychoeducator",
        "registered clinical counsellor",
        "registered family therapist",
        "registered marriage and family therapist",
        "registered marriage therapist",
        "rehabilitation counsellor",
        "sex therapist",
        "sexologist",
        "special needs counsellor",
        "vocational rehabilitation consultant",
        "vocational rehabilitation counsellor",
        "welfare organization counsellor",
        "zootherapist"
    ],
    "main duties": [
        "Interview clients, prepare case histories and assess problems",
        "Conduct vocational testing and psychometric assessment",
        "Develop and implement counselling and intervention programs to assist clients in determining goals and means of attaining them",
        "Counsel clients, provide therapy and mediation services, and facilitate group sessions",
        "Liaise with community agencies or partners,  and identify additional or alternative services and provide referrals",
        "Evaluate the effectiveness of counselling programs and interventions, and clients' progress in resolving identified problems and movement toward defined objectives",
        "Follow up on results of counselling programs and clients' adjustments",
        "Prepare assessment, progress, follow-up and court reports",
        "May supervise other counsellors, social service staff and assistants",
        "May provide public education and consultation to other professionals or groups regarding counselling services, issues and methods",
        "May provide witness testimony in court proceedings",
        "May conduct research, publish research papers, educational texts and articles and deliver presentations at conferences.",
        "May participate in fundraising activities.",
        "Family, marriage and other related counsellors often specialize in dealing with a specific client group such as injured workers, or with specific problems, such as drug and alcohol addiction, marital difficulties or behavioural disorders."
    ],
    "employment requirements": [
        "A master's degree in the field of counselling, mental health or a related social service discipline is usually required.",
        "In Quebec, a master's degree in psychoeducation is required to practise as a psycho-educator.",
        "An undergraduate degree or college diploma in a social science is required for certain areas of counselling.",
        "Membership with a provincial association for marriage and family therapists or clinical counsellors is required to use the title \"Registered Marriage and Family Therapist\" or \"Registered Clinical Counsellor\", and in Quebec, to use the title \"marriage and family therapist (MFT)\", \"family therapist (FT)\" or \"marriage therapist (MT)\". Membership with a provincial association may be required by some employers.",
        "Registration with a regulatory body is required in Nova Scotia, New Brunswick, Québec and Ontario.",
        "Registered marriage and family therapists and registered clinical counsellors must meet strict criteria involving postgraduate education and a period of supervised clinical work with clients."
    ],
    "additional information": [
        "Counsellors usually become specialized in a particular area through training and experience.",
        "Progression to social service management positions is possible with additional training and experience."
    ],
    "exclusions": [
        {
            "name": "Educational counsellors (4033)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4033&ver=16"
        },
        {
            "name": "Employment counsellors (4156)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4156&ver=16"
        },
        {
            "name": "Managers in social, community and correctional services (0423)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0423&ver=16"
        },
        {
            "name": "Social and community service workers (4212)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4212&ver=16"
        },
        {
            "name": "Social workers (4152)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4152&ver=16"
        }
    ]
}