{
    "id": "4154",
    "name": "Professional occupations in religion",
    "lead statement": "Professionals in this unit group conduct religious services, administer the rites of a religious faith or denomination, provide spiritual and moral guidance and perform other functions associated with the practice of a religion. They perform these duties in churches, synagogues, temples or other places of worship. They may also work in other institutions such as schools, hospitals and prisons.",
    "example titles": [
        "archbishop",
        "archdeacon",
        "assistant minister – religion",
        "bishop",
        "cardinal",
        "chancellor – religion",
        "chaplain",
        "clergyman/woman",
        "curate",
        "evangelist",
        "granthi",
        "imam",
        "minister",
        "minister – religion",
        "moderator – religion",
        "officiating clergyman/woman",
        "parish priest",
        "pastor",
        "preacher",
        "presbyter",
        "priest",
        "rabbi",
        "reverend",
        "Salvation Army commissioned officer",
        "television evangelist"
    ],
    "main duties": [
        "Conduct regular religious services",
        "Administer rites of faiths such as marriages and funerals",
        "Pray and promote spirituality by delivering sermons and other talks",
        "Provide spiritual and moral guidance to members of a religious faith",
        "Supervise, plan and administer programs of religious education",
        "May participate in humanitarian endeavours and delivery of social services and welfare activities",
        "May share in the administrative and financial operation of a religious community",
        "May provide consultation services to government and other organizations."
    ],
    "employment requirements": [
        "Completion of college, university or other program in religious studies is usually required. Some occupations in this unit group may require a master’s of divinity or theology.",
        "A period of study with a senior minister is usually required."
    ],
    "additional information": [
        "Progression to senior positions included in this unit group, within a religious order, is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Other religious occupations (4217)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4217&ver=16"
        }
    ]
}