{
    "id": "4161",
    "name": "Natural and applied science policy researchers, consultants and program officers",
    "lead statement": "Natural and applied science policy researchers, consultants and program officers conduct research, prepare reports, provide consultation and advice and administer programs in a variety of areas related to the natural and applied sciences. They are employed by federal, provincial and municipal governments, computer and office furniture manufacturers, educational institutions, research organizations, consulting firms, environmental and conservation organizations, or they may be self-employed.",
    "example titles": [
        "agricultural association analyst",
        "agricultural issues lobbyist",
        "certified ergonomist",
        "certified industrial hygienist",
        "communications policy researcher",
        "disaster emergency response planner",
        "emergency management analyst",
        "emergency preparedness planner",
        "energy policy analyst",
        "energy program officer",
        "environmental advisor (except engineer)",
        "environmental consultant (except engineer)",
        "environmental education consultant",
        "environmental impact analyst",
        "environmental issues lobbyist",
        "environmental lobbyist",
        "environmental program co-ordinator",
        "environmental program development supervisor",
        "environmental program manager",
        "ergonomics consultant",
        "ergonomics specialist",
        "ergonomist",
        "fisheries analyst",
        "fisheries program officer",
        "human factors engineer",
        "human factors specialist (except engineer)",
        "industrial hygienist",
        "industrial waste reduction program co-ordinator",
        "interface ergonomist",
        "multimedia ergonomist",
        "municipal recycling program co-ordinator",
        "natural and applied sciences consultant",
        "natural and applied sciences policy advisor",
        "natural and applied sciences policy analyst",
        "natural and applied sciences program officer",
        "natural and applied sciences researcher",
        "natural resources planner",
        "natural resources policy analyst",
        "occupational hygiene officer",
        "occupational hygienist",
        "patent agent",
        "patent searcher",
        "program co-ordinator – environmental organization",
        "recycling co-ordinator – residuals management",
        "recycling program co-ordinator",
        "regional recycling and waste reduction program co-ordinator",
        "registered occupational hygienist",
        "registered patent agent",
        "scientific consultant",
        "solid waste program co-ordinator",
        "solid waste program manager",
        "technology transfer officer",
        "transportation program analyst",
        "transportation safety analyst",
        "waste diversion consultant",
        "waste diversion program co-ordinator",
        "waste diversion program manager",
        "waste management program co-ordinator",
        "waste reduction and recycling officer",
        "waste reduction education program officer",
        "waste reduction program co-ordinator",
        "wind energy analyst",
        "work site analyst",
        "work site auditor"
    ],
    "main duties": [
        "Conduct research and advise on, and intervene in the physical, social and psychological interrelationships between persons, their equipment and working or living environments to ensure that the design, configuration and use of equipment, procedures and environmental conditions maximize safety, productivity and comfort.",
        "Study, evaluate and control physical, chemical and biological hazards and stresses in the workplace",
        "Report and document investigations and conclusions",
        "Suggest changes to work environments and processes",
        "Provide information to workers and managers or employers on methods to reduce the risk of injury or illness from specific occupational hazards",
        "May teach safe work procedures, participate in emergency response planning, testify at hearings and report findings at scientific conferences or in scientific journals.",
        "Advise clients on elements of patent law and on the patentability of inventions",
        "Conduct patent searches",
        "Prepare patent applications",
        "Represent clients before the patent office.",
        "Transfer and integrate new technologies, usually from university or government research and development environments, to commercial and industrial applications and ensure the protection of intellectual property of researchers and developers.",
        "Conduct research and advise on policies or develop or administer programs related to transportation, emergency preparedness, communications, natural resources, agriculture, the environment, traditional and alternative energy technologies, land use, recycling and other scientific fields",
        "Promote public awareness and education on issues such as utilization of natural resources, the environment, and reprocessing and reduction of waste."
    ],
    "employment requirements": [
        "A bachelor's degree or college diploma in a related scientific or technical discipline is usually required for occupations in this unit group.",
        "A master's degree in a related scientific discipline may be required.",
        "Certification through the Canadian College of Certified Professional Ergonomists is required to use the title \"Canadian Certified Professional Ergonomist (CCPE)\". Membership with the Association of Canadian Ergonomists may be required.",
        "Occupational hygienists may require certification by the Canadian Registration Board of Occupational Hygienists.",
        "Patent agents require 12 months of work experience in the patent field and successful completion of examinations set by the Commissioner of Patents. They may also be required to be listed in the register of patent agents.",
        "Occupations in this group that are involved in green building design and technologies development may require the Leadership in Energy and Environmental Design (LEED) certification offered by the Canadian Green Building Council."
    ],
    "additional information": [
        "Progression to supervisory or managerial positions in these fields is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Architecture and science managers (0212)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0212&ver=16"
        },
        {
            "name": "Health policy researchers, consultants and program officers (4165)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4165&ver=16"
        },
        {
            "name": "Patent lawyers (in 4112 Lawyers and Quebec notaries",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4112&ver=16"
        }
    ]
}