{
    "id": "4162",
    "name": "Economists and economic policy researchers and analysts",
    "lead statement": "Economists and economic policy researchers and analysts conduct research, monitor data, analyze information and prepare reports and plans to resolve economic and business problems and develop models to analyze, explain and forecast economic behaviour and patterns. They advise on matters such as finance, fiscal and monetary policy, international trade, agricultural and natural resource commodities and labour and industrial markets. They are employed by government departments and agencies and throughout the private sector in associations, unions, research organizations, banks and investment firms.",
    "example titles": [
        "agricultural economist",
        "business analyst – economics",
        "business economist",
        "business intelligence analyst",
        "consumer advisor – economics",
        "development economist",
        "econometrician",
        "economic advisor",
        "economic analyst",
        "economic consultant",
        "economic policy adviser",
        "economic policy analyst",
        "economic policy researcher",
        "economic research group supervisor",
        "economist",
        "energy economist",
        "farm economist",
        "financial economist",
        "financial market economist",
        "fiscal economics analyst",
        "forest economist",
        "forest resources economist",
        "general economist",
        "health economist",
        "human resources economist",
        "industrial economist",
        "industrial relations economist",
        "industrial trade economist",
        "international trade economist",
        "investment economist",
        "labour economist",
        "labour market information analyst",
        "land use economist",
        "mathematical economist",
        "natural resources economist",
        "price economist",
        "regional economist",
        "resource economist",
        "risk management analyst",
        "salary analyst – economic policy",
        "social economist",
        "tax economist",
        "territorial resources economist",
        "trade analyst",
        "trade economist",
        "transport economist",
        "wage analyst – economic policy",
        "welfare economist"
    ],
    "main duties": [
        "Conduct research and develop models to analyze, explain and forecast economic behaviour and patterns, and devise methods for collection and analysis of data",
        "Forecast production and consumption of specific products and services based on records of past production and consumption and general economic and industry-specific conditions",
        "Prepare forecasts of income and expenditure, interest rates and exchange rates",
        "Analyze factors which determine economic growth and advise government agencies on policies to increase economic activities",
        "Analyze factors which determine labour force participation, employment, wages, unemployment and other labour market outcomes",
        "Study mathematical formulae and statistical techniques and apply them to the testing and quantifying of economic theories and the solution of economic problems",
        "Study the nature of money, credit and the operation of banks and other financial institutions to develop monetary policies and forecasts of financial activity",
        "Monitor economic data to assess the effectiveness, and advise on the appropriateness, of monetary and fiscal policies",
        "Examine problems related to the economic activity of individual companies",
        "Examine financial methods, production costs and techniques and marketing policies to recommend possible improvements",
        "Examine statistical data on the exchange of goods and services among nations",
        "Forecast production and consumption of renewable resources and supply, consumption and depletion of non-renewable resources",
        "Conduct research on market conditions in local, regional or national area to set sales and pricing levels for goods and services, to assess market potential and future trends and to develop business strategies",
        "Monitor regional and local economic trends",
        "Study regulatory processes and provide material in support of legal proceedings with government and other parties."
    ],
    "employment requirements": [
        "A master's degree in economics or in a related discipline such as business administration or statistics is usually required.",
        "A doctorate in economics may be required."
    ],
    "additional information": [
        "Progression to managerial positions in economics is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Business development officers and marketing researchers and consultants (4163)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4163&ver=16"
        },
        {
            "name": "Economists who teach at universities (in 4011 University professors and lecturers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4011&ver=16"
        },
        {
            "name": "Financial and investment analysts (1112)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1112&ver=16"
        },
        {
            "name": "Government managers - economic analysis, policy development and program administration (0412)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0412&ver=16"
        },
        {
            "name": "Labour policy analysts (in 4164 Social policy researchers, consultants and program officers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4164&ver=16"
        }
    ]
}