{
    "id": "4211",
    "name": "Paralegal and related occupations",
    "lead statement": "Paralegals prepare legal documents and conduct research to assist lawyers or other professionals. Independent paralegals provide legal services to the public as allowed by government legislation, or provide paralegal services on contract to law firms or other establishments. Notaries public administer oaths, take affidavits, sign legal documents and perform other activities according to the scope of their practice. Trademark agents advise clients on intellectual property matters. Paralegals are employed by law firms, by record search companies and in legal departments throughout the public and private sectors. Independent paralegals are usually self-employed. Notaries public are employed by government and in the public and private sectors or they may be self-employed. Trademark agents are employed by law firms and legal departments throughout the public and private sectors, trademark development and search firms or they may be self-employed.",
    "example titles": [
        "abstractor",
        "brief writer – law",
        "British Columbia notary public",
        "collection paralegal",
        "commercial law clerk",
        "commercial law paralegal",
        "contract clerk – law",
        "conveyance clerk",
        "copyright agent",
        "corporate law and litigation clerk",
        "corporate law clerk",
        "corporate paralegal",
        "corporate securities law clerk",
        "corporation paralegal",
        "court and tribunal agent",
        "criminal law clerk",
        "criminal law paralegal",
        "family law clerk",
        "family law paralegal",
        "foreclosure clerk",
        "foreclosure paralegal",
        "independent paralegal",
        "insurance law clerk",
        "insurance paralegal",
        "labour law clerk",
        "labour law paralegal",
        "land titles clerk",
        "land titles examiner",
        "law clerk",
        "law clerk to judge",
        "lay notary public",
        "lease and title clerk",
        "legal researcher",
        "legal technician",
        "litigation law clerk",
        "litigation paralegal",
        "mortgage and real estate paralegal",
        "notary public",
        "notary public (British Columbia)",
        "notary public (outside Quebec)",
        "notary public clerk",
        "oil and gas property paralegal",
        "oil and gas rights law clerk",
        "oil and gas rights paralegal",
        "paralegal",
        "property paralegal",
        "real estate law clerk",
        "real estate paralegal",
        "registered trademark agent",
        "tax law clerk",
        "tax paralegal",
        "title and lease clerk",
        "title examiner",
        "title searcher",
        "trademark agent",
        "transfer-of-title clerk",
        "wills and estates law clerk",
        "wills and estates paralegal"
    ],
    "main duties": [
        "Assist lawyers by interviewing clients, witnesses and other related parties, assembling documentary evidence, preparing trial briefs, and arranging for trials",
        "Assist lawyers in preparation for mediation and judicial dispute resolutions",
        "Under the supervision of a lawyer, prepare wills, real estate transactions and other legal documents, court reports and affidavits",
        "Research records, court files and other legal documents",
        "Draft legal correspondence and perform general office and clerical duties.",
        "Represent clients in small claims court and in other lower court proceedings, at tribunals and before administrative bodies",
        "Advise clients and take legal action on landlord and tenant matters, traffic violations, name changes and other issues within their jurisdictions.",
        "Administer oaths and take affidavits and depositions",
        "Witness and certify the validity of signatures on documents",
        "May draft contracts, prepare promissory notes and draw up wills, mortgages and other legal documents",
        "May arrange probates and administer the estates of deceased persons.",
        "Advise clients on intellectual property matters and represent clients before the Registrar of Trade-Marks on matters including prosecution of applications for registration of trademarks",
        "Advise on the registrability of trademarks, trademark licensing requirements, transfer of intellectual property and protection of existing trademark rights",
        "Represent clients at proceedings before the Trade Marks Opposition Board and in related proceedings",
        "May represent clients internationally in consultation with foreign associates and attorneys."
    ],
    "employment requirements": [
        "Paralegals in law firms require a bachelor's degree in law or a law college diploma and in-house training from a law firm or other legal establishment.",
        "Independent paralegals require knowledge of legal principles and procedures usually obtained through industry-sponsored courses and through experience, or through completion of a community college paralegal program.",
        "Paralegals require a licence to perform advanced legal services.",
        "Notaries public usually require a university degree in law or a related field.",
        "Notaries public are appointed after examination and certification of their qualifications by the governing judiciary in their province or territory. All appointments have specific limitations on the activities they can perform and for specific periods of time.",
        "Notaries public require a provincial licence. In British Columbia, membership in the Society of Notaries Public is also required.",
        "To be licensed, trademark agents are required to work in the area of trademark law, including the preparation and prosecution of trademark applications for registration, for two years \r\n and to successfully complete the examination conducted jointly by the Intellectual Property Institute of Canada and the Registrar of Trade-Marks, Canadian Intellectual Property Office \r\n or either one of the above and to be a lawyer entitled to practise in Canada.",
        "Trademark agents require registration with the federal Trade-Mark Office."
    ],
    "additional information": [
        "Notaries public usually receive in-house training and perform their duties in rural or remote areas or in the business offices in which they are employed."
    ],
    "exclusions": [
        {
            "name": "Articling law students, Quebec notaries and trademark lawyers (in 4112 Lawyers and Quebec notaries",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4112&ver=16"
        },
        {
            "name": "Legal administrative assistants (1242)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1242&ver=16"
        },
        {
            "name": "Patent agents (in 4161 Natural and applied science policy researchers, consultants and program officers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4161&ver=16"
        }
    ]
}