{
    "id": "4421",
    "name": "Sheriffs and bailiffs",
    "lead statement": "Sheriffs execute and enforce court orders, warrants and writs, participate in seizure and sale of property and perform courtroom and other related duties. Bailiffs serve legal orders and documents, seize or repossess properties, evict tenants and perform other related activities. Sheriffs and bailiffs are employed by provincial or territorial courts, and bailiffs may be employed as officers of the court or in private service as agents for creditors.",
    "example titles": [
        "automobile repossessor",
        "bailiff",
        "car repossessor",
        "chief deputy sheriff",
        "chief sheriff",
        "court bailiff",
        "court enforcement officer",
        "deputy sheriff",
        "district sheriff",
        "private bailiff",
        "process server",
        "sheriff",
        "sheriff's bailiff",
        "sheriff's officer",
        "sub-sheriff",
        "writ server – bailiff"
    ],
    "main duties": [
        "Serve statements of claims, summonses, warrants, jury summonses, orders to pay spousal support, and other court orders",
        "Serve writs of execution by seizing and selling property and distributing the proceeds according to court decisions",
        "Locate property and make seizures and removals under various acts of Parliament",
        "Provide courthouse security for judges and perimeter security for the courthouse",
        "Escort prisoners to and from courts and correctional institutions",
        "Prepare comprehensive reports and affidavits and maintain records",
        "Attend court, escort witnesses and assist in maintaining order",
        "Ensure security support services for sequestered juries",
        "Issue warrants for imprisonment, arrest or apprehension."
    ],
    "employment requirements": [
        "Completion of secondary school is required.",
        "A college diploma or bachelor's degree in legal studies is usually required.",
        "Sheriffs require experience as a deputy sheriff or bailiff and/or in custodial/escort or security work.",
        "Bailiffs usually require some work experience related to law enforcement as well as knowledge of relevant statutes and laws.",
        "Membership in the provincial regulatory body is mandatory in Quebec."
    ],
    "additional information": [
        "Progression to supervisory positions is possible with additional experience and in-house training."
    ],
    "exclusions": [
        {
            "name": "Correctional service officers (4422)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4422&ver=16"
        },
        {
            "name": "Court clerks (1416)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1416&ver=16"
        },
        {
            "name": "Police officers (except commissioned) (4311)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4311&ver=16"
        }
    ]
}