{
    "id": "5112",
    "name": "Conservators and curators",
    "lead statement": "Conservators restore and conserve artifacts belonging to museums, galleries and owners of cultural property. Curators recommend the acquisition of museum artifacts and gallery works of art and research their artistic history. Conservators and curators are employed in museums, art galleries and universities. Conservators may be self-employed.",
    "example titles": [
        "archaeology curator",
        "archaeology museum curator",
        "art gallery conservator",
        "art gallery curator",
        "art object curator",
        "artifact conservator",
        "assistant conservator",
        "assistant museum curator",
        "aviation and space museum curator",
        "ceramics and glass conservator",
        "conservator – art objects",
        "conservator – museum",
        "contemporary art curator",
        "contemporary art museum curator",
        "curator",
        "ethnology curator",
        "ethnology museum curator",
        "fine art and polychrome conservator",
        "fossil conservator",
        "fossil curator",
        "furniture and wooden objects conservator",
        "herbarium curator",
        "historical artifact conservator",
        "insectarium conservator",
        "insectarium curator",
        "invertebrate zoology curator",
        "invertebrate zoology museum curator",
        "library curator",
        "metals conservator",
        "museologist",
        "museum curator",
        "museum objects conservator",
        "natural history museum curator",
        "natural history specimen conservator",
        "natural sciences curator",
        "natural sciences museum curator",
        "ornithology curator",
        "ornithology museum curator",
        "paintings conservator",
        "paper conservator",
        "photograph conservator",
        "photography museum curator",
        "science and technology curator",
        "science and technology museum curator",
        "sculpture conservator",
        "textile conservator",
        "vertebrate zoology curator",
        "vertebrate zoology museum curator"
    ],
    "main duties": [
        "Examine artifacts, determine their condition, suggest methods for treating them and recommend preventive conservation techniques to their owners",
        "Restore and conserve paintings, photographs, sculptures, furniture, pottery and other museum and art gallery artifacts",
        "Provide advice on display and storage of museum and gallery artifacts to ensure proper maintenance and preservation",
        "Research new conservation and restoration techniques",
        "Provide consultation to museums, art galleries or private individuals",
        "Supervise conservation technicians and other museum technicians.",
        "Recommend the acquisition of paintings, photographs, sculptures, documents and other museum and art gallery artifacts",
        "Research origins and artistic history of artifacts",
        "Develop storylines and themes and organize displays and exhibitions",
        "Co-ordinate the storage of collections and the setting up of displays and exhibitions",
        "Oversee the conservation, display and circulation of collections",
        "Supervise curatorial assistants and other museum technicians.",
        "Conservators and curators may specialize in a particular type of collection or material, such as furniture, weapons, books, paintings and musical instruments."
    ],
    "employment requirements": [
        "Conservators require a master's degree in art conservation \r\n or completion of a three-year college program in conservation technology and several years of experience in conservation work.",
        "Curators require a master's or bachelor's degree in museology, art history or a field related to their specific area of work."
    ],
    "additional information": [
        "Progression to museum or art gallery management positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Curatorial assistants (in 5212 Technical occupations related to museums and art galleries",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5212&ver=16"
        },
        {
            "name": "Museum designers (in 5243 Theatre, fashion, exhibit and other creative designers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5243&ver=16"
        },
        {
            "name": "Museum educators (in 1123 Professional occupations in advertising, marketing and public relations",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1123&ver=16"
        },
        {
            "name": "Restaurateurs in food services (in 0631 Restaurant and food service managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0631&ver=16"
        }
    ]
}