{
    "id": "5113",
    "name": "Archivists",
    "lead statement": "Archivists manage, process, store and disseminate information contained in an organization's archives. They acquire, store and research textual material, pictures, maps, architectural documents, electronic materials, films and videos, and sound recordings and multimedia materials. Archivists are employed in archives, in the public and para-public sectors and in private sector organizations.",
    "example titles": [
        "archivist",
        "assistant archivist",
        "collections archivist",
        "corporate archivist",
        "fine arts archivist",
        "historical archivist",
        "multimedia archivist",
        "photo archivist",
        "research archivist",
        "video archivist"
    ],
    "main duties": [
        "Develop policies and procedures for managing current and semicurrent archives, in particular corporate cataloguing systems, records scheduling and disposal, and finding aids",
        "Design programs for managing, disseminating and storing archives of all types (documents, photographs, maps, audio-visual materials, manuscripts, etc.)",
        "Plan the computerized management of archives and the management of electronic archives",
        "Appraise and acquire archival materials to build and develop an archival collection for research purposes",
        "Authenticate documents and records, and research the origins and significance of archival materials",
        "Organize noncurrent archives and develop cataloguing and retrieval systems to allow access to archival materials",
        "Assist people with their searches."
    ],
    "employment requirements": [
        "A bachelor's degree with a minor in archival studies \r\n or a university degree with a certificate in archival studies is required.",
        "A master's degree in archival studies, archival studies and information science, library science or history may be required."
    ],
    "additional information": [
        "Progression to archive management positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Archive assistants (in 5211 Library and public archive technicians",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5211&ver=16"
        },
        {
            "name": "Librarians (5111)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5111&ver=16"
        },
        {
            "name": "Library, archive, museum and art gallery managers (0511)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0511&ver=16"
        },
        {
            "name": "Medical archivists (in 1252 Health information management occupations",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1252&ver=16"
        }
    ]
}