{
    "id": "5122",
    "name": "Editors",
    "lead statement": "Editors review, evaluate and edit manuscripts, articles, news reports and other material for publication, broadcast or interactive media and co-ordinate the activities of writers, journalists and other staff. They are employed by publishing firms, magazines, journals, newspapers, radio and television networks and stations, and by companies and government departments that produce publications such as newsletters, handbooks, manuals and Web sites. Editors may also work on a freelance basis.",
    "example titles": [
        "advertising editor",
        "art editor",
        "assistant editor",
        "associate editor",
        "bilingual editor",
        "blog editor",
        "book editor",
        "business editor",
        "caption editor",
        "city editor",
        "contributing editor",
        "control room editor – broadcasting",
        "copy chief",
        "copy editor",
        "copy preparer",
        "dictionary editor",
        "editor",
        "editorial consultant",
        "editorial page editor",
        "English editor",
        "feature editor",
        "financial editor",
        "financial news editor",
        "foreign news broadcasting editor",
        "foreign news service editor",
        "French editor",
        "information editor",
        "journal editor",
        "line editor",
        "line-up editor",
        "literary editor",
        "local news editor",
        "magazine editor",
        "manuscript editor",
        "medical editor",
        "news desk editor",
        "news editor",
        "news editor – broadcasting",
        "news service editor",
        "newspaper editor",
        "picture editor",
        "production editor",
        "publications editor",
        "scientific editor",
        "script editor",
        "senior editor",
        "society editor",
        "special features editor",
        "sport desk editor",
        "sports editor",
        "sub-editor",
        "technical editor",
        "telecommunications editor",
        "Web site editor",
        "writer-editor"
    ],
    "main duties": [
        "Evaluate suitability of manuscripts, articles, news copy and wire service dispatches for publication, broadcast or electronic media and recommend or make changes in content, style and organization",
        "Read and edit copy to be published or broadcast to detect and correct errors in spelling, grammar and syntax, and shorten or lengthen copy as space or time requires",
        "Confer with authors, staff writers, reporters and others regarding revisions to copy",
        "Plan and implement layout or format of copy according to space or time allocations and significance of copy",
        "Plan and co-ordinate activities of staff and assure production deadlines are met",
        "Plan coverage of upcoming events and assign work accordingly",
        "Write or prepare introductions, marketing and promotional materials, bibliographic references, indexes and other text",
        "May negotiate royalties with authors and arrange for payment of freelance staff.",
        "Editors may specialize in a particular subject area, such as news, sports or features, or in a particular type of publication, such as books, magazines, newspapers or manuals."
    ],
    "employment requirements": [
        "A bachelor's degree in English, French, journalism or a related discipline is usually required.",
        "Several years of experience in journalism, writing, publishing or a related field are usually required.",
        "Membership in the Editors Association of Canada may be required.",
        "Editors who specialize in a specific subject matter may be required to have training in that subject."
    ],
    "additional information": [
        "Progression to supervisory and management positions, such as editor-in-chief or managing editor, is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Authors and writers (5121)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5121&ver=16"
        },
        {
            "name": "Editorial assistants (in 1452 Correspondence, publication and regulatory clerks",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1452&ver=16"
        },
        {
            "name": "Film editors (in 5131 Producers, directors, choreographers and related occupations",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5131&ver=16"
        },
        {
            "name": "Journalists (5123)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5123&ver=16"
        },
        {
            "name": "Managing editors (in 0512 Managers - publishing, motion pictures, broadcasting and performing arts",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0512&ver=16"
        },
        {
            "name": "Map editors (in 2255 Technical occupations in geomatics and meteorology",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2255&ver=16"
        },
        {
            "name": "Sound editors (in 5225 Audio and video recording technicians",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5225&ver=16"
        },
        {
            "name": "Translators-revisers (in 5125 Translators, terminologists and interpreters",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5125&ver=16"
        }
    ]
}