{
    "id": "5221",
    "name": "Photographers",
    "lead statement": "Photographers operate still cameras to photograph people, events, scenes, materials, products and other subjects. Photographers are employed by photographic studios, newspapers, magazines, museums and government, or they may be self-employed.",
    "example titles": [
        "aerial photographer",
        "chief photographer",
        "commercial photographer",
        "evidence photographer – forensic",
        "fashion photographer",
        "finish photographer",
        "forensic photographer",
        "industrial photographer",
        "medical photographer",
        "multimedia photographer",
        "multimedia picture illustrator",
        "news photographer",
        "photographer",
        "photography supervisor",
        "photojournalist",
        "photomicrographer",
        "police photographer",
        "portrait photographer",
        "racetrack finish photographer",
        "retoucher – photography",
        "scientific photographer",
        "still photographer",
        "street photographer",
        "wildlife photographer"
    ],
    "main duties": [
        "Study requirements of a particular assignment and decide on type of camera, film, lighting and background accessories to be used",
        "Determine picture composition, make technical adjustments to equipment and photograph subject",
        "May operate scanners to transfer photographic images to computers",
        "May operate computers to manipulate photographic images",
        "May adapt existing photographic images and create new digitized images to be included in multimedia/new media products",
        "May use delicate instruments, such as optical microscopes attached to cameras",
        "May process exposed film",
        "May use airbrush, computer or other techniques to retouch negatives",
        "Medical photographers may work closely with medical illustrators.",
        "Photographers may specialize in areas such as portrait photography, commercial photography, scientific photography, forensic photography, medical photography, digitized photography, multimedia photography or photojournalism."
    ],
    "employment requirements": [
        "A bachelor's degree in visual arts with specialization in photography \r\n or completion of specialized training in photography in high school, college or specialized training schools \r\n or extensive on-the-job training under the supervision of a photographer is required.",
        "Experience in, or knowledge of computerized photography or digital imaging may be required.",
        "Creative and technical ability, as demonstrated by a portfolio of work, are required."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Film and video camera operators (5222)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5222&ver=16"
        }
    ]
}