{
    "id": "5242",
    "name": "Interior designers and interior decorators",
    "lead statement": "Interior designers and interior decorators conceptualize and produce aesthetic, functional and safe designs for interior spaces in residential, commercial, cultural, institutional and industrial buildings. They are employed by architectural and interior design firms, retail establishments, construction companies, hospitals, airlines, hotel and restaurant chains, and other establishments, or they may be self-employed.",
    "example titles": [
        "aircraft interior designer",
        "building space planner",
        "business aircraft interior designer",
        "certified interior designer",
        "colour consultant – home decorating",
        "decorating consultant",
        "designer – interior design",
        "green design consultant – interior design",
        "home decorating consultant",
        "home decorator",
        "home organizer",
        "home stager",
        "home staging consultant",
        "interior decorating consultant",
        "interior decorator",
        "interior design consultant",
        "interior design project manager",
        "interior design technician",
        "interior designer",
        "interior designer assistant",
        "interior space designer",
        "kitchen designer",
        "licensed interior designer",
        "office space planner",
        "registered interior designer",
        "retail space planner",
        "space management consultant"
    ],
    "main duties": [
        "Consult with clients to determine needs, preferences, safety requirements  and purpose of space",
        "Develop detailed plans and 3-D models showing arrangement of walls, dividers, displays, lighting and other fixtures using computer-assisted design (CAD) software and graphics software",
        "Develop plans, elevations, cross sections and detailed drawings, and advise on selection of colours, finishes and materials, floor and wall coverings, window treatments, interior and exterior lighting, furniture and other items, taking into account ergonomic and occupational health standards",
        "Estimate costs and materials required and may advise on leasing, real estate and marketing",
        "Prepare plans and specifications for the final interior designs in accordance with current practices and codes",
        "Work in a multidisciplinary environment",
        "May direct site work crews and subcontractors.",
        "Interior designers are experts in the area of interior architecture, construction materials and building codes. They may specialize in designing interiors for residential, commercial, institutional, cultural and industrial buildings and for aircraft, ships or trains, trade shows and exhibitions. \r\n\r\nInterior decorators may specialize in decorating residential or commercial interior spaces, home staging, colour consulting and home organizing."
    ],
    "employment requirements": [
        "A university degree or college diploma in interior design is usually required.",
        "The National Council for Interior Design Qualification (NCIDQ) examination may be required after six years of combined study and experience.",
        "Certification by a provincial institute or association is required to use protected titles related to interior designers in all provinces except Prince Edward Island.",
        "A college certificate or diploma in interior decoration is usually required.",
        "Membership in the Canadian Decorators' Association is available to qualified decorators."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Graphic designers and illustrators (5241)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5241&ver=16"
        },
        {
            "name": "Industrial designers (2252)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2252&ver=16"
        },
        {
            "name": "Lighting designers (in 5243 Theatre, fashion, exhibit and other creative designers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5243&ver=16"
        },
        {
            "name": "Painters and decorators (except interior decorators) (7294)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7294&ver=16"
        },
        {
            "name": "Theatre, fashion, exhibit and other creative designers (5243)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5243&ver=16"
        }
    ]
}