{
    "id": "6741",
    "name": "Dry cleaning, laundry and related occupations",
    "lead statement": "Dry cleaning and laundry machine operators operate machines to dry-clean or launder garments and other articles. Dry cleaning and laundry inspectors and assemblers check finished garments and other articles to ensure that they meet required standards for dry-cleaning, laundering and pressing, and assemble and bag finished garments and other articles. This unit group also includes workers who iron, press or otherwise finish garments and household articles. Workers in this unit group are employed in dry cleaning, laundry and fur cleaning establishments, and in the laundries of hotels, hospitals and other institutions.",
    "example titles": [
        "apprentice dry cleaner",
        "assembler – laundry and dry cleaning",
        "bagger – laundry and dry cleaning",
        "blocker – laundry and dry cleaning",
        "checker – laundry and dry cleaning",
        "cleaner – laundry and dry cleaning",
        "cleaner and presser – laundry and dry cleaning",
        "cleaning machine operator – laundry and dry cleaning",
        "clothes presser – laundry and dry cleaning",
        "clothing ironer – laundry and dry cleaning",
        "curtain and drapery presser – laundry and dry cleaning",
        "drapery cleaner",
        "drapery cleaner – laundry and dry cleaning",
        "dry cleaner",
        "dry cleaner helper",
        "dry cleaning machine operator – laundry and dry cleaning",
        "dry cleaning machine operator helper",
        "dyer – laundry and dry cleaning",
        "extractor operator – laundry and dry cleaning",
        "feather renovator",
        "finisher – laundry and dry cleaning",
        "flatwork finisher – laundry and dry cleaning",
        "flatwork folder – laundry and dry cleaning",
        "flatwork ironer – laundry and dry cleaning",
        "fluting machine operator – laundry and dry cleaning",
        "folder – laundry and dry cleaning",
        "folding machine tender – laundry and dry cleaning",
        "framer – laundry and dry cleaning",
        "fur cleaner – laundry and dry cleaning",
        "fur glazer – laundry and dry cleaning",
        "fur ironer – laundry and dry cleaning",
        "fur ironer glazer – laundry and dry cleaning",
        "fur ironing machine operator – laundry and dry cleaning",
        "fur lining presser – laundry and dry cleaning",
        "fur lusterizer – laundry and dry cleaning",
        "fur steamer",
        "fur-drummer machine operator – laundry and dry cleaning",
        "garment cleaner – laundry and dry cleaning",
        "garment dyer – laundry and dry cleaning",
        "hand finisher – laundry and dry cleaning",
        "hand fur cleaner",
        "hand ironer – laundry and dry cleaning",
        "hand presser – laundry and dry cleaning",
        "hand washer – laundry and dry cleaning",
        "hat cleaner",
        "inspector – laundry and dry cleaning",
        "ironer – laundry and dry cleaning",
        "launderer",
        "laundry attendant",
        "laundry finisher",
        "laundry helper",
        "laundry labourer",
        "laundry machine operator",
        "laundry worker",
        "leather cleaner – laundry and dry cleaning",
        "leather finisher – dry cleaning",
        "leather or suede sprayer – laundry and dry cleaning",
        "machine fur cleaner",
        "machine operator – laundry and dry cleaning",
        "machine presser – laundry and dry cleaning",
        "machine washer – laundry and dry cleaning",
        "marker – laundry and dry cleaning",
        "packager – laundry and dry cleaning",
        "patcher – laundry and dry cleaning",
        "patching machine operator – laundry and dry cleaning",
        "pleat finisher – laundry and dry cleaning",
        "pleat presser – laundry and dry cleaning",
        "presser – laundry and dry cleaning",
        "pressing machine tender – laundry and dry cleaning",
        "shirt finisher – laundry and dry cleaning",
        "shirt folder – laundry and dry cleaning",
        "shirt presser – laundry and dry cleaning",
        "shirt-folding machine operator – laundry and dry cleaning",
        "silk finisher – laundry and dry cleaning",
        "spotter – laundry and dry cleaning",
        "stain remover",
        "steam finisher – laundry and dry cleaning",
        "steam press operator – laundry and dry cleaning",
        "steam presser – laundry and dry cleaning",
        "steam tunnel operator – laundry and dry cleaning",
        "stretcher dryer – laundry and dry cleaning",
        "suede cleaner – laundry and dry cleaning",
        "tagger – laundry and dry cleaning",
        "tumble dryer tender – laundry and dry cleaning",
        "velvet steamer – laundry and dry cleaning",
        "washing machine extractor operator – laundry and dry cleaning",
        "washing machine extractor tender – laundry and dry cleaning",
        "washing machine operator – laundry and dry cleaning",
        "wrapper – laundry and dry cleaning"
    ],
    "main duties": [
        "Operate dry cleaning machines to dry-clean dresses, suits, coats, sweaters and other garments, draperies, cushion covers and other articles",
        "Sort garments and operate washing machines and dryers to clean and dry clothing, sheets, blankets, towels and other articles",
        "Operate machines to clean and blow-dry fur garments",
        "Operate machines to dry-clean, dye, spray, re-oil, and re-buff suede and leather garments",
        "Mix and add detergents, dyes, bleaches, starches and other solutions and chemicals.",
        "Check finished garments and other articles to ensure that they are properly dry-cleaned or laundered",
        "Record damaged or improperly dry-cleaned or laundered garments and other articles",
        "Use hand-held steam iron to touch up finished garments and other articles",
        "Assemble and bag finished garments and other articles",
        "Match invoices with tags on garments or other articles.",
        "Operate finishing equipment such as steam pressers, and use hand irons to finish pants, jackets, shirts, skirts and other dry cleaned and laundered articles",
        "Hand iron laundered fine linens or dry-cleaned silk garments",
        "Operate fur ironing and glazing equipment to finish fur garments and other fur articles",
        "Fold and bag dry cleaned and laundered articles",
        "May operate laundering equipment. ",
        "Workers in this group may specialize in finishing suede, leather, fur and delicate articles."
    ],
    "employment requirements": [
        "Some secondary school education is required.",
        "Four to eight weeks of on-the-job training are usually provided.",
        "Dry cleaning and laundry machine operators may require experience as inspectors or assemblers.",
        "Suede, leather and fur cleaners may require experience as dry cleaning or laundry machine operators."
    ],
    "additional information": [
        "Progression to supervisory dry cleaning and laundry occupations is possible with additional training and experience."
    ],
    "exclusions": [
        {
            "name": "Alterationists (in 6342 Tailors, dressmakers, furriers and milliners",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6342&ver=16"
        },
        {
            "name": "Dry cleaning and laundry services supervisors (in 6316 Other services supervisors",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6316&ver=16"
        },
        {
            "name": "Dry cleaning service managers (in 0651 Managers in customer and personal services, n.e.c.",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0651&ver=16"
        }
    ]
}