{
    "id": "7232",
    "name": "Tool and die makers",
    "lead statement": "Tool and die makers make, repair and modify custom-made, prototype or special tools, dies, jigs, fixtures and gauges using various metals, alloys and plastics which require precise dimensions. They are employed primarily in manufacturing industries such as automobile, aircraft, metal fabrication, electrical machinery and plastics, and in tool and die, mould making and machine shops. This unit group also includes metal patternmakers and metal mould makers.",
    "example titles": [
        "aircraft jig and template maker",
        "aircraft jig and tool maker",
        "apprentice tool and die maker",
        "bench die cutter",
        "bench die fitter",
        "bench die sinker",
        "bench jig maker",
        "bench stamping die maker",
        "bench tool maker",
        "carbide tool maker",
        "diamond saw maker",
        "diamond tool maker",
        "die cutter",
        "die cutter – metalworking",
        "die finisher",
        "die fitter",
        "die maker",
        "die maker – jewellery",
        "die mouldmaker",
        "die reamer",
        "die repairer",
        "die repairman/woman",
        "die sinker",
        "die sinker – metalworking",
        "diecast diemaker",
        "extrusion die template maker",
        "forging die finisher",
        "forging die maker",
        "gauge maker – tool and die",
        "injection moulding tool and die maker",
        "injection mouldmaker",
        "jewellery die cutter",
        "jewellery die sinker",
        "jig and form maker",
        "jig maker",
        "jig maker – die casting and plastic moulding",
        "jig maker – metal products manufacturing",
        "jig-bore tool maker",
        "journeyman/woman tool and die maker",
        "metal mould finisher",
        "metal mould maker",
        "metal mouldmaker",
        "metal patternmaker",
        "metal patternmaker apprentice",
        "model maker – tool and die",
        "motor vehicle jig builder",
        "mould maker – plastics processing",
        "mould maker apprentice",
        "mouldmaker – aircraft",
        "precision tool maker",
        "progressive die fitter",
        "stamping die finisher",
        "steel-rule die maker",
        "template maker – tool and die",
        "tire mould repairer",
        "tool and die maker",
        "tool and die maker apprentice",
        "tool and die preparer",
        "tool and die repairer",
        "tool fitter",
        "tool maintainer",
        "tool maintenance man/woman",
        "tool repairer",
        "tool repairman/woman",
        "toolmaker",
        "wire-drawing die maker"
    ],
    "main duties": [
        "Read and interpret engineering drawings and specifications of tools, dies, prototypes or models",
        "Prepare templates and sketches, and determine work processes",
        "Compute dimensions and tolerances and set up machine tools",
        "Position, secure, measure and work metal stock or castings to lay out for machining",
        "Set up, operate and maintain a variety of conventional and computer numerically controlled (CNC) machine tools to cut, turn, mill, plane, drill, bore, grind or otherwise shape workpiece to prescribed dimensions and finish",
        "Verify machined parts for conformance to specifications using precision measuring instruments such as verniers, callipers, micrometers, co-ordinate measuring machines (CMM) and electronic measuring devices",
        "Fit and assemble or disassemble parts using hand tools",
        "Test completed tools, dies, jigs or fixtures for proper operation",
        "May program CNC machine tools.",
        "Machine, fit and assemble castings and other parts to make precision models of required shape such as metal patterns, core boxes and match plates",
        "Lay out, shape and assemble patterns of metal, wood, plastic and other materials from blueprints, models or templates",
        "May program CNC machine tools.",
        "Machine, fit and assemble parts to make metal moulds and cores for plastic injection moulding, or other production processes",
        "May program CNC machine tools."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a four- or five-year tool and die making apprenticeship program \r\n or a combination of over five years of work experience in the trade and some high school, college or industry courses in tool and die making is usually required to be eligible for tool and die trade certification.",
        "Tool and die maker trade certification is available, but voluntary, in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Quebec, Ontario, Manitoba and British Columbia.",
        "Red Seal endorsement is also available to qualified tool and die makers upon successful completion of the interprovincial Red Seal examination.",
        "Mould makers usually require completion of a four-year apprenticeship or college program in mould making.",
        "Trade certification for mould makers is available, but voluntary, in Quebec and Ontario.",
        "Patternmakers usually require completion of an apprenticeship or college program in patternmaking.",
        "Patternmaking trade certification is available, but voluntary, in Ontario."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Machining tool operators (9417)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9417&ver=16"
        },
        {
            "name": "Machinists and machining and tooling inspectors (7231)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7231&ver=16"
        },
        {
            "name": "Manual and machine mould makers and core makers (in 9412 Foundry workers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9412&ver=16"
        },
        {
            "name": "Supervisors of tool and die makers, metal mould makers and patternmakers (in 7201 Contractors and supervisors, machining, metal forming, shaping and erecting trades and related occupations",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7201&ver=16"
        }
    ]
}