{
    "id": "7321",
    "name": "Automotive service technicians, truck and bus mechanics and mechanical repairers",
    "lead statement": "Automotive service technicians, truck and bus mechanics and mechanical repairers inspect, diagnose, repair and service mechanical, electrical and electronic systems and components of cars, buses, and light and commercial transport trucks. They are employed by motor vehicle dealers, garages, truck and trailer dealerships, fleet maintenance companies, and service stations, automotive specialty shops, transportation companies and retail establishments which have automotive service shops. This unit group also includes mechanical repairers who perform major repairs and replacement of mechanical units on newly assembled motor vehicles. They are employed by motor vehicle manufacturing companies.",
    "example titles": [
        "after sales service technician – motor vehicles",
        "alignment and brakes technician",
        "apprentice motor vehicle mechanic",
        "automatic transmission mechanic – motor vehicle",
        "automatic transmission technician – motor vehicles",
        "automobile mechanic",
        "automobile service mechanic",
        "automotive air conditioning mechanic",
        "automotive brake mechanic",
        "automotive brake repairer",
        "automotive brake specialist",
        "automotive carburetor mechanic",
        "automotive drive trains technician",
        "automotive electrical and tune-up service technician",
        "automotive electrical mechanic",
        "automotive electrical technician",
        "automotive engine mechanic inspector",
        "automotive mechanic",
        "automotive mechanical repairer",
        "automotive radiator mechanic",
        "automotive radiator mechanic apprentice",
        "automotive radiator repairer",
        "automotive repairer",
        "automotive service technician",
        "automotive service technician – electrical and fuel systems",
        "automotive service technician – fuel and electronics systems",
        "automotive service technician – steering, suspension and brakes",
        "automotive service technician – transmission",
        "automotive service technician apprentice",
        "automotive technician – air conditioning system",
        "automotive technician – automatic transmission systems",
        "automotive technician – brakes systems",
        "automotive technician – electrical and electronic systems",
        "automotive technician – engine and fuel systems",
        "automotive technician – front-end systems",
        "automotive technician – fuel systems",
        "automotive technician – standard transmission systems",
        "automotive technician – transmission systems",
        "automotive vehicle tester",
        "automotive vehicle testing mechanic",
        "brake systems mechanic",
        "bus and transport mechanic",
        "bus and truck mechanic",
        "bus mechanic",
        "car mechanic",
        "commercial trailer mechanic",
        "commercial trailer technician",
        "commercial transport vehicle mechanic",
        "diagnostic technician – motor vehicles",
        "engine mechanic – motor vehicle",
        "front-end mechanic",
        "fuel and electrical systems technician – motor vehicle",
        "garage mechanic",
        "mechanic – motor vehicle manufacturing",
        "mechanical upgrader – motor vehicle manufacturing",
        "motor mechanic – motor vehicle manufacturing",
        "motor repairer – motor vehicle manufacturing",
        "motor vehicle diesel engine mechanic",
        "motor vehicle fuel conversion technician",
        "motor vehicle fuel-systems and electric-systems mechanic",
        "motor vehicle mechanic",
        "motor vehicle mechanical repairer",
        "motor vehicle technician",
        "motor vehicle transmission mechanic",
        "new car mechanic",
        "service technician – motor vehicle repair",
        "trailer mechanic",
        "trailer mechanical systems repairer",
        "transmission mechanic",
        "transmission technician",
        "transport truck mechanic",
        "transport truck trailer mechanic",
        "trolley engine mechanic",
        "truck and coach technician",
        "truck and trailer repairer",
        "truck and transport mechanic",
        "truck and transport service technician",
        "truck and transport vehicle mechanic apprentice",
        "truck and transport vehicle repairer",
        "truck mechanic",
        "truck trailer mechanic",
        "truck trailer repairer apprentice",
        "truck trailer service technician",
        "truck-trailer repairer",
        "tune-up mechanic – motor vehicle",
        "tune-up specialist – motor vehicle",
        "wheel alignment and brake mechanic",
        "wheel alignment and brake specialist"
    ],
    "main duties": [
        "Review work orders and discuss work with supervisor",
        "Inspect motor in operation, road test motor vehicle, and test automotive systems and components using computerized diagnostic and other testing devices to diagnose and isolate faults",
        "Adjust, repair or replace parts and components of automotive systems including fuel system, brakes, steering and suspension, engine and drive train, emission control and exhaust, cooling and climate control, and electrical and electronic systems using hand tools and other specialized automotive repair equipment",
        "Test and adjust repaired systems to manufacturer's performance specifications",
        "Perform scheduled maintenance service, such as oil changes, lubrications and tune ups",
        "Advise customers on work performed, general vehicle condition and future repair requirements.",
        "Inspect and test mechanical units, such as engines, transmissions, axles and brake systems, to locate faults and malfunctions",
        "Diagnose faults or malfunctions and confirm findings with supervisor to determine whether to repair or replace unit",
        "Repair or replace mechanical units or components using hand and power tools",
        "Test and adjust units to specifications for proper performance",
        "Complete reports to record problems and work performed.",
        "Adjust, repair or replace parts and components of commercial transport truck systems including chassis, frame, cab, body, engine and drive train, air brakes, steering, and fuel, hydraulic, electrical and electronic systems",
        "Adjust, repair or replace parts and components of truck-trailer systems including structural, brake and electrical systems.",
        "Workers in this unit group may specialize in the following areas: engine and fuel systems, transmission systems, air conditioning, cooling and heating systems, steering, alignment, brakes, drive lines, suspension, electrical and electronic systems, truck-trailer repair or diagnostic services."
    ],
    "employment requirements": [
        "Completion of secondary school and training courses or a vocational program are usually required.",
        "Completion of a four-year automotive service technician apprenticeship program \r\n or a combination of over four years of work experience and industry courses in automotive technology is required to be eligible for trade certification.",
        "Trade certification for automotive service technicians is compulsory in Nova Scotia, Prince Edward Island, New Brunswick, Ontario and Alberta and available, but voluntary, in Newfoundland and Labrador, Quebec, Manitoba, Saskatchewan, British Columbia, the Yukon, the Northwest Territories and Nunavut.",
        "Automotive service technician (transmission) trade certification is compulsory in Ontario.",
        "Automotive service technician (steering, suspension and brakes) trade certification is compulsory in New Brunswick and Ontario.",
        "Automotive service technician (service station mechanic) trade certification is compulsory in Nova Scotia and available, but voluntary, in Prince Edward Island.",
        "Red Seal endorsement is also available to qualified automotive service technicians upon successful completion of the interprovincial Red Seal examination.",
        "Completion of secondary school and training courses or a vocational program are usually required.",
        "On-the-job training of two to three years is provided by employers.",
        "Completion of secondary school and training courses or a vocational program are usually required.",
        "Completion of a four-year truck and transport mechanic or truck-trailer repair apprenticeship \r\n or a combination of over four years of work experience and industry courses in truck or heavy duty equipment mechanics is required to be eligible for trade certification.",
        "Trade certification for truck and transport mechanics is compulsory in Nova Scotia, Ontario and Alberta and available, but voluntary, in Newfoundland and Labrador, Prince Edward Island, New Brunswick, Quebec, Manitoba, Saskatchewan, British Columbia and the Yukon.",
        "Transport trailer technician trade certification is compulsory in Ontario and available, but voluntary, in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Manitoba, British Columbia and the Yukon.",
        "Red Seal endorsement is also available to qualified truck-trailer repairers and truck and transport mechanics upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "With additional training, mobility is possible between automobile and truck and transport mechanics.",
        "The Red Seal endorsement allows for interprovincial mobility.",
        "With experience, mechanics and technicians in this unit group may progress to supervisory positions.",
        "Mechanical repairers employed in motor vehicle manufacturing may progress to motor vehicle mechanic positions through an apprenticeship program, or with experience, they may progress to supervisory positions in motor vehicle manufacturing."
    ],
    "exclusions": [
        {
            "name": "Heavy-duty equipment mechanics (7312)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7312&ver=16"
        },
        {
            "name": "Motor vehicle assemblers, inspectors and testers (9522)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9522&ver=16"
        },
        {
            "name": "Motor vehicle body repairers (7322)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7322&ver=16"
        },
        {
            "name": "Recreation vehicle service technicians (in 7384 Other trades and related occupations, n.e.c.",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7384&ver=16"
        },
        {
            "name": "Supervisors, motor vehicle assembling (9221)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9221&ver=16"
        },
        {
            "name": "Supervisors of motor vehicle mechanics (in 7301 Contractors and supervisors, mechanic trades",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7301&ver=16"
        },
        {
            "name": "Transport truck and trailer assemblers (in 9526 Mechanical assemblers and inspectors",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9526&ver=16"
        }
    ]
}