{
    "id": "7331",
    "name": "Oil and solid fuel heating mechanics",
    "lead statement": "Oil and solid fuel heating mechanics install and maintain oil, coal and wood heating systems in residential and commercial buildings. They are employed by heating systems installation and service companies.",
    "example titles": [
        "coal furnace installer",
        "coal furnace installer-mechanic",
        "forced air furnace installer (except gas)",
        "furnace installer and repairer (except gas)",
        "furnace maintenance mechanic (except gas)",
        "furnace mechanic (except gas)",
        "furnace repairer (except gas)",
        "furnace repairman/woman (except gas)",
        "heating mechanic",
        "heating service mechanic",
        "heating system mechanic",
        "heating systems installer",
        "heating systems servicer",
        "heating systems technician",
        "heating technician",
        "oil and solid fuel heating mechanic",
        "oil burner apprentice",
        "oil burner installer",
        "oil burner installer and repairer",
        "oil burner maintainer",
        "oil burner mechanic",
        "oil burner mechanic apprentice",
        "oil burner repairer",
        "oil burner servicer",
        "oil burner technician",
        "oil furnace installer",
        "residential oil burner installer and servicer",
        "residential oil burner mechanic",
        "solid fuel heater installer",
        "solid fuel heating installer",
        "stoker erector",
        "wood burner installer",
        "wood burner maintainer",
        "wood furnace installer",
        "wood-burning appliance installer",
        "wood-burning system installer"
    ],
    "main duties": [
        "Read and interpret drawings or specifications to determine work to be performed",
        "Lay out oil burner heating system components and assemble components using hand and power tools",
        "Install oil burner components such as thermostats, motors, piping and safety devices, and connect to fuel supply, ventilation and electrical system",
        "Test installed unit and adjust controls for proper functioning",
        "Troubleshoot and repair malfunctioning oil burners, and their components and controls",
        "Install, maintain and repair coal and wood heating systems",
        "Perform scheduled maintenance service on oil and solid fuel heating systems."
    ],
    "employment requirements": [
        "Completion of secondary school and training courses or a vocational program is usually required.",
        "Completion of a three- to four-year apprenticeship program \r\n or a combination of over four years of work experience and industry courses in heating systems installation and repair is usually required for trade certification.",
        "Oil heat system technician trade certification is compulsory in Nova Scotia and New Brunswick and is available, but voluntary, in Newfoundland and Labrador, Prince Edward Island, British Columbia, the Yukon, the Northwest Territories and Nunavut.",
        "Red Seal endorsement is also available to qualified oil heat system technicians upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Gas fitters (7253)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7253&ver=16"
        },
        {
            "name": "Heating, refrigeration and air conditioning mechanics (7313)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7313&ver=16"
        },
        {
            "name": "Supervisors of oil and solid fuel heating mechanics (in 7301 Contractors and supervisors, mechanic trades",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7301&ver=16"
        }
    ]
}