{
    "id": "7333",
    "name": "Electrical mechanics",
    "lead statement": "Electrical mechanics maintain, test, rebuild and repair electric motors, transformers, switchgear and other electrical apparatus. They are employed by independent electrical repair shops, service shops of electrical equipment manufacturers and maintenance departments of manufacturing companies.",
    "example titles": [
        "armature repairman/woman",
        "armature winder repairer",
        "automotive-generator and starter repairer",
        "circuit breaker mechanic",
        "coil connector repairer",
        "coil winder and repairer",
        "electric meter repairer",
        "electric meter repairer apprentice",
        "electric meter technician",
        "electric motor mechanic",
        "electric motor repairer",
        "electric motor repairer and tester",
        "electric motor repairer-tester",
        "electric motor repairman/woman",
        "electric motor systems technician",
        "electric motor winder",
        "electric motor winder-repairer",
        "electrical apparatus mechanic",
        "electrical equipment mechanic trainee",
        "electrical instrument mechanic",
        "electrical instrument repairer",
        "electrical mechanic",
        "electrical mechanic – electrical utilities",
        "electrical mechanic (except avionics)",
        "electrical mechanic apprentice",
        "electrical mechanic trainee",
        "electrical mechanics group leader",
        "electrical mechanics lead hand",
        "electrical motor coil winder-repairer",
        "electrical rewind mechanic",
        "electrical transformer repairer",
        "generator repairer",
        "generator repairman/woman",
        "high-voltage power transformer repairer",
        "industrial coil winder-repairer",
        "industrial motor winder-repairer",
        "meter repair electrical mechanic",
        "motor coil winder-repairer",
        "power transformer repairer",
        "power transformer repairman/woman",
        "storage battery repairer",
        "switchgear repair electrical mechanic",
        "transformer coil repairer",
        "transformer repairer",
        "transformer repairman/woman",
        "winder-electrician"
    ],
    "main duties": [
        "Test and observe electrical, electronic and mechanical components and systems using testing and measuring instruments",
        "Troubleshoot and repair electric motors, transformers, switchgear, generators and other electro-mechanical equipment",
        "Replace or recondition shafts, bearings, commutators and other components",
        "Wind, assemble and install various types of coils for electric motors or transformers",
        "Perform static or dynamic balancing of armatures or rotors by welding, brazing or soldering electrical connections and by aligning and adjusting parts",
        "Test and repair or replace faulty wiring or components in electrical switchgear",
        "Test repaired motors, transformers, switchgear or other electrical apparatus to ensure proper performance",
        "Perform some machining to recondition or modify shafts, commutators or other parts",
        "Perform on-site servicing and repair.",
        "Electrical mechanics may specialize in working with certain types of apparatus, such as electric motors or transformers, or in performing certain functions, such as winding coils."
    ],
    "employment requirements": [
        "Completion of secondary school and training courses or a vocational program is usually required.",
        "Completion of a four-year apprenticeship program \r\n or a combination of over four years of work experience and industry courses in electrical mechanics is usually required for trade certification.",
        "Trade certification as an electric motor system technician is available, but voluntary, in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Ontario, Manitoba, Alberta, British Columbia, the Yukon and Nunavut.",
        "Electrical motor and equipment repairer – winding trade certification is available, but voluntary, in Quebec.",
        "Electrical motor system technician (electrical utility) trade certification is available, but voluntary, in New Brunswick.",
        "Red Seal endorsement is also available to qualified electric motor system technicians upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Although specialization may occur, workers in this unit group are required to be proficient in repairing all electrical apparatus.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Aircraft electrical mechanics (in 2244 Aircraft instrument, electrical and avionics mechanics, technicians and inspectors",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2244&ver=16"
        },
        {
            "name": "Assemblers, fabricators and inspectors, industrial electrical motors and transformers (9525)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9525&ver=16"
        },
        {
            "name": "Industrial electricians (7242)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7242&ver=16"
        },
        {
            "name": "Supervisors of electrical mechanics (in 7301 Contractors and supervisors, mechanic trades",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7301&ver=16"
        }
    ]
}