{
    "id": "7444",
    "name": "Pest controllers and fumigators",
    "lead statement": "Pest controllers and fumigators inspect buildings and outside areas for pest infestation and spray chemical treatments to kill noxious and destructive insects, rodents and other pests or set cage traps to capture and remove animals. They are employed by pest control companies, or they may be self-employed.",
    "example titles": [
        "animal control trapper",
        "exterminator",
        "fumigator",
        "nuisance control trapper",
        "pest control operator",
        "pest control representative",
        "pest control service representative",
        "pest control technician",
        "pest control trapper",
        "pest controller",
        "pest extermination representative",
        "pest exterminator",
        "pest fumigator"
    ],
    "main duties": [
        "Inspect buildings and outside areas at regular intervals or at specific request of property owner to detect signs of infestation",
        "Determine type of treatment required and provide estimate of costs to clients",
        "Prepare and spray chemical mixture on infested areas using mechanical or electric sprayer to kill insects, rodents and other pests",
        "Fumigate households",
        "Place and set traps to capture and remove animals, such as skunks or raccoons",
        "Install animal control barriers such as needle strips, netting and other devices to keep animals off property",
        "Clean out areas that harbour pests using rakes, shovels, brooms or mops",
        "Advise clients on how to prevent pest infestation."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of courses in pest control or extermination or several months of on-the-job training are usually required.",
        "Provincial pesticide applicator licence is required in all provinces."
    ],
    "additional information": [
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Supervisors of pest controllers and fumigators (in 7205 Contractors and supervisors, other construction trades, installers, repairers and servicers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7205&ver=16"
        }
    ]
}