[{"title": "Aquatic Science Technician III"}, {"subtitle": "Important messages", "body": ["We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process.", " If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation.", " All information received in relation to accommodation will be kept confidential.", "Assessment accommodation."]}, {"subtitle": "Duties", "body": ["The successful candidate will be part of the Invertebrates and Species at Risk Section and contribute to research to support Science advice related to the management of our ocean resources.", " The work is in a laboratory environment and entails processing vertebrates and/or invertebrates to collect important biological information.", " The candidate will use and maintain various types of equipment such as a dissecting scope for various tasks and be responsible for collecting data that will be made accessible to researchers.", " If the opportunity presents itself, the candidate could participate in an Ecosystem Research Survey to collect morphometric and biological data on a variety of marine species."]}, {"subtitle": "Work environment", "body": ["DFO Maritimes Science Sector is comprised of staff that conducts research, modelling, and monitoring to enhance our understanding of aquatic ecosystems and provides advice to support the management of all the Canadian fisheries and other aquatic activities of our Maritimes region.", " The Maritimes Science Program has 5 priority areas: populations and ecosystem assessments; safe navigation and emergency response; mitigation of ecosystem stressors; adaptation to a changing environment; and marine spatial planning.", " Maritimes Science Branch consists of over 400 staff working from multiple locations in Nova Scotia and New Brunswick.", " This position is located at the Bedford Institute of Oceanography (BIO).", "BIO is a modern oceanographic research facility, established in 1962 by the Federal Government of Canada and is located on the shores of the Bedford Basin in Dartmouth, Nova Scotia.", " Over the last 50 years it has grown to become Canada's largest centre for ocean research.", " The Institute performs targeted research, mandated by the Canadian government, to provide peer-reviewed advice and support to government decision making on a broad range of ocean issues, including sovereignty, safety and security, environmental protection, the health of the oceans, safe and accessible waterways, the sustainable use of natural resources (fisheries, minerals, oil & gas) and the integrated management large ocean management areas."]}, {"subtitle": "Intent of the process", "body": ["The intent of this selection process is to create a pool of partially assessed or fully assessed candidates which will be used to staff various EG-03, Aquatic Science Technician III positions with Fisheries and Oceans Canada, Maritimes Region (Stream 1 & 2).", " There is an immediate need for a six (6) month term in Dartmouth, Nova Scotia to join the Fish Diet Project team (Stream 1)."]}, {"subtitle": "In order to be considered, your application must clearly explain how you meet the following (essential qualifications)", "body": ["A secondary school diploma or employer approved alternative.", "Degree equivalency.", "BOTH STREAMS:.", "Experience with hands-on biological work in a lab AND collection of biological data.", "Experience in one of the following: inputting, maintaining, OR summarizing data using MSOffice programs."]}, {"subtitle": "", "body": ["The following will be applied / assessed at a later date (essential for the job).", "English essential.", "Information on language requirements.", "STREAM 1:.", "Experience identifying marine vertebrate and invertebrates using taxonomic keys.", "STREAM 2:.", "Experience in processing marine invertebrates for the purposes of ageing AND/OR interpreting age from ageing structures.", "BOTH STREAMS:.", "Ability to accurately input data, perform simple analysis, and interpret results using a computer.", "Ability to communicate effectively orally and in writing.", "Ability to maintain sustained focus with attention to detail.", "Knowledge of safe working procedures for the conduct of laboratory work.", "Demonstrating integrity and respect.", "Thinking things through.", "Working effectively with others.", "Showing initiative and being action-oriented."]}, {"subtitle": "The following may be applied / assessed at a later date (may be needed for the job)", "body": ["Graduation with a degree from a recognized university in a natural, physical or applied science with specialization in a field relevant to the duties of the position or technical diploma in a field relevant to the duties of the position.", "Degree equivalency.", "Experience using, maintaining, and troubleshooting specialized aquatic science field or laboratory equipment.", "Experience working with live aquatic organisms in the laboratory or in the field.", "Experience conducting scientific work in the field.", "Experience with scientific programming software.", "Experience In the use of a dissecting scope and taking photos with a digital camera attachment.", "Operational Requirements:.", "Valid Driver's licence or mobility to the extent of the possession of a driver's licence.", "Willingness to work overtime when required.", "Willingness to travel."]}, {"subtitle": "Conditions of employment", "body": ["Reliability Status security clearance.", "For some positions:.", "Valid Driver's licence or mobility to the extent of the possession of a driver's licence.", "A valid Health Canada medical (Scientific Field Personnel)."]}, {"subtitle": "Other information", "body": ["The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve.", " We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply.", "Information on employment equity.", "****************************************************.", "ASSESSMENT.", "****************************************************.", "Candidates must meet all of the essential qualifications prior to being appointed to a position.", "You will be asked to provide proof (original documentation will be required) of your education credentials.", " If you were educated outside of Canada, you must have your certificates and/or diplomas assessed against Canadian education standards.", " For more information please click on “Degree Equivalency” in the Education section above.", "Please note that achieving the pass mark on any of the assessments used does not necessarily mean you will move forward in the selection process.", " Management may decide to use a score that is higher than the pass mark on any of the evaluations used throughout the selection process.", " Management may also decide to use top-down or random selection at any stage of the process, or to invoke an asset(s) at any point of the process.", "DFO recognizes and values the important contribution volunteer work offers in developing employees' experience, skills, etc.", ", as well as enriching our organization and communities.", " Throughout this selection process, you are encouraged to demonstrate how any relevant volunteer work (e.", "g.", ", working on committees, union activities, employee networks, community work, etc.", ") has contributed to the development of your experience, skills, personal suitability, etc.", ", as they relate to this position.", "****************************************************.", "COMMUNICATION.", "****************************************************.", "Communication for this process will be sent to your GC Jobs account and to your e-mail.", " You must check your e-mail account frequently as there may be a deadline for responses.", " It is your responsibility to ensure accurate contact information is provided and updated as required.", " Please ensure your e-mail address accepts email from unknown users (some email systems block these types of email).", " Please note that we will consider that you are not interested in participating in this selection process should you not respond to our communication.", "When communicating with us during any stage of this process, please indicate the selection process number 20-DFO-MAR-EA-EOS-299815 in the subject field of your email.", "Please note that your overall conduct and communications, including email correspondence, throughout the entire process may be used in the assessment of qualifications.", "****************************************************.", "OFFICIAL LANGUAGES.", "****************************************************.", "Persons are entitled to participate in the selection process in the official language of their choice.", " Applicants are asked to indicate their preferred official language in their application.", "****************************************************.", "ORGANIZATIONAL NEEDS.", "****************************************************.", "In order to achieve a representative workforce, selection may be based on qualified candidates self-declaring (at time of application) as being a member of visible minority group or an aboriginal person or a person with a disability or a woman."]}]