[{"title": "Associate Software Engineer - C++ Programmer"}, {"subtitle": "The Role", "body": ["As a C++ Programmer you will be part of an actuarial team and provide support for the actuarial programmers.", " You will also be responsible for assisting with ongoing maintenance of the code and assisting internal clients with issues related to AXIS.", "Your role will entail working independently alongside actuaries and system developers:.", "programming complex data conversions.", "Profiling and optimizing routines to make them run magnitudes faster.", "assisting actuarial programmers with writing scalable and robust code.", "designing and implementing new features for AXIS in the user interface and database areas.", "liaising between system developers and actuarial programmers.", "troubleshooting issues for internal clients.", "testing and reconciling new features.", "other duties as assigned."]}, {"subtitle": "Qualifications & Skills", "body": ["Degree in Computer Science, Software Engineering, Applied Mathematics or Statistics.", "Strong hands on experience in C++ development.", "Excellent understanding of algorithm designs.", "Knowledge of database technologies and database design principles.", "Good communication and interpersonal skills.", "Strong analytical and debugging skills.", "Experience or exposure to embedded database engines, an asset.", "Prior experience developing financial applications in the actuarial field, an asset."]}, {"subtitle": "LOB/Department", "body": ["Enterprise Risk Solutions (ERS) combines software, data and models with quantitative analysis and advisory services, to help firms manage credit portfolios and balance sheets effectively, optimize use of capital and achieve regulatory compliance."]}, {"subtitle": "Working at Moody's", "body": ["Moody's (NYSE: MCO) is a global integrated risk assessment firm that empowers organizations to make better decisions.", " Our data, analytical solutions and insights help decision-makers identify opportunities and manage the risks of doing business with others.", " We believe that greater transparency, more informed decisions, and fair access to information open the door to shared progress.", " With over 11,000 employees in more than 40 countries, Moody's combines international presence with local expertise and over a century of experience in financial markets.", " Learn more at moodys.", "com ."]}, {"subtitle": "Entity", "body": ["Moody’s Analytics provides financial intelligence and analytical tools supporting our clients’ growth, efficiency and risk management objectives.", " The combination of our unparalleled expertise in risk, expansive information resources, and innovative application of technology, helps today’s business leaders confidently navigate an evolving marketplace."]}, {"subtitle": "EEO Policy", "body": ["Moody’s is an equal opportunity employer.", " All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, place of origin, disability, marital or familial status, sexual orientation, gender expression, gender identity or any other characteristic protected by law.", " We encourage applications from Aboriginal persons, members of a visible minority group, persons with a disability, members of the LGBTQ+ community, and women.", "Moody’s is committed to maintaining an inclusive, diverse and accessible workplace.", " To this end, reasonable accommodations are available on request, and will take into account the particular accommodation needs of individual candidates.", " If you are selected and require accommodation during any stage of the recruitment process, you may send your request to AODA@moodys.", "com .", " Information provided during the accommodation process will be treated as confidential, and will be shared only to the extent required to properly evaluate accommodation requests."]}, {"subtitle": "Securities Trading Policy (STP)", "body": ["Candidates for Moody's Corporation may be asked to disclose securities holdings pursuant to Moody’s Policy for Securities Trading and the requirements of the position.", " Employment is contingent upon compliance with the Policy, including remediation of positions in those holdings as necessary."]}]