[{"title": "Machine Learning Developer Intern"}, {"subtitle": "Introduction", "body": ["At IBM, work is more than a job - it's a calling: To build.", " To design.", " To code.", " To consult.", " To think along with clients and sell.", " To make markets.", " To invent.", " To collaborate.", " Not just to do something better, but to attempt things you've never thought possible.", " Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.", "Your Role and Responsibilities.", "This position resides in Calgary, AB and is a 4-month work term commencing January 2021 .", " It is mandatory that all applicants are enrolled in full-time studies at a post-secondary institution and returning to full-time studies upon completion of the work term.", "This position is for the IBM Cognitive & Advanced Analytics team in Calgary.", " Our team is looking for candidates with exceptional technical aptitude, a passion for applied data science, and an interest in solving business challenges with machine learning.", "The successful candidate will join a fast-paced consulting team, composed of Partners, Product Managers, Data Scientists, Architects and Software Engineers to conceptualize, develop and deploy machine learning solutions to solve enterprise scale problems.", " As a team, we pride ourselves on tackling some of the most difficult challenges our clients face by bringing together subject matter expertise, data science, and technical execution.", "As an intern ML Developer, you’ll have the opportunity to learn and use industry leading ML technologies on a project which generates value for external client engagements or an internal initiative.", " Depending on the project’s technical requirements, you will have the opportunity to use proprietary IBM technologies such as IBM Analytics Engine, while embracing open source technologies such as Kubeflow, Spark, Tensorflow, and Baselines (OpenAI)."]}, {"subtitle": "Required Technical and Professional Expertise", "body": ["Co-op or internship program enrollment is mandatory.", "Currently pursuing a quantitative degree in Computer Science, Statistics, Mathematics, Econometrics or a related field.", "Demonstrated familiarity or interest in machine learning, statistical analysis, or data mining through previous internships, personal/ academic projects, hackathons, and/or publications.", "Experience with object-oriented programming in Python.", "Ability to confidently communicate ideas to an audience of peers and managers.", "Comfortable and effective working independently and as a member of a cross-functional team."]}, {"subtitle": "Preferred Technical And Professional Expertise", "body": ["One or more work terms in a machine learning or software engineering related role.", "A year of experience using machine-learning or data engineering libraries/frameworks in python (scikit-learn, tensorflow, pyspark).", "General familiarity with cloud application development and the tools required for building cloud native data applications (Kubernetes, Docker, Spark, S3)."]}, {"subtitle": "About Business Unit", "body": ["IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy.", " IBM Services partners with the world's leading companies in over 170 countries to build smarter businesses by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.", "Your Life @ IBM.", "What matters to you when you’re looking for your next career challenge?.", "Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge.", " Join us, not to do something better, but to attempt things you never thought possible.", "Impact.", " Inclusion.", " Infinite Experiences.", " Do your best work ever."]}, {"subtitle": "About IBM", "body": ["IBM’s greatest invention is the IBMer.", " We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action.", " IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition.", " Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.", "Location Statement.", "This role will involve working with technology that is covered by Export Regulations sanctions.", " If you are a Foreign National from any of the following US sanctioned countries (Cuba, Iran, North Korea, Sudan, and Syria) on a work permit, you are not eligible for employment in this position.", "Being You @ IBM.", "IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer.", " All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.", " IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."]}]