[{"title": "Software Engineer"}, {"subtitle": "What You’ll Do", "body": ["Our software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free.", " Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more.", " While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design.", "Unsure where to start? Apply and explore all of the possibilities in Applications Development, Database Development, Embedded Networking and OS Development, IT, Security, Test & Quality, Web Services, etc."]}, {"subtitle": "How You Can Stand Out", "body": ["Recent graduate or on your final year of studies toward a bachelor’s degree or master's degree in Computer Science, Computer Engineering, Electrical Engineering, or a related major such as Math, Physics.", "You’re hungry to get your hands on new, exciting technologies and have a deep understanding of the fundamentals of computer science and engineering.", "Up-to-date on programming and scripting languages.", "You can tackle problems with ease and take a creative approach in debugging programs.", "Excited to work on an extended team and can expertly collaborate with others.", "Can be succinct and to the point using verbal and written skills."]}, {"subtitle": "Who You’ll Work With", "body": ["Our team of software gurus are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc.", "You would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces.", " On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on.", " See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play."]}, {"subtitle": "Why Cisco", "body": ["#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.", "We embrace digital, and help our customers implement change in their digital businesses.", " Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company.", " And a security company.", " We even invented an intuitive network that adapts, predicts, learns and protects.", " No other company can do what we do – you can’t put us in a box!.", "But “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.", ").", "Day to day, we focus on the give and take.", " We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.", ") We take accountability, bold steps, and take difference to heart.", " Because without diversity of thought and a dedication to equality for all, there is no moving forward.", "So, you have colorful hair? Don’t care.", " Tattoos? Show off your ink.", " Like polka dots? That’s cool.", " Pop culture geek? Many of us are.", " Passion for technology and world changing? Be you, with us!."]}]