[{"title": "Analyst, Business Line Support Services"}, {"subtitle": "Important messages", "body": ["We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process.", " If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation.", " All information received in relation to accommodation will be kept confidential.", "Assessment accommodation.", "Candidates must clearly explain in detailed in their answers to the screening questions how they meet each required education and experience criterion including the assets qualifications.", "When providing your answers you must include where and how you obtained the required education and experience, as well as the period(s) in which you performed those duties.", " Please note that stating the requirement has been met, and/or listing past or current responsibilities, does not represent adequate substantiation.", " Candidates must provide concrete examples that clearly illustrates how they meet each one of them.", " Each answer must be different from one another (NO COPY PASTE) and must address the specific question.", "Please note that your answers to the pre-screening questions will be used to evaluate the ability to communicate effectively in writing.", "Only the information provided in the answers to the questions will be used for screening purposes.", " Candidates will not be solicited for incomplete or possible missing information.", " Resumes will only be used as a secondary source to validate the education and/or experience described in the answers to the screening questions.", " Failure to provide the information in the requested format will result in candidates’ applications being rejected.", "WORK LOCATION.", "IITB's hub locations outside of the National Capital Region (NCR) are situated in: St.", " John's, Dartmouth, Charlottetown, Bathurst, Fredericton, Miramichi, Moncton, St.", " John, Boucherville, Jonquière, Laval, Montréal, Québec, Shawinigan, Belleville, Chatham, Cornwall, London, Toronto, Mississauga, Windsor, Vaughan, Winnipeg, Regina, Edmonton, Calgary and Vancouver.", "Work locations are distributed across Canada.", " Most of the positions are in the National Capital Region (NCR)."]}, {"subtitle": "Duties", "body": ["Providing and contributing to the analysis and research for the provision of strategic and effective Information Technology (IT) enabled business solutions delivering on the Employment and Social Development Canada‘s department operational mandate.", "The analyst is responsible for the provision of analysis and research to support the delivery of IT Business Line Support Services activities.", " He or she requires experience in analysis and research to gather and document business requirements, interpret and analyze requirements, assist in the development and recommending of solutions to management and other stakeholders, assist in the review of IT project plans and proposal and ensure compliance.", "Please note that the pool is for client business analyst positions, and NOT for application development analyst positions."]}, {"subtitle": "Work environment", "body": ["If you are interested in making a difference serving Canadians and therefore improving Government of Canada services and programs then the Innovation, Information and Technology Branch (IITB) is looking for you!.", "IITB provides innovative solutions, which support Employment Social Development Canada (ESDC) digital services to the citizens and employers.", " We are a diverse, national organization powered by innovative thinking and approaches, delivering efficient, reliable and secure services and solutions.", "You will work with a talented and engaged team to bring creative solutions to ESDC employees and the public.", "The IT BLSS organization is responsible for providing, contributing and managing analysis and research for the provision of strategic services in support of effective IT enabled business solutions to deliver on the Department’s operational mandate.", " IT BLSS includes the disciplines of IT business analysis, IT project management, IT supplier relationship management, and IT client portfolio management."]}, {"subtitle": "Intent of the process", "body": ["A pool of partially qualified candidates will be established and may be used to staff similar positions within ESDC with various tenures and/or various language requirements (Bilingual Imperative BBB/BBB, English or French Essential) and/or locations."]}, {"subtitle": "In order to be considered, your application must clearly explain how you meet the following (essential qualifications)", "body": ["EDUCATION.", "Successful completion of two years of an acceptable post-secondary educational program in computer science, information technology, information management or another specialty relevant to the position to be staffed.", "You must be prepared to provide the original or a certified copy of your educational credentials.", "Notes:.", "1.", " Indeterminate period incumbents of positions in the CS group on May 10, 1999, who do not possess the education prescribed above, are deemed to meet the minimum education standards based on their education, training and/or experience.", " They are accepted as having met the minimum education standard whenever this standard is called for when staffing positions in the CS group.", "2.", " It is the recognized educational institution (e.", "g.", " community college, CÉGEP or university) that determines if the courses taken by a candidate correspond to two years of a post-secondary program at the institution.", "3.", " At the manager's discretion, an acceptable combination of education, training and/or experience may serve as an alternative to the minimum post-secondary education stated above.", " Whenever the minimum education is met using this alternative, it is met for the specific position only and must be re-assessed for other positions for which this alternative has been specified by the manager.", "Degree equivalency.", "EXPERIENCE.", "EX1- 1.", " Recent experience* gathering and analyzing information from a variety of sources (e.", "g.", " client business environment, operations, processes and practices, and/or IT supplier solutions) and summarizing the findings in context with the proposed project or initiative.", "EX2- 2.", " Recent experience*, working with clients and collaborating with Information Management and/or Information Technology specialists, to analyze business requirements, propose current and future business solutions and recommendations.", "EX3- 3.", " Recent experience* contributing to and/or writing Business Analysis and/or Project Management documentation following organization and/or industry standards, including but not limited to business requirements, business cases/models, option analysis, project plans, risk analysis, etc.", "DEFINITIONS:.", "RECENT EXPERIENCE is defined as a minimum of twelve (12) cumulative months of hands-on experience acquired within the last three (3) years in a professional environment (i.", "e.", " non- academic)."]}, {"subtitle": "The following will be applied / assessed at a later date (essential for the job)", "body": ["Various language requirements.", "Bilingual Imperative- Level: BBB / BBB.", "English or French Essential.", "Information on language requirements.", "BEHAVIOURAL COMPETENCIES.", "1.", " Analytical Thinking (proficiency level 2).", "2.", " Client Focus (proficiency level 2).", "TECHNICAL COMPETENCIES.", "1.", " Business Analysis (proficiency level 3).", "AND/OR.", "2.", " IT Project Management (proficiency level 2).", "ABILITIES.", "AB1- Ability to communicate effectively in writing.", "AB2- Ability to communicate effectively orally.", "AB3- Ability to conduct research with stakeholders to identify appropriate existing or new IT solutions.", "PERSONAL SUITABILITIES.", "PS1- Integrity and Respect.", "PS2- Effective interpersonal skills."]}, {"subtitle": "The following may be applied / assessed at a later date (may be needed for the job)", "body": ["ASSET QUALIFICATIONS.", "EDUCATION / CERTIFICATION.", "Professional certification, diploma or degree - examples include:.", "AED1- Graduation with a degree from a recognized post-secondary institution in computer science, information technology, information management, or another specialty relevant to the position being staffed, such as: Business Administration, Business Analysis, Marketing, etc.", "AED2- Successful completion of Project Management and/or Business Analyst courses (Introductory, Intermediate).", "AED3- Project Management Accreditation (such as Project Management Professional (PMP); Prince 2 Practitioner; or Certified Associate in Project Management (CAPM)), or a Project Management Certification from a recognized university.", "AED4- Business Analyst certification from a recognized professional organization.", "Degree equivalency.", "EXPERIENCE.", "AEX1- Experience as a participant within an Information Management and/or Information Technology structured project management environment.", " Evidence of contributing to one or more components of the management of the overall project (e.", "g.", " project life-cycle management, risk management, costing, dashboards, status reporting, etc.", ").", "AEX2- Experience contributing to formal project documentation for management (e.", "g.", " proposals, statements of work, business cases, project charters, etc.", ").", "AEX3- Experience providing support in the development of various project management reporting dashboards and/or other project management related reporting materials.", "AEX4- Experience working in application/solution development environments.", "AEX5- Experience working with business users to gather and document various types and levels of business and/or solution requirements in support of program objectives.", "AEX6- Experience working with various business users to define, scope and initiate projects.", "AEX7- Experience interviewing program stakeholders.", "AEX8- Experience reviewing and interpreting business requirements.", "AEX9- Experience translating program business requirements for IT developer groups.", "ORGANIZATIONAL NEEDS:.", "At Employment and Social Development Canada, diversity is our strength.", " If you’re a woman, an Aboriginal person, a person with a disability or a visible minority and are interested in bringing in different perspectives and insights, let us know by completing the Employment Equity (EE) section in your application.", " Appointments of members of these EE groups could be made to ensure our workforce is inclusive and representative of the Canadian public we serve.", "OPERATIONAL REQUIREMENTS.", "Willingness and ability to work overtime as needed, sometimes on short notice.", "Willingness to travel within Canada if/when required."]}, {"subtitle": "Other information", "body": ["The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve.", " We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply.", "Information on employment equity.", "In order to be considered, your application must clearly explain how you meet the.", "essential qualifications.", "If you are a Government of Canada employee, please identify clearly your substantive group and level, and your employment status on your resume and/or application form.", "If you are a Government of Canada employee, please include your Personal Record Identifier (PRI) in your application.", "Reference checks may be sought.", "An interview may be conducted.", "A written examination may be administered.", "Candidates must meet the essential qualifications to be appointed to a position.", "Candidates may be required to meet one or more of the Asset qualifications and/or the organizational needs, depending on the requirements of the specific position being staffed.", "Due to evolving needs in IM/IT, additional assets may be added at a later date.", " Should this occur, all successful candidates in the pool will be informed and will have the opportunity to inform us if they meet the added asset qualification(s).", "Depending on the number of applicants and the human resources needs and/or plans, volume management strategies may be used for the purpose of managing applications to determine the candidates who will continue in the next steps of the staffing process.", " Such volume management strategies might include: screening of applications based on the Asset Qualifications, random selection, top-down approach and/or establishment of cut-off scores.", "All information obtained throughout the selection process, from the time of application to the conclusion of the process, may be used for evaluation purposes.", "The essential qualifications that are listed in this statement of merit criteria are mandatory.", " A pass mark will be established for each.", " An applicant may be appointed to the position even though he/she does not meet any of the asset qualifications.", " However, meeting these criteria is desirable and may be a deciding factor in choosing the person to be appointed.", " In the event that there are as many applicants who meet the essential qualifications as there are vacancies, the manager may decide not to assess some or all of the asset qualifications.", "For Government of Canada employees, an assignment, secondment or an acting appointment is a temporary resourcing option.", " The approval of your substantive supervisor will be required before an offer can be made.", "All communication regarding this process will be administered via e-mail.", " It is the candidate’s responsibility to provide a valid e-mail address and update his/her personal information when it changes.", " If special circumstances prevent you from having access to your e-mail, please advise the application contact noted below.", "Acknowledgment of receipt of applications will not be sent; we will contact candidates when the pre-screening process is completed.", "You must provide proof of your education credentials.", "We strongly encourage applicants to submit their applications online.", "Listed below are some of the benefits associated with applying on-line:.", "Applicants can create and manage their accounts and apply to job opportunities as long as an internet connection is available.", "Applicants can create a profile and retrieve stored application(s) (personal information, covering letter and résumé) previously submitted and modify them, if necessary, before submitting the application.", "Applicants can modify their application/resume at any time BEFORE the closing date indicated on the job advertisement.", "Please note that within the context of this selection process, relocation fees, travel costs or travel expenses will not be reimbursed.", "Candidates are entitled to participate in the appointment process in the official language of their choice.", "The Public Service of Canada is committed to building a skilled, diverse workforce reflective of Canadian society.", " As a result, it promotes employment equity and encourages candidates to indicate voluntarily on their application if they are a woman, an Aboriginal person, a person with a disability, or a member of a visible minority group.", "The Public Service of Canada is also committed to developing inclusive, barrier-free selection processes and work environments.", " If contacted in relation to a job opportunity or testing, you should advise the Public Service Commission or the departmental official in a timely fashion of the accommodation measures which must be taken to enable you to be assessed in a fair and equitable manner.", " Information received relating to accommodation measures will be addressed confidentially."]}]