[{"title": "Software Developer"}, {"subtitle": "description", "body": ["TripStack is revolutionizing the travel & technology field with a mission to challenge the status quo by solving difficult problems and changing the way millions of people travel.", "We offer unique flight content, consisting of Virtual Interline & Low-Cost carriers in one search - this enables our partners to offer the end consumer the most relevant flight options at the lowest price.", "Our company’s core values are what form our foundation.", " They inform how we work, how we execute, how we choose our future teammates and how we present ourselves to the world as TripStack employees.", "Playing to Win: Play as a team, Win as a team.", " We are all dedicated to the work we do and we use each other’s strength as team players in a high performing team, reaching for a common goal.", "Sense of Urgency to be Excellent: Swift actions – move fast, try new things, capture opportunities and don’t be afraid of making mistakes – but learn from them.", "Act with Ownership: We are all a part of a bigger picture and we cooperate respectfully but with requirements on ourselves and each other to meet our joint objectives.", "TripStack is part of the Etraveli Group, a global online travel agency and the fastest growing in Europe whose presence across the web spans 50 countries."]}, {"subtitle": "The Role", "body": ["We are looking for a Software Developer to join our development team.", " You will be responsible for analyzing low cost carrier web pages, analyzing technologies, building a process to incorporate LCC inventory, jump into existing code/debug, and much more.", " We are looking for someone who is a natural problem solver, detail-oriented and can work both independently and collaboratively in a fast-paced environment."]}, {"subtitle": "Responsibilities:", "body": ["Analyze Low Cost Carrier (LCC) web pages and their structures.", "Analyze the technology being used on a site (jQuery, React, Angular, etc).", "Evaluate if an LCC is a fit for our platform based on this analysis.", "Build a process to incorporate LCC inventory into our Trip Builder API.", "Jump into existing code and debug.", "Participate in daily stand-up meeting and provide input into the various processes.", "Contribute to projects and initiatives and make the lives of your team easier."]}, {"subtitle": "Desired Skills & Experience:", "body": ["Masters or Bachelor’s in computer science or software engineering.", "Strong fundamentals in Algorithms, Object Oriented Programming and Data Structures.", "3 to 6 years of C# experience.", "Experience in Selenium and Chrome debugger.", "Excellent knowledge of internet, networking protocols and WWW fundamentals.", "3-6 years of experience with Javascript / Ajax / JSON, JQuery.", "Well versed with source control tools like Github, Gitlab.", "Strong troubleshooting and problem solving skills.", "Collaboration and teamwork skills; experiences working in a multi-functional, geographically dispersed engineering team.", "Tenacity and a never give up mentality; exudes ‘stick-to-itiveness’ in the face of adversity."]}, {"subtitle": "Additional experience that would be considered an asset:", "body": ["Experience with Google Cloud Platform or other cloud providers & cloud native architecture.", "Experience with Kubernetes.", "Experience in bot detection and browser fingerprinting techniques considered an asset.", "Experience with code review tools like SonarQube."]}]