[{"title": "Engineer I-Software"}, {"subtitle": "Company Description", "body": ["Microchip Technology Inc.", " is a leading provider of embedded control applications.", " Our product portfolio comprises general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers, 32-bit microprocessors, field-programmable gate array (FPGA) products, a broad spectrum of high-performance linear, mixed-signal, power management, thermal management, radio frequency (RF), timing, safety, security, wired connectivity and wireless connectivity devices, as well as serial Electrically Erasable Programmable Read Only Memory (EEPROM), Serial Flash memories, Parallel Flash memories, and serial Static Random Access Memory (SRAM).", " We also license Flash-IP solutions that are incorporated in a broad range of products."]}, {"subtitle": "Job Description", "body": ["The Microchip FPGA Software Engineering team delivers a comprehensive software suite for designing Microchip’s FPGAs and managing the entire design flow from entry, to synthesis, through place-and-route, timing, power analysis, and simulation.", " Within the Software organization, the Physical and Logical Design group is responsible for developing high-performance place, route, and synthesis software.", " Our placement and routing tools are distributed commercially to a wide range of customers and are used internally for the exploration of new FPGA architectures.", "We research and implement sophisticated approaches for solving gigantic problems -- like finding high-quality placements for millions of movable modules, or routing circuits whose graph representations contain hundreds of millions of edges.", " To do this, we draw from a variety of computer science domains, including: numerical optimization, linear programming, Boolean satisfiability, stochastic search, graph theory, traffic routing, and computational geometry.", "We have a position in the Physical and Logical Design group.", " As a key member of this R&D team, you will leverage your solid foundation in computer science to develop new placement, routing, and/or synthesis algorithms.", " You will be an important contributor to our team and to our company -- your work will become a vital component of our flow, and your discoveries will enrich the state of cutting-edge CAD research."]}, {"subtitle": "Responsibilities", "body": ["Develop state-of-the-art FPGA CAD algorithms to improve circuit performance, power, and tool runtime.", "Execute methodical, scientific experiments to validate the extent of algorithmic improvements.", "Perform design reviews, unit testing, and code reviews.", "Own and maintain code modules.", "Study literature in the CAD industry and contribute to research discussions."]}, {"subtitle": "Minimum Qualifications", "body": ["BS in CS/EE or related field.", "Strong knowledge and ability in C++, as well as a deep understanding of algorithms and data structures."]}, {"subtitle": "Preferred Qualifications", "body": ["Exposure to placement, routing, and/or synthesis algorithms for FPGAs or ASICs.", "Familiarity with artificial intelligence, linear and non-linear optimization, compiler theory.", "Exposure to parallel programming techniques, like TBB.", "Experience with source code management systems (ClearCase, Git, SVN, Perforce).", "Experience with shell scripting languages (Perl, Python, Bash, TCL).", "Comfortable with large-scale software development in a Linux environment."]}]