[{"title": "Application Engineering Student"}, {"subtitle": "Job Description:", "body": ["Let your imagination go wild!.", "BlackBerry QNX is a world leader in the embedded software that drives many of the world’s most interesting products.", " From space cameras to nuclear reactors to autonomous vehicles and sophisticated medical devices, Blackberry QNX provides the foundation operating system that runs these systems.", " In this role, you will be a part of a team of students tasked with conceiving, implementing, and executing the most creative and clever use of QNX technology that you can think of.", " After a course on QNX application programming, you will be given hardware and software development kits and working with the Field Application Engineering Management team, you will work as a team to produce the wildest invention that you can think of.", "You will have the opportunity to enhance your software and hardware skills, to work with field application engineers worldwide and, if all goes well, to create a viral video of your wild invention for the world to see."]}, {"subtitle": "Responsibilities", "body": ["Research QNX technology and its application usage.", "Conceive, develop, and execute an embedded software and hardware project plan.", "Build a hardware prototype that uses the software your team has developed.", "Record and present your demonstration internally and at external events where applicable.", "Document your research and demonstration."]}, {"subtitle": "Skills And Qualifications", "body": ["Computer Science or Electrical Engineering background with an emphasis on software development.", "Strong communication skills.", "Proficiency with the C language, and scripting languages e.", "g.", " Python.", "Comfortable working with Linux and Windows development environments."]}, {"subtitle": "Additional Assets", "body": ["Knowledge of Operating System fundamentals.", "Experience with hardware development kits like Raspberry Pi, or Beaglebone Black.", "Knowledge of Agile development methodology."]}, {"subtitle": "LIFE AT BLACKBERRY", "body": ["Various Snack & Beverage Programs at all locations.", "Cafeterias and vending machines with subsidized prices at major offices.", "Free parking and accessible public transportation at major offices.", "Skills training and professional development opportunities.", "Organization wide events and various social committees.", "Local discounts and free swag.", "Highly collaborative teams and supportive workplace culture.", "Recreational leagues, fitness classes, and wellness sessions available in most locations."]}]