[{"title": "Software Development Engineer"}, {"subtitle": "What You Do At AMD Changes Everything", "body": ["At AMD, we push the boundaries of what is possible.", " We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies – building blocks for gaming, immersive platforms, and the data center.", "Developing great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the “extra mile” to achieve unthinkable results.", " It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world.", " If you have this type of passion, we invite you to take a look at the opportunities available to come join our team."]}, {"subtitle": "About AMD", "body": ["AMD is a semiconductor design innovator leading the next era of vivid digital experiences with its groundbreaking Accelerated Processing Units (APUs) and Graphics Processing Units (GPUs) powering a wide range of computing devices.", " AMD’s superior graphics technologies are found in a variety of solutions ranging from game consoles, PCs to supercomputers.", " AMD’s server products are focused on driving industry-leading cloud computing and virtualization solutions.", "If you have a passion for excellence and a drive to achieve, you belong at AMD.", " Our employees, AMDers as we like to call them, work hard, have fun, and thrive on success.", " We meet the challenges of an evolving marketplace by staying true to our corporate values, including an unwavering respect for individuals and a focus on retaining superior employees."]}, {"subtitle": "The Role", "body": ["The Integration Quality Engineering (IQE) team is part of AMD’s Software department.", " We are responsible for testing, experimenting and debugging AMD GPU software drivers on AMD cutting-edge hardware including discrete GPU and APU.", " We reside at the early stage of the SW Development Cycle, We are the first line of defense to ensure new SW features are tested and stabilized before moving forward to the next stage of testing phase.", " In this role, you will gain a unique experience in the graphics industry by being exposed to challenging work associated with Software, Hardware and Operating Systems.", " We are looking for an entry level software testing engineering in IQE team to execute manual and automated testing on AMD products."]}, {"subtitle": "Key Responsibilities", "body": ["Perform manual and automated testing on new Graphics driver features and new AMD GPUs.", "Build, set up computer components into test machines.", "Maintain a pool of test machines used for automation test farm.", "File issues reports on SW defects found in testing.", "Perform experimental and regression testing to investigate the root cause of the defect.", "Communicate with development team to drive each bug to closure.", "Write and maintain test scripts to convert manual test cases into automation test cases."]}, {"subtitle": "Preferred Experience", "body": ["Knowledge of AMD Radeon GPU and APU series, and AMD software products and technologies.", "Strong knowledge of PC components and experience in building PCs from scratch.", "Strong interest in computer graphics, gaming, benchmarking, etc.", "Strong communication skills in written and verbal.", "Passionate about software testing and delivering quality product to customers.", "Knowledge in scripting languages e.", "g.", " PowerShell, Python or VBScript.", "Previous experience working in Software quality assurance is a plus."]}, {"subtitle": "Academic Credentials", "body": ["Undergraduate degree in Computer Engineering, Computer Science or similar."]}]