[{"title": "Deep Learning Engineering"}, {"subtitle": "description", "body": ["We are looking for Deep Learning Interns for our Simulation Technology team! Do you have a passion for computer gaming, virtual reality, computer vision, and artificial intelligence?.", "Ever dream about inventing your own holodeck? Do you want to work on leading-edge problems alongside some of the best and brightest people in the world? NVIDIA has continuously reinvented itself over two decades.", " Our invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing.", " More recently, GPU deep learning ignited modern AI — the next era of computing.", " NVIDIA is a “learning machine” company that constantly evolves by adapting to new opportunities that are hard to solve, that only we can pursue, and that matter to the world.", " This is our life’s work, to amplify human creativity and intelligence."]}, {"subtitle": "What You Will Be Doing", "body": ["You will apply deep learning techniques to the simulation of virtual environments, developing methods to generate synthetic data for training neural networks to achieve results comparable to networks trained on real data.", "Work on improving realism for agents in synthetic environments – using reinforcement learning techniques to control behavior and animation of simulated characters, crowds, and vehicles.", "Conduct research into novel Deep Learning network architectures and techniques for achieving the above.", "Perform additional development around related technologies as applied to games, VR and visual effects applications."]}, {"subtitle": "What We Need To See", "body": ["Currently pursuing a PhD, MS, or BS in Computer Science or related field.", "1+ year experience with C++/C, CUDA, DirectX, or OpenGL in addition to Python, PyTorch and TensorFlow.", "Expertise in neural networks, computer graphics, simulation or game development.", "Dedication to producing high quality and creative results."]}, {"subtitle": "Ways To Stand Out From The Crowd", "body": ["You are a great communicator and self-motivated towards team goals.", "You welcome mentoring others around you.", "Sharp mathematics skills.", "NVIDIA is widely considered to be one of the technology world’s most desirable employers.", " We have some of the brightest people in the world working for us and, due to unprecedented growth, our elite engineering teams are rapidly growing.", " If you're a creative and autonomous engineer with a real passion for technology, we want to hear from you."]}]