[{"title": "IT Analyst, Applications Support"}, {"subtitle": "The Firm:", "body": ["Richter is one of Canada's largest independent accounting, business advisory and consulting firms.", " Innovation is the key to our approach, combined with the ability to generate results quickly.", " Richter offers a full range of advisory and consulting services, supported by in-depth industry knowledge and national and international experience.", " Our firm, located in Toronto, Montreal and Chicago, distinguishes itself from all other accounting firms because of the commitment and cooperation of our employees, who are the key to our success."]}, {"subtitle": "Job Overview", "body": ["The Application Support Analyst’s role is to deliver support to end users in the organization about how to use various applications and software efficiently and effectively in fulfilling business objectives.", " This includes troubleshooting applications and software for all internal customers, mainly our operations teams and professional business units.", " The Application Support Analyst is also responsible for assisting in the design, delivery, and improvement of in-house software applications training programs and related courseware.", " The application primarily supported by the analyst will be a CRM, however other applications - existing and future – will also require support."]}, {"subtitle": "A day in the life of an Application Support Analyst:", "body": ["Provide end-to-end user support and training;.", "Perform Quality Assurance procedures on system data (validating, searching and cross-referencing information);.", "Perform onboarding procedures for clients and end-users; validate and grant proper access;.", "Create and deploy feedback mechanisms for end users.", " Analyze results, make recommendations for support process improvement, and implement changes.", "Evaluate documented resolutions and analyze trends for ways to prevent repeated future problems.", "Provide support for the testing of new and existing software applications;.", "Field incoming requests from end users to resolve application, software and process issues.", "Record, track, and document the problem-solving process, including all successful and unsuccessful decisions made, and actions taken, through to final resolution.", "Communicate application problems and follow escalation process (management, development teams, end users, and unit leaders.", "Test fixes and perform post-resolution follow-ups to ensure problems have been adequately resolved.", "Assist in maintaining and enhancing performance of existing software and applications;.", "Identify and learn appropriate software applications used and supported by the organization.", "Coordinate with department heads to assess departmental application training needs and objectives.", "Participate in the design, development, and delivery of software applications training programs and classes.", "Communicate software updates and frequently asked questions, update knowledge bases to assist in problem resolution."]}, {"subtitle": "What we are looking for:", "body": ["College diploma or university degree in the field of computer science, information systems, and/or 4 years equivalent work experience – mainly application support and development.", "Experience in supporting a CRM; Salesforce experience, an asset.", "Proven experience with troubleshooting and issue resolution – support.", "Proven experience with in-person support and training.", "Ability to manage data and to conduct effective searches in databases;.", "Knowledge of the MS Office suite, particularly Excel.", "Able to develop and interpret documentation for training and end user procedures.", "Experience with building and maintaining databases for problem tracking.", "Good understanding of the organization’s goals and objectives.", "Highly self-motivated and directed.", "Ability to absorb new ideas and concepts quickly.", "Good analytical and problem-solving abilities.", "Ability to effectively prioritize and execute tasks in a high-pressure environment.", "Ability to present ideas in business-friendly and user-friendly language.", "Very strong customer service orientation.", "Fully bilingual (French and English).", "Excellent written, oral, interpersonal, and presentational skills.", "Experience working in a team-oriented, collaborative environment.", "Knowledge of trends in technology relating to software applications."]}, {"subtitle": "What Richter offers you?", "body": ["A competitive compensation package, insurance benefits, a retirement savings plan, an employee and family assistance program, a health and well-being program, as well as professional development are also offered.", " To accommodate your personal and family obligations, a variety of work arrangements are available which may include a flexible schedule and working remotely."]}]