[{"title": "Jr. Data Scientist"}, {"subtitle": "Who are you?", "body": ["You believe data helps businesses solve real-world problems.", " You are familiar, but not necessarily an expert with the general data science umbrellas of responsibility: problem definition, data ingestion, data normalization/cleaning, analyzing/machine learning, and data visualization.", " You like to explore datasets to find insights that nobody else sees.", " You can communicate these ideas through visualizations.", " You think machine learning is cool.", " You are not bound to a framework or tool and feel comfortable picking up something new if it is right for the job.", " And most importantly, you love to learn new things and enjoy a challenge."]}, {"subtitle": "What will you do?", "body": ["You will be part of a team dedicated to generating new and interesting insights from our data as well as open source data.", " You will be responsible for identifying and building upon use cases that could meet this end, determining if there is a suitable path forward given the data available, and producing measurably useful insights, predictions, and/or prescriptions using applicable tools/methodologies.", " Your discoveries will help us market Blackline Vision both internally and externally as a front-runner in data-driven operations."]}, {"subtitle": "Requirements:", "body": ["Post-secondary degree in a quantitative field (Mathematics, Computer Science, Physics, or a similar).", "Comfortable but not necessarily an expert with SQL, scripting languages, data handling, and statistics.", "Strong communication skills in written, spoken, and visual mediums.", "Experience working with technical teams.", "Comfortable with troubleshooting technical problems.", "Optional (considered an asset):.", "A graduate degree in a quantitative field.", "Experience with Python.", "Experience with specialized algorithms (e.", "g.", " specific machine learning algorithms, outlier detection algorithms, other modelling algorithms, etcetera).", "Experience in Applied Data Science or Applied Statistics."]}, {"subtitle": "About Blackline Safety", "body": ["Blackline Safety is a world leader in the development and manufacturing of wirelessly connected safety products — we offer the broadest and most complete portfolio in the industry.", " We monitor personnel working alone in populated areas, indoors within complex facilities, and employees operating in the most remote reaches of our planet.", " Our products are used to keep people safe in the event of falls, missed check-ins, man-down events, and exposure to explosive or toxic gas.", " Our products save lives.", " Our design, marketing, customer care, sales, and production are all performed in-house at our headquarters in Calgary, AB.", " Blackline Safety is a publicly traded company (TSXV: BLN)."]}, {"subtitle": "Blackline Safety Offers:", "body": ["An exciting high-growth environment.", "An experienced, dynamic, and motivated team.", "Supportive, challenging, and collaborative work.", "Competitive salary and vacation.", "A comprehensive benefit package (including but not limited to medical, dental, and optical).", "Company stock purchase plan with matching contributions."]}]