[{"title": "Data Scientist"}, {"subtitle": "Open up to the Possibilities!", "body": ["At Purolator, you’ll be proud knowing you’re working for a Canadian company that truly values its employees.", " And it’s community.", " This is an exciting and evolving industry and we’re leading the change as we strive to deliver the future.", " Here you will be empowered to help move the business forward.", " Each and every day.", " Are you open to the possibilities?."]}, {"subtitle": "Job Description", "body": ["We are looking for a Data Scientist who is enthusiastically driven to generate actionable insights and create new growth opportunities.", " You must have proven analytics leadership skills to grow and foster rapid learning and application of insights.", " You will lead analytics initiatives including advanced statistical modelling and develop data-driven solutions across several lines of business and domains.", " This is a unique opportunity to apply your analytics skills in a uniquely Canadian organization rich in history and data."]}, {"subtitle": "Requirements", "body": ["M.", "Sc.", " or Ph.", "D.", " in a quantitative field (e.", "g.", ", Computer Science, Statistics, Financial Economics, Applied Mathematics, Computer Engineering, or other related discipline).", "Experience solving problems with the required use of advanced statistical modelling techniques.", "Proven programming skills including experience conducting modelling and statistical analysis (e.", "g.", ", R, Matlab), object-oriented software development (e.", "g.", ", Python, Scala), and massive parallel processing (e.", "g.", ", Spark, Apache Hadoop).", "Professional experience applying statistical analysis, machine learning, analysis and modelling of large scale and complex datasets.", "Excellent communication skills and ability to describe and present complex technical concepts in clear and concise language across an audience with varying levels of understanding.", "Excellent presentation skills to both technical and non-technical people.", "Ability to lead teams and create an environment of continuous learning and open communication.", "Ability to structure and lead a project from idea to experimentation to prototype to delivery to the customer (internal / external).", "A track record of distilling complex and ambiguous problems into actionable recommendations based on sound data analysis and insights.", "Strong programming fundamentals, and ideally have extensive experience analyzing data using SQL, Pandas, Spark, or similar tools."]}, {"subtitle": "WHAT WE EXPECT?", "body": ["Self-starter that is focused and driven with amazing follow-through.", "Enthusiastically tackling problems with curiosity and a love of sharing ideas and insight.", "Ability to synthesize information, evoke good conversation and consider problems from new perspectives.", "Ability to provide clear recommendations in the face of challenges or limitations.", "Driven to deliver quality solutions and models that are accurate, valid and are supported with reliable data.", "Ability to manage time effectively, prioritize tasks, and take ownership for your work."]}]