[{"title": "Software Engineer"}, {"subtitle": "Who we want:", "body": ["Do you have a Bachelor's degree in Engineering or Computer Science (or related field)?.", "Have you been actively programming for the past two years and realize it's something you love and want to do in the long run?.", "Does the idea of collaborating with passionate team members and working with modern technologies and tools excite you? Read further!.", "We are looking for engineers who bring innovative ideas from all areas, including integrations, deployment, Software-as-a-Service, security, UI design and mobile.", " As a software engineer at Phreesia, you will work on a specific project critical to Phreesia's needs and our market expansion, with opportunities to switch teams and projects as you and our fast-paced business grow and evolve.", " We need our engineers to be versatile leaders who are ready to enthusiastically take on new problems across the full stack as we continue to push healthcare technology forward."]}, {"subtitle": "What you will do:", "body": ["Collaborate and communicate with a diverse, highly distributed team of experienced engineers onshore and offshore.", "Support and maintain Phreesia products within a variety of development stages, primarily utilizing C#/.", "NET, SQL Server, Containers, Web API, MongoDB and Redis.", "Contribute to the development of new software, including build, unit testing, integration testing, deployment and some design work within an agile environment.", "Apply best practices and critical thinking to challenges and processes, taking the initiative to self-learn and resolve issues, but asking for support when needed.", "Bring enthusiasm, creativity and a willingness to learn and improve yourself, as well as the world around you."]}, {"subtitle": "Technologies We Use:", "body": ["C#/.", "NET.", "Angular.", "SQL Server.", "Docker containers.", "AWS.", "Web API.", "MongoDB.", "Redis."]}, {"subtitle": "Who we are:", "body": ["At Phreesia, we're committed to helping healthcare organizations succeed in a fast-changing landscape—and we need smart, passionate people to help us do it.", " Our innovative SaaS platform offers our clients a suite of applications to manage the intake process, giving them the tools to engage patients, improve efficiency, optimize staffing and enhance clinical care.", "Basically, what you do here matters, and hard work does not go unnoticed.", " Not only does Phreesia care about our clients, we also care about our employees.", " In fact, we're a three-time winner of Modern Healthcare magazine's Best Places to Work in Healthcare award.", " If you're interested in consistent feedback and recognition, defined career paths, and the opportunity to work with driven and engaged colleagues in a dynamic industry, this may be the right opportunity for you."]}, {"subtitle": "Benefits and Perks:", "body": ["Variety of health plan options, dental/ vision coverage, and short/long-term and life insurance plans.", "Unlimited vacation.", "Mobile phone stipends and Internet reimbursement.", "Fitness reimbursement.", "100% paid maternity leave to our U.", "S.", " employees, as well as a generous maternity benefit to our employees in Canada.", "Tuition and certification reimbursement, as well as other professional development opportunities."]}]