[{"title": "Support-Technician, Infrastructure / Operations - Casual Inventory"}, {"subtitle": "Important messages", "body": ["When you apply to this selection process, you are not applying for a specific job, but to an inventory for future vacancies.", " As positions become available, applicants who meet the qualifications may be contacted for further assessment."]}, {"subtitle": "Intent of the process", "body": ["This inventory is for casual employment.", " Casual employment is a temporary employment of 90 working days or less, in a calendar year, to meet needs arising from such contingencies as vacations, sick and training leaves, to conduct special projects that are anticipated but dependent of the availability of funds, etc.", "NOTE: Casual Appointments are excluded from the provisions of the Public Service Employment Act (PSEA).", " This means Casual Appointments will not be eligible to apply to internal appointment processes.", " In addition, the PSEA specifies that the number of days worked as a casual worker cannot exceed 90 days in a calendar year within the same department."]}, {"subtitle": "In order to be considered, your application must clearly explain how you meet the following (essential qualifications)", "body": ["Successful completion of two years of an acceptable post-secondary educational program in computer science, information technology, information management or another specialty relevant to the position to be staffed, or an acceptable combination of education, training and/or experience relevant to the position to be staffed.", "Degree equivalency.", "Recent* experience in providing first level IT support services to clients on-site and remotely.", "Experience in supporting applications (including Microsoft Office) in a networked Microsoft Windows 7 environment.", "Experience in providing technical advice and guidance to users with varying degrees of computer knowledge.", "Experience in providing a variety of informatics support services (both hardware and software) (e.", "g.", " Installation, configuration, maintenance, troubleshooting problems).", "Recent is defined as experience acquired within the last five (5) years."]}, {"subtitle": "If you possess any of the following, your application must also clearly explain how you meet it (other qualifications)", "body": ["ITIL Foundation Certification.", "Microsoft Certification.", "CompTIA A+, Network+ or Security+ Certification.", "Degree equivalency.", "Experience providing computer related technical support over the phone or via remote control in a helpdesk environment.", "Experience providing user support and troubleshooting for end-user and mobile devices such as Blackberries and tablet computers.", "Experience supporting remote office locations."]}, {"subtitle": "The following will be applied / assessed at a later date (essential for the job)", "body": ["English essential.", "Information on language requirements.", "Being a Team Player.", "Effective Interactive Communication.", "Analytical Thinking.", "Client Focus.", "Teamwork.", "Conditions of employment.", "Reliability Status security clearance.", "Support clients nationally Monday to Friday between the hours of 7:30 a.", "m.", " to 5:00 p.", "m.", " ADT.", "Lift up to 20 kilograms."]}, {"subtitle": "Other information", "body": ["The Public Service of Canada is committed to building a skilled, diverse workforce reflective of Canadian society.", " As a result, it promotes employment equity and encourages candidates to indicate voluntarily on their application if they are a woman, an Aboriginal person, a person with a disability or a member of a visible minority group.", "The Public Service of Canada is also committed to developing inclusive, barrier-free selection processes and work environments.", " If contacted in relation to a job opportunity or testing, you should advise the Public Service Commission or the departmental official in a timely fashion of the accommodation measures which must be taken to enable you to be assessed in a fair and equitable manner.", " Information received relating to accommodation measures will be addressed confidentially."]}]