[{"title": "Data Scientist"}, {"subtitle": "Company Description", "body": ["Wish is a mobile e-commerce platform that flips traditional shopping on its head.", " We connect hundreds of millions of people with the widest selection of delightful, surprising, and—most importantly—affordable products delivered directly to their doors.", " Each day on Wish, millions of customers in more than 160 countries around the world discover new products.", " For our over 1 million merchant partners, anyone with a good idea and a mobile phone can instantly tap into a global market.", "We're fueled by creating unique products and experiences that give people access to a new type of commerce, where all are welcome.", " If you’ve been searching for a supportive environment to chase your curiosity and use data to investigate the questions that matter most to you, this is the place."]}, {"subtitle": "Job Description", "body": ["We are looking for a Data Scientist who will work cross-functionally with technical and non-technical teams to take on a variety of tasks including but not limited to mining data, building models, building dashboards, and conducting detailed analysis.", "The ideal candidate should be passionate about Wish and e-commerce, has a strong analytical and consultative mindset, deep understanding of databases, visualization, and modeling techniques, and the ability to thrive in a dynamic, fast-paced environment delivering against tight deadlines.", " This role is looking for a data scientist that will drive high impact to the company through various means ranging from feed optimization, creating and deploying supply strategies and evaluating/monitoring fraudulent behavior."]}, {"subtitle": "What you'll be doing:", "body": ["Develop dashboards and recurring reports.", "Maintain the integrity of data pipelines and dependant reporting.", "Design, development and evaluation of highly innovative models.", "Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation.", "Work closely with software engineering teams to drive real-time model implementations and new feature creations.", "Conduct market research for various market segments.", "Analyze internal behavior tracking data and forecast Wish users’ demand.", "Identify high potential but underexposed product candidates, propose strategies to increase their exposure and boost sales.", "Implement the strategies and set up A/B test experiments to gauge the impact, and reiterate."]}, {"subtitle": "Qualifications", "body": ["Bachelor's or advanced degree in an analytical field (e.", "g.", " Computer Science, Engineering, Mathematics, Statistics or similar).", "2+ years of hands-on experience in predictive modeling and analysis.", "2+ years Python, R, or Matlab experience.", "2+ years experience writing complex SQL queries in a business environment.", "2+ years experience with Tableau, OBIEE or other visualization tools.", "2+ years experience operating in a Unix/Linux environment."]}, {"subtitle": "Preferred Qualifications", "body": ["Analytical mindset and ability to see the big picture and influence others.", "Detail-oriented and must have an aptitude for solving unstructured problems.", "Ability to work effectively in a multi-task, high volume environment.", "Ability to be adaptable and flexible in responding to deadlines and workflow fluctuations.", "A/B test experience."]}, {"subtitle": "Additional Information", "body": ["Wish values diversity and is committed to creating an inclusive work environment.", " We provide equal employment opportunity for all applicants and employees.", " We do not discriminate based on any legally-protected class or characteristic.", " Employment decisions are made based on qualifications, merit, and business needs.", " If you need assistance or accommodation due to a disability, please let your recruiter know.", " For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records.", "Individuals applying for positions at Wish, including California residents, can see our privacy policy here."]}]