[{"title": "Data Science"}, {"subtitle": "Profile", "body": ["Responsible for modeling complex business problems and discovering business insights through the use of statistical, algorithmic, mining, and visualization techniques.", " Leverage and implement state of the art technologies in Machine learning and deep learning in an agile environment."]}, {"subtitle": "Key Responsibilities", "body": ["Understands the decision-making process, workflows, and business and information needs of business unit heads and service manager/owners.", "Translates business needs into analytics/reporting requirements to support executive decisions and workflows with required information.", "Proactively mines data warehouses to identify trends and patterns and generates insights for business units and senior leadership.", "Performs large-scale experimentation to identify hidden relationships between variables in large datasets.", "Researches and implements cutting-edge techniques and tools in machine learning/deep learning/artificial intelligence to make data analysis more efficient.", "Determines requirements that will be used to train and evolve deep learning models and algorithms.", "Visualizes information and develops engaging reports on the results of data analysis using data visualization tools.", "Advises product teams on new products, features or updates through data-based recommendations.", "Supports user experience specialists and information architects to enhance information visualization through development of dashboards and user interfaces.", "Distributes best practices to analytics and product teams and provides consultations for their data-based experimentations."]}, {"subtitle": "Skills", "body": ["Willingness and ability to learn new technologies on the job.", "Ability to read, understand and apply research papers on various real-world problems.", "Basic understanding of deep learning libraries such as Keras, Pytorch etc.", "Fluency with Python and SQL is a must.", "Strong theoretical understanding of machine learning algorithms.", "Strong communication skills.", "Demonstrated ability to work with minimal supervision."]}, {"subtitle": "Experience", "body": ["Basic understanding of Natural language processing technologies and tools.", "Experience using statistics and machine learning to solve complex business problems.", "Proven record of leveraging Deep Learning techniques through course work or prior internships.", "Experience with deploying machine learning models to production environment would be a plus.", "Experience with Power BI is desirable."]}, {"subtitle": "Education Requirements", "body": ["Degree in engineering, computer science or related fields."]}]