[{"title": "Data Engineer"}, {"subtitle": "Job Description", "body": ["Job Description Data Engineer.", "Position Description.", "We are a global IT and business consulting services leader, and after 40 years, we're still growing! Join Canada's largest IT Company .", "CGI supports our members’ career aspirations, offering learning initiatives and provides access to our global health and wellness program.", " We also offer competitive compensation and benefits such as our share purchase plan, a profit sharing program, flexible schedules that guarantee a good work-life balance!.", "Passionate for turning disparate streams of data into organized and actionable analytics.", "programming acumen, competency in manipulating large volumes of data, and with a solid knowledge of a broad range of technologies for data processing and modeling.", "Up-to-date with the latest technology trends and have a strong desire to constantly learn.", "Love solving complex problems and have expertise in world-class data pipelines, from batch to real time implementations.", "Have demonstrated ability to navigate between the big-picture and implementation details.", "Highly detailed-oriented with exceptional organizational and follow-through skills.", "Self-directed and comfortable supporting the data needs of multiple teams and projects.", "Exceptional communication skills, with an ability to make advanced analytics concepts accessible and understandable to non-technical business users.", "Value collaboration and urgency; and have a passion for driving impact."]}, {"subtitle": "Your future duties and responsibilities", "body": ["Create analytical data infrastructure by gathering, processing, analyzing and structuring large volumes of data from many structured and unstructured data sources, at scale.", "Design, develop and implement highly scalable, repeatable and secure data pipelines and transformation processes.", "Design and build transformation models and data flows for batch, real-time and complex event driven processes.", "Develop data ingest processes across a variety of third-party APIs, applications and file stores.", "Ensure that appropriate controls are in place and all in-motion and at-rest data is secured at all times.", "Develop data catalogs and data validation scripts to ensure data accuracy, clarity and correctness of key business metrics.", "Identify and correct data quality issues, performing root cause analysis on internal and external data to answer specific business questions and identify opportunities for improvement.", "Employ proper data governance to ensure data security and integrity.", "Research and make recommendations for new data management technologies and software engineering practices.", " Collaborate on decisions around the use of new tools and practices.", "Provide guidance to a customer and project team with respect to data requirements, data gaps and level of effort required to deliver a solution.", "Assist in the development and delivery of pre and post sales POCs and proposals for client engagements.", "Produce and maintain support documentation and data dictionaries.", "Travel periodically in support of sales and delivery as needed."]}, {"subtitle": "Required Qualifications To Be Successful In This Role", "body": ["At least 2 years of experience working on data transformation, curation and integration for batch and near real-time in Cloud and on-prem environments.", "At least 2 years of hands-on experience working with Big Data technologies such as Spark, Cassandra, Hadoop and/or Hive.", " Working knowledge of message queuing, stream processing, and highly scalable ‘big data’ data stores.", "2 years of experience using one of more data transformation and integration technologies such as Python, Scala, Spark, Spark-Streaming, Kafka Streams and traditional ETL/ELT tools such as DataStage and/or Informatica.", "2 years of hands-on experience working with SQL and Non SQL databases such as Oracle, DB2, SQL Server, Postgres, MangoDB and/or CouchDB.", "Good understanding of microservices architecture and hands-on experience working with REST APIs.", "At least 1 year of experience working on predictive analytics and data mining projects.", "Self-directed and demonstrable problem-solving skills.", "Knowledge of modern software development techniques and methodologies.", "Knowledge and practice of secure software development processes.", "Excellent written and verbal communication skills.", " Ability to communicate effectively with a broad range of constituents.", "Ability to handle multiple priorities and deadlines.", "Bachelor’s degree or diploma in mathematics, informatics, statistics, computer science or information systems (or equivalent combination of skill and experience)."]}]