[{"title": "Technical Support Specialist"}, {"subtitle": "About the Position:", "body": ["This is a full-time position based in our Liberty Village office in Toronto.", "Competitive salary based on experience and relevant skills.", "Full benefits and opportunities for additional incentive based earnings.", "Casual work environment with flexible working options."]}, {"subtitle": "Responsibilities:", "body": ["Manage the collection of installation data from client sites leveraging both our own tools and/or existing client or vendor provided tools.", "Coordinate and plan activities with customer from deployment pre-work until completion with official hand off.", "Practice sound project management principles to ensure your portion of projects are delivered on time and on budget.", "Work with team members, management and customers to identify and understand functional and technical requirements, ultimately documenting them as a use case in GIT.", "Participate in twice-weekly project meetings.", "Identify opportunities for improvement in existing products, working with the team to design and execute appropriate fixes where required.", "Provide technical support and to customers and partners through chat/email/phone/webex.", "Remote deployment and configuration of our products for customers.", "Support and deliver customer facing product demonstrations (eventually)."]}, {"subtitle": "Required Skills & Experience:", "body": ["Post-secondary degree, diploma or certificate in computer science or related.", "Service Desk experience beneficial.", "Minimum 12 months of post-graduate experience as network administrator or similar IT support role.", "A solid foundation in core network concepts ideally with hands-on experience administering networks in corporate environments, experience with AWS/Azure and/or software licensing are considered a plus.", "Understanding of Windows authentication protocols, network security and optimization, common virtualization platforms VMWare, V-Sphere •.", "Understanding of HTML, JQuery, Javascript, PHP, CodeIgniter, mySQL, SQL, database indexing and optimization techniques are considered a plus.", "Familiarity with Unix/Linux based operating systems, comfortable in a command line programming environment.", "Strong communication skills, technical and business.", "Most importantly, a keen, curious mind and a thirst for knowledge."]}, {"subtitle": "About Block 64:", "body": ["Block 64 is an early stage software development and IT services company delivering elegant solutions to some of the most enduring business problems.", " Our products have been market tested and are currently deployed in large enterprise organizations globally.", "We are about to take it to the next level, and need your help to achieve our goal of becoming a leading IT asset management solutions provider.", " We are a savvy team of industry vets who like to have a little fun in the office, but are also serious about customer service and helping our business customers reduce IT risk and save money."]}]