[{"title": "Data Scientist"}, {"subtitle": "about us", "body": ["Events in recent years have made us all too familiar with the havoc that natural disasters can wreak, and the increasing frequency and intensity with which they are occurring.", " Despite record levels of losses, conventional methods of risk modeling continue to paint at best an incomplete picture of these threats.", "Zesty.", "ai uses novel data gathering and data science methods to produce higher quality information about the risks to property from catastrophes like floods and wildfires.", " While AI alone may not be able to thwart these disasters, it can help us become more prepared for them, and ultimately that will lead to better outcomes.", "As a Data Scientist, you are comfortable and excited to work closely with the engineering team to build the best AI tech possible.", " You will develop top tier models from unique and diverse data sources to provide strong insights and maximize the impact of our company efforts.", " You thrive in a collaborative, creative environment that moves fast and are comfortable setting in place structures and processes to help the company scale."]}, {"subtitle": "The Opportunity:", "body": ["Exploring data sets and developing new InsureTech models with data science (Machine learning, Deep learning).", "Develop computer vision algorithms that extract insights from aerial imagery and geospatial data.", "Research and model aspects of the built environment utilizing satellite imagery, LiDAR and other datasets.", "Help develop training and cross­-validation data sets for machine learning algorithms.", "Translate product management, engineering, and business constraints and queries into tractable data science questions.", "Iterate rapidly on everything; all of the above happens in a fast paced business driven environment that you must be comfortable with."]}, {"subtitle": "What You Bring to the Zesty.ai Lab Team:", "body": ["BA / BS degree in Math, Physics, Computer Science, and Economics.", "MS or Ph.", "D.", " is certainly a bonus.", "1 - 2 years of experience working with computer vision and building and testing computer vision systems.", "2 - 3 years experience deploying machine learning models in production environments.", "2 - 3 years experience working with deep learning / neural network models (using TensorFlow, PyTorch, Keras, Caffe).", "Ability to develop new models based on physics and AI sciences.", "Strong organizational and management skills with past experiences implementing best practices and processes.", "Experience working with large image datasets (great if you've already worked with satellite imagery) and related tools OpenCV, Pillow, etc.", ").", "Proficient in SQL.", "Experience working with cloud platforms (AWS, Google Cloud, etc).", "Must be legally eligible to work in Canada."]}, {"subtitle": "Why Zesty.ai Lab:", "body": ["Be part of a well-funded growth-stage start-up.", "Market competitive comp and equity incentives to give you a stake in our future.", "Comprehensive health care plan.", "Flexible Time Off.", "An upbeat and collaborative work culture.", "Company-sponsored outings and offsites."]}]