[{"title": "Expression of Interest"}, {"subtitle": "about us", "body": ["1QBit is dedicated to solving the world's most intractable challenges by recasting problems to harness the power of quantum computing.", " We identify demanding industry problems and apply breakthroughs in computation to machine intelligence and optimization science to build software that allows applications to continually benefit from advances in both quantum and classical hardware.", "We believe that quantum technologies will form the next pillar of computational progress.", " We research, benchmark, and build software development kits, online platforms, and applications that make the power of quantum computers accessible to researchers, developers, and industry-leading organizations so they can solve their most difficult problems in fields such as optimization, simulation, and machine learning.", "As an interdisciplinary team of world-class mathematicians, physicists, operations research scientists, computer scientists, software developers, computational chemists, and quantum computing experts, we share a curiosity and drive to uncover new ways of solving currently intractable problems using advanced classical and quantum systems.", "Our work is guided by a shared set of values that are focused on five fundamental principles:.", "Audacity – A drive to pioneer and apply new methods.", " To dream without limit and then do the hard work of bringing your ideas into reality.", "Open Thinking – A belief in the sharing of ideas.", " To approach each exploration with a receptive mindset and collaborate openly to produce the best possible results.", "Interdisciplinary Collaboration – A respect for the diversity of people, backgrounds, and skills.", " A wide range of perspectives reveals a more complete landscape and yields deeper insights.", "Ownership – A feeling of pride in the work of the team and a deep sense of purpose and accomplishment from your contribution.", "Beginner's Mindset – A desire to improve as an expert while retaining the curiosity and openness that inspired you to begin."]}, {"subtitle": "EXPRESSION OF INTEREST", "body": ["While we do not currently have any open positions on our Research Team, we are always on the lookout for exceptional talent to join our organization.", " Should you have a skill set that you think would be of benefit to the 1QBit team, please share your information using the form below.", " We will review your application and get in touch to discuss any opportunities that are a good fit for your skill set and areas of interest."]}, {"subtitle": "How We Work", "body": ["Operating in 1QBit's Agile team structure, it is largely you who will drive your own schedule and work in collaboration with fellow researchers, industry experts, and software developers on partner and client projects in various industry verticals.", " You'll use the Scrum methodology to take an ownership role in autonomously managing your work and supporting your team in finishing project Sprints.", " You'll contribute to 1QBit's continuous improvement through Sprint Retrospectives and by providing input and ideas on every aspect of how our company operates.", "Peer feedback and mentorship will allow to immerse yourself in our team's thinking from day one and will, in turn, support the development of your own ideas through active, iterative collaboration with teammates on papers, patents, and technical reports.", " You will also join multidisciplinary teams made up of our own fundamental and applied researchers and software developers, alongside industry researchers, to explore the solution space of open questions in the field of quantum computing.", " Together, you will consider the fundamental implications of each project throughout the research and software development process."]}, {"subtitle": "What You Bring", "body": ["Members of our team bring a confluence of personality, skills, and intent that contributes to their individual development and our collective growth as an organization.", " Here is the complementary knowledge and mindset you'll bring to our team:.", "Hold a graduate degrees in one or more of the following fields: Math, Physics, Engineering, Machine Learning, Operations Research or Computer Science.", "Possess previous experience working with industry or academic research teams.", "Have an existing interest in, or a desire to learn more about, machine learning.", "Habitually request and action feedback to improve your performance and in turn constantly provide constructive input to team members.", "Proactively seek out opportunities to help move projects forward and contribute to their improvement – whether a project you're working on or someone else's that you're interested in.", "Voraciously learn new trends, tools, and technologies and continually consider how these will influence our projects and the implications and opportunities that they bring.", "Fortify team unity and effectiveness through sharing information, expertise and prioritize team success in problem solving over any individual role in a project.", "Autonomously drive your own projects forward and determine when and with whom to share information to provide regular, consistent, and pertinent information to the team-members who need it."]}, {"subtitle": "Who You Are", "body": ["You share our belief that principles, not policies, enable individuals and teams to apply their unique lens in making decisions.", " Like all 1QBit team members, you thrive in our flat hierarchy of empowered individuals.", " You embrace the rigorous examination of the thoughts and work of diverse minds from multiple disciplines because you know it uncovers deeper insights and produces robust results.", " You believe there is no failure in exploration because new breakthroughs often require rigorous examination of multiple paths before a conclusion is reached.", " You have a desire to apply yourself to purposeful work that is inspiring, meaningful, and fun, to create value for the world by advancing the ability to solve complex problems.", " You have a relentless curiosity for exploring new methodologies and you have an intrinsic drive to architect the foundation of the quantum ecosystem because you love the challenges and understand the rewards that the next paradigm of computation will bring."]}]