[{"title": "Full Stack Software Engineer"}, {"subtitle": "About Delphia", "body": ["Delphia's mission is to ensure your data works exclusively for you.", " We do this by letting people invest their data alongside their money in order to improve their financial returns.", " Data, in this case, could be anything from someone’s profile characteristics (attributes) to the behavioural streams of data they create when using social media, a credit card, or a smartphone.", "We are building a new kind of company that re-thinks the value of privacy, data rights, and fiduciary responsibility in order to ensure your data is always working for you – just like your money.", "Whether we're educating you on how your data can be used to make better investment decisions, or identifying future trends, people at Delphia are socially-minded creatives at heart.", " Our teams are continually iterating, solving hard problems, and collaborating to generate new forms of value and economic returns for our users (we call them “members”, in fact).", " Working together, we want people to realize the true value of their data – and we're just getting started.", "Delphia is a growing (~24 people), multi-disciplinary team located in the heart of downtown Toronto.", " We began in January 2018 and are graduates of Y Combinator (SF) and the Creative Destruction Lab (Toronto).", " In 2018 we raised a Seed round (led by Lerer Hippeau & Golden Ventures) as well as a Series A (led by Real Ventures) in 2019."]}, {"subtitle": "About The Role", "body": ["Delphia is looking for a full stack software engineer who is talented and creative as well as passionate about massive scale, quality, craftsmanship, and looking to push the boundaries of what is possible.", " You're not only an engineer however, you also bring a strong sense of interaction design to the team as well.", "Working as a full stack engineer, you will specialize in building crafted products across the front-end and back-end as well as scaling and improving the core web platform infrastructure that powers our apps.", "You will work inside a multi-disciplinary product team helping prototype new features, Go from idea to implementation, and take responsibility of the existing software and its evolution to support new features, all while maintaining high quality and performance bars."]}, {"subtitle": "We'd Love To Hear From You If", "body": ["You are experienced at using technologies like Python, JavaScript, Django, React, SQL to build modern, scalable web applications.", "You have a high bar for the quality of your code.", " You take pride in it and you pay attention to what you commit.", "You’re curious about the technologies you use and take initiative to dive in and figure things out when you have a question.", "You have an opinion on things but are low on ego.", "You have a track record of trying and learning new things.", "You've preferably had some exposure to data science and/or machine learning.", "You've preferably collaborated across engineering and design teams.", "You've preferably earned an B.", "S.", " or M.", "S.", " degree in Computer Science.", "You have 0-3+ years of experience."]}, {"subtitle": "Culture Fit", "body": ["Impact oriented.", "Growth mindset.", "You are self-directed.", "Bias towards action.", "Intellectually curious.", "Willing to help.", "As a member of the Delphia team, you will enjoy a variety of perks and benefits such as:.", "TTC Accessible: We are conveniently located in the heart of the city at the corner of King and Bathurst.", " Off of the King Streetcar line (504 King).", "Benefits: Comprehensive Health and Dental Benefits.", "Flexibility: Flexible work hours with the ability to work from home when need be.", "Investment: Employee Stock Options.", "Learning & Development: Tuition Reimbursement."]}]