[{"title": "Software Engineer"}, {"subtitle": "SOFTWARE ENGINEER", "body": ["Hi there! Have you noticed that the restaurant industry is changing?.", "We’re PAR and our purpose is:.", "To deliver solutions that connect people to the restaurants, meals and moments they love.", "We take that responsibility very seriously.", "As a leading provider of restaurant technology to the top restaurant brands in the world we’re calling all rebels, instigators, idealists and builders to join our constantly growing team.", " If you’ve excelled at every job you’ve held but always thought something was missing, please, read on.", "PAR invented the FIRST point of sale terminal over 40 years ago, yet we operate much like a start-up at the forefront of restaurant technology.", " PAR’s solutions are used to serve tens of millions of guests every day in over 120 countries.", " Our mission is to build the number one restaurant technology company in the world and we’re off to great start.", " We believe our customers want technology that is open and fast that enables their ability to innovate.", "We’re looking for people who are hungry to go beyond the idea of ‘just a job’.", " PAR’s not for everyone though: We work hard, and we really reward success.", " We push ourselves and each other to be better every day.", " We’re ferocious in battle but gentle in spirit.", " We’re hands-on people.", " We keep our room clean and make our bed because details matter.", " We believe it is better to be fast than big, and that being both is best.", " We believe diversity creates strong systems and communities.", " We experiment.", " Sometimes we break things, but we learn quickly.", " We’re honest and our intentions are good.", " And we always offer the last slice of dessert to our guests.", " We’ve got each other’s and our customers’ backs no matter what.", "We believe that our ambition is only limited by our ability to attract and retain great people; people who are up for the challenge to change the game with us! If it sounds like you belong here, we should meet!."]}, {"subtitle": "Position Description", "body": ["ParTech, Inc.", " is seeking a Software Engineer to join our Brink Point-of-Sale (POS) InStore software development team.", " This is a technical growth role.", " The ideal candidate will have solid foundation in software development with a passion for continuing to build upon that."]}, {"subtitle": "Why We Need You", "body": ["Design and implement solutions to requirements that are easily maintainable, deeply tested, and very high quality.", "Obtain a good level of understanding in areas of the product worked on.", "Work with the development and testing teams to ensure consistent, high quality deliveries.", "Continually strive for increased efficiency, maintainability, and quality.", "Perform peer design and code reviews and provide feedback on areas that need improvement.", "Assist in the technical and professional growth of team members.", "Take on additional responsibilities that might prove to be needed.", "Maintain highly cohesive and collaborative relationships with team members and other coworkers.", "Maintain a high degree of confidentiality concerning PAR’s and customer’s information."]}, {"subtitle": "What We’re Looking For", "body": ["Minimum of two (2) years of software development experience.", "Bachelors in Computer Science/Engineering or a related field, or equivalent experience.", "Familiarity and comfort with agile software development principles and practices.", "Fluency with C# and .", "NET.", "Familiarity with cloud computing platforms such as AWS or Azure a plus.", "Experience with unit testing frameworks and practices a plus.", "Experience with database systems.", "Experience with ASP.", "NET and/or WPF.", "Good debugging skills.", "Strong analysis skills and the ability to synthesize multiple perspectives.", "A pragmatic approach to solving problems with off-the-shelf tools.", "Strong written, oral and visual communication skills.", "Proactive communication style; ability to question, clarify and document.", "Self-starter who requires minimal supervision.", "Passionate about building next-generation technologies, enjoys fast-paced environments, and loves to code."]}]