[{"title": "Machine Learning Developer"}, {"subtitle": "Vancouver or Remote Anywhere in Canada", "body": ["PDFTron is an industry-leading provider of document processing technology that powers everything from traditional desktop software (like AutoCAD), to web apps (like DocuSign), and mobile apps (like Xodo).", " We are a fast-growing company, and have secured a $95M strategic growth investment just last year.", "With over 20 years of document engineering, we are actively changing the way people work with documents by being the SDK of choice for thousands of companies world-wide within virtually all industry verticals, powering solutions used by millions of users.", " Our Xodo app has over 15M installs and the highest (4.", "7 Stars) rating among PDF productivity apps.", "We foster an atmosphere of opportunity, growth, and success for every single individual amidst an exciting, challenging and entrepreneurial culture where career progression is based on merit, not tenure.", " Guided by a clear company vision, every member of our vibrant team is empowered to be a contributor, innovator and successful leader."]}, {"subtitle": "The Role", "body": ["We are looking for a talented and passionate deep-learning developer to join our team.", " You will use CNN (Convolutional Neural Networks) & Computer Vision tools in conjunction with our industry leading SDKs to develop next generation document understanding framework.", "PDFTron is going well beyond traditional OCR to recognize many higher-level semantic structures (such as tables, graphs, charts, etc).", " ."]}, {"subtitle": "Requirements", "body": ["A degree in computer science, computer/software engineering or equivalent.", "Masters or a PhD related to CNN or deep-learning or 2 – 5 years experience developing advanced commercial applications related to machine learning.", "Experience using TensorFlow, Torch, and other neural-networks toolkits.", "Experience designing efficient network & training architectures.", "Strong proficiency in C/C++ development, with additional experience with Python or JavaScript a plus.", "Strong mathematical analysis and problem solving abilities.", "Excellent interpersonal and communication skills, both written and verbal.", "Ability to work effectively on assignments through correct prioritization and management of tasks in order to ensure high-quality deliverables at each stage of the project.", "Comfortable working independently, as well as part of a fast-paced and collaborative team environment."]}, {"subtitle": "Benefits", "body": ["Competitive salary commensurate with experience & qualifications.", "A generous extended benefits package and stock option grant.", "A great team environment and resources, supporting you to do the best work of your life and providing unlimited career growth potential.", "Highly autonomous environment.", "Bi-weekly lunches and monthly socials (virtual for now).", "Unlimited personal development budget so you can master your craft.", "Excellent work-life balance.", "Diverse and inclusive workplace where we all learn from each other.", "Work remotely anywhere in Canada or in our convenient office location in downtown Vancouver, your choice!."]}]