[{"title": "IT Business Analyst"}, {"subtitle": "Key Responsibilities", "body": ["Responsible for translating high-level business requirements into detailed functional specifications and managing requests for changes to the specifications.", "Assists the business in determining which business requirements can and should be automated and how they are then integrated with other business and technical processes.", "Maintains functional peer relationships and detailed working knowledge of the assigned areas systems, organization, and business processes.", "Participate in requirements prioritization.", "Assist in the definition of project scope and success criteria.", "Perform project management tasks as needed.", "determine, assign, track and manage project tasks, documentation, issues, change requests, status, etc.", "Partner with development team to provide reporting and status on project deliverables.", "Coordinate and participate in Testing activities."]}, {"subtitle": "Criteria & Qualifications", "body": ["Degree in Information Systems, Computer Science or related technical discipline or equivalent.", "7-10 years of systems analysis, programming or other IT related experience.", "Complete understanding of the software development lifecycle.", "Strong interpersonal skills - Excellent written and oral communication skills.", "Outstanding problem-solving skills.", "Ability to translate technical information into terms understandable by non-IT savvy personnel.", "Adept at interacting in both business and IT focused discussions.", "Ability to influence and negotiate with clients and suppliers.", "Proficient at operating within a North Americanly distributed team.", "Advanced knowledge and experience with Microsoft Office products.", "Established in 1978, NES Global Talent provides a complete range of contract and permanent talent solutions to the Oil and Gas, Power, Construction and Infrastructure, Life Sciences, Manufacturing and IT sectors worldwide.", " With more than 40 offices in 28 countries, we are able to provide our clients with the engineering and technical expertise they need, wherever and whenever it is needed.", " Offering far more than a traditional recruitment service, we fully support our contractors while they are on assignment with everything from securing visas and work permits, to providing market leading benefits packages and accommodation, ensuring they are safely and compliantly able to support our clients."]}]