[{"title": "Data Scientist"}, {"subtitle": "Job Overview", "body": ["A newly created role within RBI, we are looking for an experienced data scientist to help us build a people analytics function.", " You will work closely with other People Analytics team members to develop new projects and provide support on defined projects that enhance RBI’s performance, productivity, and profitability through its people by conceptualizing analytical projects, mining, collecting and analyzing data, and providing actionable recommendations to guide the firm’s talent strategy across a wide variety of Talent topics including acquisition & mobility, leader/manager development, engagement, inclusiveness, individual/team performance, development, and exit.", "We already have a business intelligence unit within the people space and are not looking for someone to develop dashboards or conduct routine reporting.", " We want someone who can help us define how we can utilize machine learning and data science principles to provide actionable insights to senior leaders as it pertains to the people domain.", " There is buy in from senior leadership as to the importance of analytics in the people space, and while we have a broad idea of the principles we want to deploy, we are looking for someone who wants to help define the approach taken to data analytics.", " The position reports into the Lead, People Analytics and is a key contributor to achieving RBI’s long-term vision for best-in-class talent practices."]}, {"subtitle": "Responsibilities", "body": ["Play a key role in developing our advanced analytics and machine learning capabilities within the People space.", "Responsible for the building, training, scoring and monitoring of machine learning models to be used for People decisions in the areas of attraction / retention / development / rewards.", "Stay abreast and incorporate emerging trends from data science and technology research.", "Work closely with various stakeholders to understand business needs and develop solutions through machine learning or other advanced analytics/predictive modeling techniques.", "Leverage existing data sources, identify and mine data from new sources, identify opportunities for and execute primary data gathering efforts, and provide recommendations on scaling new methods more broadly.", "Recommend appropriate vendors / systems to work with to drive insights.", "Integrate multiple systems and data sets to build large and complex data sets and make them usable.", "Implement automated processes for efficiently producing scale models."]}, {"subtitle": "Some Applications Of This Methodology", "body": ["Assess employee engagement across the organization, perform analytics on drivers of engagement, and work with senior leadership to roll out engagement defining initiatives to improve overall employee engagement.", "Research, design, and implement analytical models and algorithms that will be utilized during talent assessment cycle and succession planning processes.", "Define data-driven characteristics of all roles within the organization; assists in identifying and placing existing talent to fill immediate and future needs of the organization."]}, {"subtitle": "Competencies", "body": ["Must be analytical with a quantitative mindset.", "Evaluates multiple relationships among components of a problem to recommend a sound course of action.", "Detects patterns in information in order to identify central and underlying causes of a problem.", "Identifies metrics by using multi-variable analysis through advanced technical tools.", "Develops and implements detailed work/project plans.", "Builds understanding by sharing tactical information with cross-functional teams/vendors and strengthens client relationships."]}, {"subtitle": "Qualifications", "body": ["MS or equivalent in Computer Science, Engineering, Statistics, Mathematics, or related technical field.", "Experience in developing machine-learning algorithms, statistical and mathematical optimization models, and simulation and visualization tools.", "Strong understanding of regression modeling, time series analysis, cluster analysis, machine-learning concepts such as supervised and unsupervised learning, classification, random forest, neural nets, etc.", "Ability to identify predictive attributes of data sets and perform feature engineering to improve machine learning results."]}]