[{"title": "Digital Data Scientist"}, {"subtitle": "Job Overview:", "body": ["Product Research and Development is looking for a Digital Data Scientist within Analytical Sciences (Toronto / Swiftwater) to help drive the successful deployments of new innovative digital solutions (e.", "g.", " LIMS, electronic lab notebook, ERP etc.", ") within bioprocessing and analytics.", " This position is responsible for implementing new digital systems within Toronto / Swiftwater that are aligned with global strategies, and to support the current testing requirements within the Analytical Sciences.", " The Digital Data Scientist is also a key R&D LIMS administrator for supporting the use of the LIMS system to meet project timelines and regulatory requirements.", " This includes LIMS master data management, LIMS process improvements, and to collaborate with other global LIMS administrators to ensure global alignment.", " This role will also develop and validate computational tools for analyzing big data (e.", "g.", " high-throughput sequencing data) demonstrating the application of digital science."]}, {"subtitle": "Responsibilities:", "body": ["Provide scientific expertise within PRD and Analytical Sciences to support data science / digital transformation initiatives relating to pharmaceutical data mining, data modeling, big data acquisition, and data structure.", "Provide key knowledge and technical support of electronic systems (especially LIMS, scientific data management, data science, e-biobank etc.", ") to Analytical Sciences.", " This potentially includes master data management process relating to LIMS and other LIMS administrator activities (including but not limited to updating and approvals of sample plans, configurations and specifications).", "Support and diagnose LIMS incidents, provide management and timely resolution of technical incidents.", "Provide input/direction to process improvement and harmonization initiatives for analytical electronic system (e.", "g.", ": LIMS life cycle management, transversal ERP systems, data science) through local and global working groups and initiatives.", "Develop, implement and validate cloud computing for big data analysis within Analytical Sciences."]}, {"subtitle": "Requirements & Qualifications:", "body": ["Doctoral Degree (with a minimum of 2 years of experience) or Master Degree (with a minimum of 5 years of experience) or Bachelor Degree (with a minimum of 10 years of experience) in Computer Science, Informatics (Data Science or related discipline), Science/Life Sciences (Molecular Biology, Microbiology, Biochemistry, Immunology, Bioinformatics or related discipline).", "Experience implementing digital systems (e.", "g.", " LIMS, data management, electronic lab notebook, etc.", ") and familiarity with pharmaceutical data structure.", "Experience in use and administration of a commercial LIMS (specific experience with LabWare LIMS is preferred.", ").", "Software development for biological data analysis and familiar with cloud computing (experience with genomics / computation biology data analysis is preferred.", ").", "Experience with computerization system validation and 21CFR part 11 / EudraLex Annex 11 requirements including system testing, validation, and data management.", "Experience in writing development reports, standard operating procedures, qualification plans and validation reports.", "Excellent written and verbal communications, organization and teamwork are required."]}, {"subtitle": "Terms of Employment:", "body": ["This is an independent scientist position within the Analytical Sciences (Toronto / Swiftwater) - Molecular Biology Centre.", " Some travel might be required (US, Global) and the frequency is dependent on the project needs."]}, {"subtitle": "What makes this position unique?", "body": ["Sanofi Pasteur Product Research and Development and Analytical Sciences (Toronto / Swiftwater) is looking for a Digital Data Scientist to join our dynamic, fast-paced environment where analytical electronic systems are a mission-critical application for the business.", " The position will collaborate across functions and sites to simplify and implement data science / digital solutions within PRD and provides support as necessary for regulatory submissions.", " This role will also help advanced the application of digital science by supporting the development and validation of computational tools used for big data analysis."]}, {"subtitle": "Benefits of working in this role:", "body": ["This position is a key strategic role in decision making for offers the opportunity to collaborate between different functions, sites and senior management to promote the implementation of data science / digital solutions within PRD.", " This role is recognized as a key position in make decisions in the areas of master data management and incidents related to LIMS and is fundamental to the success of all testing within the Analytical Sciences platforms and product release data to support the on-time release of clinical trial material."]}]