[{"title": "Data Scientist"}, {"subtitle": "about us", "body": ["Reporting to the Manager of Data Science, the Data Scientist at RACE21™ brings deep understanding of big data and helps in building and enabling big data analytics solutions.", "They apply complex and most current modelling techniques to existing data sets in order to find optimization and / or improvement opportunities relevant to the context of the product being developed and business problem(s) at hand."]}, {"subtitle": "Responsibilities", "body": ["Be a courageous safety leader, adhere to and sponsor safety and environmental rules and procedures.", "Designs, develops, and implements end-to-end cloud-based machine learning production pipelines (data exploration, sampling, training data generation, feature engineering, model building, and performance evaluation).", "Collects, parses, manages, analyzes and visualizes large sets of data using multiple platforms.", "Identifies opportunities across business operations to reduce cost, improve safety, sustainability, and efficiency.", "Extracts and visualizes insights from the available data sets and provides reports and guidelines for improving operations.", "Prepares documentations of the models, designs and techniques for data and product development teams.", "Translates complex functional and technical requirements into detailed architecture, design, and high performing software.", "Codes, tests, and documents new or modified data systems to create robust and scalable applications for data analytics.", "Ensures all automated processes preserve data by managing the alignment of data availability and integration processes.", "Works with fellow Data Scientists and Engineers to ensure that all data solutions are consistent.", "Ability to architect highly scalable distributed systems using different tools (considered an asset, but not required).", "Develops standards and processes for integration projects and initiatives.", "Is prepared to communicate data science insights to internal clients and stakeholders."]}, {"subtitle": "Qualifications", "body": ["Master’s or PhD Degree in Information Technology, Computer Science, or a related quantitative discipline (preferred but not required).", "A minimum of 3 years’ experience in data science.", "Proficient in Python for data processing, statistical analysis, machine learning and visualization and skilled in writing SQL queries.", "Experienced in applied data science within business operations and industry environments.", "Familiar with data modeling and different data structures and algorithms.", "Experienced as a Data Scientist within an Agile team or other rapid development methods and environments (preferred but not required).", "Excellent problem solving, critical thinking, and communication skills.", "Experience in developing presentations and communications to be shared with internal and external stakeholders.", "Brings a high energy and a passionate outlook to the role and can influence those around them in a collaborative and informative manner.", "Able to build a sense of trust and rapport that creates a comfortable & effective workplace.", "Knowledge of simulation and optimization techniques is (considered an asset but not required)."]}]