[{"title": "Programmer "}, {"subtitle": "about us", "body": ["Do you love helping Artists, Technical Artists and Animators unlock their full potential by building the pipelines of their dreams? Can you turn HLSL and C++ into breathtaking visual experiences that players will never forget?.", "Our team is seeking an experienced Graphics Programmer who is comfortable working with the Unreal Engine.", " This position will involve working with both the art team and fellow programmers to deliver the technology necessary to realize the ambitious visual identity of Homeworld 3.", " The ideal candidate will have a passion for empowering teammates and sharing in the creative process.", " They should also have a broader interest in contributing to performance, scalability, development practices, as well as code quality and reliability."]}, {"subtitle": "Responsibilities", "body": ["Drive the visual technology of the game with a focus on AAA quality.", "Be responsible for performance across a wide range of hardware.", "Work closely with the Art Director to ensure their vision is achieved."]}, {"subtitle": "Requirements", "body": ["A minimum of 3 years experience on at least one shipped title.", "A degree in computer science, related field, or equivalent experience.", "Strong C++ and Shader/Material skills.", "Strong critical thinking and problem-solving skills.", "Unreal Engine experience.", "Passion for graphics programming and algorithms / mathematics (linear algebra, trigonometry).", "Good understanding of game content pipeline and tools.", "Strong ability to collaborate with technical and non-technical teammates.", "Self-motivated and a great teammate willing to pitch in on many areas of development.", "Pluses.", "Familiarity with rendering techniques, shaders and graphics hardware.", "Experience with particle / effects systems."]}, {"subtitle": "At Blackbird", "body": ["we're all about being true to our roots.", " We started small in our CEO's garage, and even though we're expanding, our desire is to stick to that foundation of creativity, community, and collaboration.", " Our team has proved that great ideas can come from any position in any discipline, so it's important to us to make sure every voice is heard.", "Work/life balance is extremely important to us, and we've demonstrated that over the years by severely limiting over-time requirements.", " We want people to be happy about coming to work every day, and to that end we offer lots of opportunities for growth and development; whether it's lunch and learns, team events, or our generous vacation days, paid holiday closure and flexible schedules.", " We also try to provide every opportunity possible for our employees to spearhead R&D initiatives through our BlackOps program.", " In short, don't expect to feel like a cog in a machine working for BBI."]}]