[{"title": "Technical Support Specialist"}, {"subtitle": "description", "body": ["If you are a motivated, energetic and challenge driven individual who is eager to succeed, then imagine a career with us.", " PAL Aerospace is a leader in international aerospace and defense design, development and operation of airborne surveillance aircraft and software.", " We provide a wide range of aviation and related services to domestic and international markets.", " PAL Aerospace is currently looking for a Technical Support Specialist at our St.", " John’s, NL base.", " We are seeking enthusiastic applicants who are interested in joining special mission operations supporting aerial maritime surveillance on King Air and Dash 8 aircraft; specific on-the-job training will be provided."]}, {"subtitle": "Duties and Responsibilities:", "body": ["Assist in the writing of final user, system, and program documentation in order to facilitate system use and future modifications.", "Test and debug computer programs in order to ensure application operates correctly and meets user requirements.", "Maintain existing systems and respond to problems in order to ensure programs remain effective.", "Sensor Equipment Documentation, Configuration, Troubleshooting and Testing (FLIR, RADAR, SATCOM, AIS).", "Inspection, Processing and Q/A of all digital multimedia and related equipment.", "Act as a liaison between flight crew and Help Desk to ensure timely resolution of technical issues within the division relating to flight operations.", "Installation, Configuration and Support of:.", "System Server and Client Hardware.", "Aircraft Mission System Hardware and Software.", "Various client software applications used throughout the organization.", "Participate in Sensor Operator training to be able to troubleshoot and operate sensor equipment such as airborne maritime radar on a casual/as required basis.", "Travel within Canada and internationally for system implementation and support as required.", "Other duties as assigned."]}, {"subtitle": "Qualifications:", "body": ["Diploma Computer Science or related field with relevant experience.", "Minimum 2 years’ experience troubleshooting complex systems.", "Must have experience troubleshooting with SQL 2008 and above databases.", "Experience using networking and Windows Operating systems.", "Must be able to work in a fast-paced, dynamic team environment.", "Must be flexible and able to travel with aircraft on short notice.", "Must be available for on-call support as required.", "Strong interpersonal skills and ability to effectively communicate.", "Experience with Photoshop and photo editing would be considered an asset.", "Must be able to obtain the required security.", "Ability to perform during extended long-range missions.", "Must possess valid passport."]}]