[{"title": "Software Engineer"}, {"subtitle": "Overview", "body": ["We're looking for Software Engineers with experience building scalable applications and systems to join our fast moving team in Toronto.", "Software Engineers at Instacart work on a wide range of interesting and challenging problems at scale, from supporting thousands of concurrent shoppers and processing millions of data points in real-time, to building tools for ad campaigns and sign-ups.", "At Instacart, you will work on features that define our industry in an open and collaborative environment serving millions of requests daily!.", "We love Software Engineers who are capable of building a solution and owning problems end-to-end.", " There is a tremendous amount of opportunity in front of us, and joining our team at Instacart gives you a chance to grow your career and interests, as we succeed together!."]}, {"subtitle": "About The Job", "body": ["You will be part of a team with a large amount of ownership, responsibility and autonomy.", "You will work closely with Senior Engineers, Product Managers, other teams, and internal/external stakeholders, owning a large part of the process from understanding a problem to shipping the solution.", "You will ship high quality, scalable and robust solutions with a sense of urgency.", "You will have the freedom to suggest and drive organization-wide initiatives.", "Instacart's technology is constantly changing and adapting.", " Some of the technologies you will use at Instacart include:.", "React.", "Ruby.", "Python.", "Postgres.", "Snowflake.", "Cypress.", "And many others yet to come.", "If you have experience with these technologies, you will have the opportunity to dive deeper.", " If you haven't used some of these technologies, you’ll have the chance to learn from the collective experience of our team."]}, {"subtitle": "About You", "body": ["Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering or equivalent.", "1+ years of working experience as a Software Engineer.", "Self-motivated & enjoy working in a fast paced environment.", "Possess a strong sense of ownership.", "Thrive in a collaborative team environment.", "Excited by a strong career growth opportunity.", "Excited to adopt new technologies & skills."]}]