[{"title": "Software Engineer"}, {"subtitle": "Job Description", "body": ["Come and join us! Intel is seeking highly qualified candidates to join the BXD (Barefoot Switching Division) in our Data Platform Group (DPG) as a Software Development Engineer! We're part of the Connectivity Group (CG) inside Intel's DPG, and we're looking for motivated, passionate and talented engineers to join our software team.", " We're a strong, vibrant cross-site team which.", "helps drive Intel's programmable switching technology and products to position Tofino as the switching platform of choice and for the Cloud and Data Center network deployments.", "develops switching technologies and software use in integrated system and processors.", "In this position you will gain invaluable experience which will allow growth and expanded opportunities within this business group as well as future possible opportunities with other business groups within Intel."]}, {"subtitle": "Responsibilities Will Include, But Are Not Limited To", "body": ["Participate in the development of software related the latest switches.", "Implement new software features required to support customer use cases.", "Add tests to the test suites used to validate the software managing the switches.", "Develop sample codes representing expected/standard use cases.", "Develop P4 code to fill the customer needs.", "The ideal candidate will have the following skills in addition to the qualifications listed below.", "Must be a team player, with a demonstrated knowledge to technically influence others.", "Strong Problem-Solving skills.", "Excellent verbal and written communication skills.", "The Data Platform Group (DPG) drives new products technologies from high-end co-processors for supercomputers to low-energy systems for enterprise and the cloud, as well as solutions for big data and intelligent devices.", " The group is a worldwide organization that develops the products and technologies that power 9 of every 10 servers sold worldwide."]}, {"subtitle": "Qualifications", "body": ["Minimum Required Qualifications:.", "Bachelor's Degree In Computer Science Or Electrical Engineering And.", "4+ years experience in C.", "4+ years experience in development under Linux or Unix.", "4+ years experience in networking: Ethernet/TCP/IP protocols and networking hardware."]}, {"subtitle": "Additional Preferred Qualifications", "body": ["2+ years experience with Git.", "2+ years of experience in C++ and/or Python experience.", "2+ years of experience Google test framework and/or Google mock.", "2+ years of experience with Apache Thrift.", "2+ years of experience in Switching SW development.", "1+ years of experience P4 programming.", "1+ years of experience in Project leadership and technical leadership experience."]}, {"subtitle": "Inside this Business Group", "body": ["The Data Center Group (DCG) is at the heart of Intel’s transformation from a PC company to a company that runs the cloud and billions of smart, connected computing devices.", " The data center is the underpinning for every data-driven service, from artificial intelligence to 5G to high-performance computing, and DCG delivers the products and technologies—spanning software, processors, storage, I/O, and networking solutions—that fuel cloud, communications, enterprise, and government data centers around the world."]}]