[{"title": "Software Engineer"}, {"subtitle": "description", "body": ["Grammarly is continuing to grow our team during the COVID-19 pandemic, conducting fully remote hiring and onboarding processes.", " All Grammarly team members can work remotely until August 2021.", " Read more about how we’re supporting our team and communities.", " The opportunity.", "Grammarly empowers people to thrive and connect, whenever and wherever they communicate.", " 30 million people around the world use our AI-powered writing assistant every day.", " All of this begins with our team collaborating in a values-driven and learning-oriented environment.", "To achieve our ambitious goals, we’re looking for an experienced Back-End Engineer to join the Engineering team for Grammarly Business.", " The brand-new Grammarly Business team is building solutions for small business and enterprise customers to bring the power of Grammarly to all their employees.", " This role will work on a wide range of projects, from user features to complex back-end integrations.", " We are currently working on improvements to onboarding, SSO for enterprise customers, customization features, and much more.", " Join us in building up a product offering that will help everyone write and communicate more effectively in the workplace.", "Grammarly’s engineers and researchers have the freedom to innovate and uncover breakthroughs—and, in turn, influence our product roadmap.", " The complexity of our technical challenges is growing rapidly as we scale our interfaces, algorithms, and infrastructure.", " Read more about our stack or hear from our team on our technical blog ."]}, {"subtitle": "As a Back-End Engineer And An Early Member Of This Team, You Will", "body": ["Grammarly Business is a fast-growing team and company priority in 2020.", " There will be many opportunities for growth and ownership as we move fast to build solutions for businesses and their employees.", "Play a critical role in building core parts of the Grammarly Business product offering and core infrastructure.", "Have the unique opportunity to help build the Grammarly Business engineering team from the ground up.", " This includes interviewing and mentoring new team members.", "Create an engineering culture with a strong emphasis on documentation, testing, and user experience.", "Move fast to support enterprise customers and new features on our roadmap.", "Build services in Java and collaborate with other engineering teams to work across Grammarly’s platform.", "Build and support production services with high call rates and target high availability for enterprise customers.", "Introduce new technologies and internal tools to help us build features faster.", "Work on compliance and data privacy.", "Have the opportunity to work with front-end technologies.", "Work on projects that directly impact key business metrics."]}, {"subtitle": "We’re looking for someone who", "body": ["Embodies our EAGER values—is ethical, adaptable, gritty, empathetic, and remarkable.", "Has 6+ years of experience working in a highly scalable consumer product or enterprise SaaS environment.", " (Java experience is a huge plus.", ").", "Has exceptional knowledge in computer science fundamentals, algorithms, and data structures.", "Can use modern back-end technologies to develop vertical-specific, highly trafficked services.", "Has experience working on fast-paced teams.", "Knows how to build complex systems on top of AWS infrastructure.", "Cares about the end-user experience and strives to ensure high quality."]}, {"subtitle": "Support for you, professionally and personally", "body": ["Professional growth : We hire people we trust, and we give team members autonomy to do their best work.", " We also support professional development with training, coaching, and regular feedback.", "A connected team : Grammarly builds a product that helps people connect, and we apply this mindset to our own team.", " We have a highly collaborative culture supported by our EAGER values.", " We also take time to celebrate our colleagues and accomplishments with global, local, and team-specific events and programs.", "Comprehensive benefits : Grammarly offers all team members competitive pay along with a benefits package that includes superior health care.", " We also offer ample and defined time off, catered lunches, gym and recreation stipends, admission discounts, and more."]}, {"subtitle": "We encourage you to apply", "body": ["At Grammarly, we value our differences, and we encourage all—especially those whose identities are traditionally underrepresented in tech organizations—to apply.", " We do not discriminate on the basis of ancestry, race, place of origin, political belief, religion, marital status, family status, physical or mental disability, sex, sexual orientation, gender identity or expression, age, or any other characteristic protected by law.", " Grammarly is an equal opportunity employer and abides by the Employment Equity Act."]}]