[{"title": "Data Scientist"}, {"subtitle": "Join our team", "body": ["We’re a customer-driven and product-minded team within TELUS, responsible for our company’s digital evolution.", " We simplify the path to production so teams can focus on what matters most.", "TELUS Digital’s mission is to make life easier for millions of customers – and for our team.", " We build smart, customer-centric and data-driven experiences for telus.", "com, TELUS.", "com/business and the My TELUS app.", "Our team includes a passionate group of strategists, UX and visual designers, full stack developers, content managers, scrum masters, testers, product owners, people experience specialists, and other digital experts.", "Our team members are leaders in local and global technology communities, we value and support communities such as: Tech Masters, NodeSchool, Ladies Learning Code, Women Who Code TO and many more!."]}, {"subtitle": "Here’s the impact you’ll make and what we’ll accomplish together", "body": ["My TELUS has a big impact on how our customers' experience, manage and interact with their TELUS services.", " We’re at the centre of all the action working to exceed the needs of our customers, stakeholders and broader digital team.", " As risk takers and experts in our fields, we’re a team who celebrates our failures and successes equally.", " Change is embraced and we love to try out new ideas.", " We are passionate about learning, growing and developing as individuals and as a team.", "As a data scientist with TELUS Digital, you will be responsible for supporting the My TELUS insights team with various data solutions and products.", " These solutions will empower our business analysts with insights about our customer journeys across multiple channels and help move forward our journey of creating the best possible customer experience.", " You will be working with data from various online and offline experiences in order to paint a complete picture of the journey.", "You will work as part of a friendly, cross-disciplinary, and agile team who helps each other tackle problems across all functions.", " As a custodian of customer trust, you will employ the best methodologies in development, security, accessibility and design to achieve the highest quality of service for our customers."]}, {"subtitle": "Here’s How", "body": ["Understand business needs and apply data science techniques to address real-world problems.", "Analyze source data (including structured and unstructured data), cleanse data, and support the building of data pipelines.", "Ensure data privacy is respected.", "Use visualization techniques to communicate findings and explain models.", "Collaborate with our data scientists within Telus."]}, {"subtitle": "You're the missing piece of the puzzle", "body": ["Education in computer science, engineering, mathematics, or a related field.", "Ability to communicate technical and complex concepts in a way that is understood by non-technical audiences.", "Interpersonal and communication skills to enable collaboration with a range of team members with diverse skill sets and backgrounds.", "The ability to quickly familiarize yourself with new languages, tools, frameworks, and to stay informed on developments in ML techniques and technologies.", "Advanced knowledge in SQL.", "Dedication to ensuring your work is well documented and version controlled.", "Experience using Cloud infrastructure like Google Cloud Platform and Amazon Web Services.", "Experience with agile methodology and team-based software development workflows.", "G-Suite experience."]}, {"subtitle": "Who is TELUS?", "body": ["We're a high-performing team of individuals who collectively make TELUS one of the leading telecommunications companies in Canada.", " Our competitive consumer offerings include wireline, wireless, internet and Optik TV™.", " We also deliver a compelling range of products and services for small, medium and large businesses; and have carved out a leadership position in the health, energy, finance and public sector markets with innovative industry specific solutions.", "Everyone belongs at TELUS.", " It doesn’t matter who you are, what you do or how you do it, at TELUS, your unique contribution and talents will be valued and respected.", " Because the more diverse perspectives we have the more likely we are to crack the code on what our customers want and our communities need."]}]