[{"title": "Junior Game Developer"}, {"subtitle": "description", "body": ["Prodigy Education connects students, parents, teachers and school districts with resources that promote a lifelong love of learning.", " Anyone with an internet connection is welcome to create a free account and try the most effective and engaging K-8 math platform in the world.", " Our business model helps us connect with youth around the world, with over 100 million students now voluntarily practicing math every single day — and enjoying it!.", "At Prodigy Education, we have an incredible team that works tirelessly to turn our goal of making education a human right into a reality.", " We are immensely grateful for our amazing team and all they do every day.", " We welcome people who share our passion to join our team, where you will have the opportunity to help an entire generation of students to LOVE learning.", "Our passion is our mission - to help every student in the world love learning!.", "Please note: During the Covid-19 pandemic, in order to keep all our candidates safe, Prodigy is hiring and on-boarding 100% remotely for the time being."]}, {"subtitle": "Overview", "body": ["Prodigy’s online game has grown from a small-scale application to a widely-used educational MMO, and we need talented developers to help us to continue to grow.", " As a game developer at Prodigy, you will be focused on the creation of new features, tools and content, working alongside like-minded developers, artists and designers.", " The work you do here at Prodigy is not only seen by millions of students, but will aid in the educational advancement of students worldwide."]}, {"subtitle": "Your Impact", "body": ["Design, develop and maintain core systems, including gameplay features, internal tools, and frameworks.", "Work closely with our game designers, artists and QA to ensure a polished and fun gameplay experience.", "Maintain our asset library and pipelines, serving thousands of images, audio files and more.", "Collaborate with the rest of the team in planning sessions, designing new features and content."]}, {"subtitle": "Who You Are", "body": ["Advanced knowledge of object oriented principles and practices.", "Strong foundation in both scripting and strongly-typed object oriented languages (e.", "g.", " Javascript / TypeScript / Lua / C# / C++).", "Understanding of memory management practices.", "Great debugging abilities and strong algorithmic analysis skills.", "Solid foundation in Computer Science, Software Engineering or similar university programs or experience.", "Games industry experience, especially with web/mobile games.", " 3+ years of experience as a developer.", "Absolute passion for gaming and game development."]}, {"subtitle": "Bonus Points For", "body": ["Experience with JavaScript or TypeScript.", "Experience with React, Node.", "js, or Express.", "Experience with HTML5 game engines.", "Published or in-progress mobile apps, web games, etc.", "Background in interface design and user-driven UI design.", "Experience with analytics and A/B testing methods.", "Experience with agile development methodologies."]}, {"subtitle": "What We Offer", "body": ["The opportunity to build a career of value and witness first hand the impact Prodigy has as the most engaging math platform in the world!.", "A culture of transparency, where team members are involved in important conversations.", "No micromanaging here! We believe in our employees skills and abilities, we encourage you to bring new innovative ideas to your team.", "Full health benefits from day one (1) for you and your family, fully covered! Nothing is ever taken off your pay cheque.", "We are a profitable company, with eligibility to participate in stock options for all employees.", "Late or early riser? We understand! We offer flexible working hours that allow you to schedule your 8 hour day with a bit more flexibility.", " We do have core office hours, to ensure team members can be present for important meetings and department needs.", " Our core office hours are 10:30am - 3:00pm."]}, {"subtitle": "We Are Offering a Number Of Remote-friendly Activities Such As", "body": ["While we operate 100% remotely for the time being, our company culture and values remain at the core of everything we do.", "Virtual trivia.", "Zoom meditation, stretching, and fitness sessions.", "Daily remote challenges via Slack.", "Virtual “Prodigy Prepares” cooking series featuring our very own employees!.", "Remote work employee budget for things like home office equipment etc.", "We’d love to still provide you with a glimpse into what our in-office experiences look like below:.", "Feel like a different work environment? Work from home 1x a week!.", "Team building events that not only include you as a Prodigy employee, but your significant other and children as well.", "Company pizza lunch every second week for ‘All Hands’, where we discuss important Prodigy milestones.", "Do you need some fun to help break up your day? We have that covered! Join in some Ping Pong games, Smash Bros competitions or board games!.", "We are an equal opportunity employer and are committed to providing employment accommodation in accordance with the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act, 2005 (AODA).", " Prodigy Game will provide accommodations to job applicants with disabilities throughout the recruitment process.", " If you require an accommodation, please notify us and we will work with you to meet your needs."]}]