[{"title": "IT Application"}, {"subtitle": "16 Month Internship", "body": ["Celestica (NYSE, TSX: CLS) is a US$5.", "8 billion global leader in design, manufacturing, hardware platform and supply chain solutions.", " We bring global expertise and insight at every stage of product development - from the drawing board to full-scale production and after-market services.", " Through our unrivalled customer-centric approach, we partner with leading companies in aerospace and defense, communications, enterprise, healthtech, industrial, capital equipment, and smart energy to deliver solutions for their most complex challenges.", "Celestica is a high-integrity work environment and when you join Celestica you are apart of a leading global company that enables the world’s best brands, and contributing to our innovative and collaborative solutions that help our customers unlock the potential of the future.", "Our global network spans 14 countries with 24,500 employees across the Americas, Europe and Asia.", " At our Toronto headquarters, we are focused on attracting top talent into our organization, including interns from universities and colleges throughout Southern Ontario.", "Celestica's internship program provides students with valuable development through real-life work experience, exciting projects and networking with industry professionals."]}, {"subtitle": "Benefits For Students Include", "body": ["Experience working for one of the largest Canadian global technology companies.", "Possibility of a student casual contract position after completion of internship.", "Possibility of a full-time position after completion of degree.", "Access to Celestica’s development programs and projects.", "Celestica's Time Off to Volunteer program – two paid days off to volunteer per year.", "Fun intern activities including celebration events and networking.", "Internal recognition programs and rewards for stellar performance."]}, {"subtitle": "What’s in it for you?", "body": ["Opportunity: Job experience at a large Canadian-based global company.", "Innovation: We look to our employees to implement new ideas and improve the way we do things.", "Collaboration: Students work as part of global teams, enabled by collaborative technology.", "Sustainability: We uphold strong ethics, reduce our impact on the environment and empower employees to give back to the community with two paid days off per year to volunteer.", "Development opportunities: including soft skills courses, innovation projects and mentorship.", "Networking: Strategically build your professional network to advance your career and deepen relationships across your peers and colleagues.", "Fun: Our interns have the opportunity to participate in fun activities including intern social events, Celestica’s charitable initiatives and our Spirit Week activities."]}, {"subtitle": "About This Opportunity", "body": ["The IT Application Intern will work on the Corporate IT Engineering team in developing and deploying strategic solutions to the entire Operations Network."]}, {"subtitle": "Preferred Skills", "body": ["Some degree of development experience with any of the following would be considered an asset: C# .", "NET4.", "0 or higher, C, C++, Azure, .", "NET Core, MVC Design Pattern, SQL Server, Oracle DB.", "Some degree of development experience with any of the following would be considered a bonus: TCL, Python, Mongo DB, NoSQL, Powershell, Network Basics.", "Some degree of interfacing software with external (hardware) systems: Other software solutions, Raspberry Pi, Arduino, Beaglebone.", "Basic knowledge of software development lifecycle concepts.", "Strong analytical and problem-solving skills.", "Desire to make a difference."]}, {"subtitle": "Activities", "body": ["Involvement in the design/development/support of new and existing applications (both on premise and cloud platforms).", "Assisting in the gathering of requirements for new applications- includes collecting and analyzing existing documentation, reviewing with Subject Matter Experts & writing specification documents.", "Perform routine management/support/reporting tasks as they relate to applications (both out of the box and custom development) under our control.", "Working with other team(s) in system troubleshooting of the application problems.", "Ability to “figure out” and research problems independently, and come up with viable solution(s) that work within our landscape.", "Testing of new releases of the application for production environment."]}, {"subtitle": "Communication Skills", "body": ["Good oral and written communication skills.", "Able to work with users around the globe and discern what are their concerns /requirements."]}, {"subtitle": "Certification", "body": ["Will need to pass CGP certification."]}, {"subtitle": "Education: Currently enrolled in a University Internship program completing 3rd year of a 4 year program. Electrical / Computer Engineering (Preferred) or Computer Science Degree Program. Please provide a copy of your transcript with your application.", "body": ["As this position involves work that is subject to the Canadian Government's Controlled Goods Program (CGP), your employment offer is conditional upon the successful completion of a security assessment by Celestica and/or its authorized agents, per the Controlled Goods Regulations.", " Candidates MUST be either a Canadian citizen or permanent resident of Canada.", "At Celestica, we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported.", " Accommodations are available on request for candidates throughout the hiring process.", " If you require an accommodation, we will work with you to meet your needs."]}, {"subtitle": "Company Overview", "body": ["Celestica (NYSE, TSX: CLS) is a US$5.", "8 billion global leader in the delivery of end-to-end product lifecycle solutions.", " Our customers trust us to deliver the most advanced design, engineering and manufacturing expertise for their highly sophisticated and complex products.", " From advanced medical devices, to highly engineered aviation systems, to next-generation hardware solutions for the Cloud, at Celestica we manage the complexity for our customers and set the bar for quality and reliability in their markets.", " Our customer portfolio includes leaders in the enterprise computing, communications, aerospace and defense, industrial, smart energy, healthtech and semiconductor markets.", " Headquartered in Toronto, our global network spans 14 countries with 24,500 employees throughout the Americas, Europe and Asia.", "Seniority Level.", "Internship.", "Industry.", "Information Technology & Services  Human Resources  Financial Services.", "Employment Type.", "Temporary.", "Job Functions."]}]