[{"title": "Machine Learning Engineer"}, {"subtitle": "description", "body": ["Sensibill is lighting up the FinTech industry with mobile solutions that change the way people interact with their purchases and enable corporations to make critical insights.", " We are looking to expand our Research & Innovation team with a Senior Machine Learning Engineer to help us drive next-generation improvements to our receipt processing engine.", "We need a Senior Machine Learning Engineer who is simultaneously experienced and inquisitive.", " Someone who has the expertise and knowledge to design and structure experiments, and who knows how to tune and adjust the plan based on the results.", " We need a Senior Machine Learning Engineer who can work with multiple layers of abstraction, from deep in the weeds to identifying cross-cutting patterns and the applications to other work … and who wants to do it in an energetic, start-up environment at the cutting edge of the #fintech industry."]}, {"subtitle": "As our new Senior Machine Learning Engineer, you will:", "body": ["Design core components of our machine learning software stack.", "Quickly build, test, measure and repeat.", "Continually improve the accuracy and performance of our receipt processing engine and underlying machine learning models.", "Strike a balance between fast and flawless - recognize which pieces need the extra polish before they go in the wild, and which can be prototyped quickly and thrown away.", "Maintain the training environment in which the output datasets are created and accessed by the supervised machine learning system.", "Actively engage with the data research team who steward the input and output datasets, guiding them to source the right data to support your code.", "Research new network architectures, data structures, algorithms and techniques, and strategize on which to pursue given corporate needs."]}, {"subtitle": "Now a bit about you:", "body": ["A seasoned developer, first and foremost.", " You have 3-5 years of experience writing code and would have no hesitation with debugging an external library or extending its functionality if it was more efficient than building from scratch.", "Productive.", " You’d rather quickly whip out a script to answer a question in the data than manually wade through a messy dataset, and you’re eager to see the results from your experiments to determine what to tune next.", "Focused on outcomes.", " You adapt to change, solicit input from others, and adopt the best ideas irrespective of their source.", " It’s not about being right at the beginning, but about following a structured process to get to the right answer.", "Data-driven.", " Your intuition may guide you to test a hypothesis, but you look to the results of properly structured experiments to reach conclusions and inform next steps.", "Creative yet organized.", " Coming up with new ideas to test is second nature to you, but you’re still able to build a viable plan that fits in a larger context, and that you and the team can deliver on.", "Driven.", " You stretch yourself and those around you to do excellent work, and motivate others to do their best work, or help them to get unblocked when encountering an obstacle."]}, {"subtitle": "And this is what you'll have:", "body": ["﻿.", "A relevant post-secondary degree in Computer Science or Engineering, with a focus on machine learning.", " A Masters or PhD is considered an asset.", "At least two years of work experience using CNN’s and LSTM’s.", "Working experience with Python and deep learning frameworks, such as PyTorch or TensorFlow.", "Experience on projects that use modern machine learning techniques to solve real-world problems.", "The ability to lead and mentor a team of developers and researchers to quickly build and test.", "A near-fanatical zeal for hitting performance targets related to speed and accuracy.", " ."]}, {"subtitle": "Why should you join Sensibill?", "body": ["We love pie.", " We are fun.", " We are guided by conscientiousness.", "Our culture is like that perfect piece of pie; humble and delivers exactly what you expect.", " Why pie? That’s our acronym.", " We are all about passion, integrity, and excellence.", " We like to have fun, and share the love.", " So for your birthday, we will treat you to your favourite pie.", " Actually, we get a few of them so we can celebrate together.", "Joining a start-up in the early days is pretty much the greatest adventure you can go on.", " We are lean, we are smart, we are fun, and we live for balance – there are no mandatory 60-hour weeks here.", " This is not a top-down culture.", " We want everyone’s input during critical decisions.", " To that end, if you have ideas, we want to hear them.", " Together we can build out and shape not just your role and your team, but our company.", " We want new core team members who want to invest in us the way we invest in them.", " We want your ideas, your energy, your skills, your dedication, and if you have any, we’ll take your #receipts too."]}]