[{"title": "Software Engineer"}, {"subtitle": "What does GetQuorum do?", "body": ["GetQuorum is a Toronto-based technology company that provides an electronic voting and virtual Annual General Meeting platform-as-a-service tailored to the condominium markets in Ontario, Florida and North America.", " We also have a rapidly growing customer segment of not-for-profits, member associations, regulatory bodies, corporate shareholder and other organizations outside of the condominium and HOA space.", " We help our clients host successful Annual General Meetings, gather proxies and electronic votes, pass bylaws, and reduce meeting package distribution costs.", " Since the outbreak of COVID-19, GetQuorum has begun offering hosted virtual annual general meetings as a turnkey service in addition to our core offering of advance voting.", "GetQuorum is proud to be alumni of Ryerson University’s Legal Innovation Zone (LIZ) and a current Growth Stage member of the MaRS FinTech portfolio.", " GetQuorum represents nearly 1000 clients and is growing daily.", " We anticipate strong growth in 2021 based on our 2020 successes and opportunities internationally.", " We need to grow our team to support all of our incoming business.", "The ideal candidate will be responsible for developing high-quality applications.", " They will also be responsible for designing and implementing testable and scalable code.", " ."]}, {"subtitle": "Software Developer, you will be responsible for:", "body": ["Developing tools and new features for the GetQuorum platform.", "Implementing, executing, and supporting GetQuorum campaigns for clients.", "Support, maintenance, and optimizations of existing GetQuorum platform processes."]}, {"subtitle": "About our tech:", "body": ["Modern JavaScript front to back (RESTful NodeJS APIs serving VueJS front-ends).", "Full CI/CD Pipeline.", "Heavy usage of Heroku and Amazon Web Services.", "Mix of microservice architectures (AWS Serverless)."]}, {"subtitle": "Required Skills:", "body": ["Strong relational database skills (Postgres or MySQL).", "Strong programming skills in JavaScript.", "Strong understanding of object-oriented programming concepts and design patterns.", "Disciplined approach to unit testing and quality assurance.", "Proficiency with APIs and microservice architectures.", "Experience working with Single Page Applications.", "Proficiency with Git (and Github).", "Customer first approach to building software.", "Self-directed and problem-solving mentality (aka.", " You’re a do’er)."]}, {"subtitle": "Education and Experience:", "body": ["College, university, or other post-secondary education in Computer Science or a related field; and/or."]}, {"subtitle": "Nice to have skills:", "body": ["Postgres, ExpressJS, VueJS, and knowledge of the NodeJS ecosystem.", "Experience with Heroku and AWS.", "Experience with ElasticSearch.", "Knowledge of Ontario Condo Act, Real Estate or Legal experience."]}]