[{"title": "Data Scientist"}, {"subtitle": "description", "body": ["At Bell, we do more than build world-class networks, develop innovative services and create original multiplatform media content – we’re revolutionizing how Canadians communicate.", "If you’re ready to bring game-changing ideas to life and join a community that values bold ideas, professional growth and employee wellness, we want you on the Bell team.", "Bell is making unmatched investments in our world-leading broadband fibre and wireless networks because we know they’re the backbone of the products and services our customers love.", " If you’re excited about transforming the way people connect, our Network team is the right place for you."]}, {"subtitle": "Position Description", "body": ["Bell’s Network Big Data Centre of Excellence is a team focused on utilizing Big Data and advanced analytics technologies to help Bell maintain the “Best Network” standing as well as evolve the Bell Network to support advanced solutions.", "This is a rare opportunity for a motivated data and analytics professional to join a fast growing team of Big Data, Hadoop, and analytics experts to design, develop data solution to support the entire Bell Network community."]}, {"subtitle": "Key Responsibilities", "body": ["Work with Network Big Data CoE team members, Network Engineering, Operations as well as other Bell Businesses to understand and analyze business needs and design and develop data solutions by exploring data sources, analytics approaches to be used, e.", "g.", " mining, forecasting, visualization, etc.", " and execute to address the business needs.", "Explore new sources of information to uncover new business opportunities at all levels of the business (strategic to operational).", "Exercise leading edge analytics skills in data visualization, mining, forecasting, etc.", " to address business needs.", "Work with and present to all management levels.", "Maintain and expand your knowledge of BI and current technology through training opportunities.", "Work in an agile environment and contribute to the improvement of our development processes."]}, {"subtitle": "Required Competencies", "body": ["A Bachelors or Master’s degree in computer science, math, applied science / engineering, or equivalent.", "A must have advanced level skills with multiple analytical tools such as SAS, Microstrategy, R, Python, Scala, SAP Business Objects, Tableau etc.", "Experience with Machine Learning and Artificial Intelligence algorithms and approaches.", "Familiarity working with NoSQL databases and unstructured/semi-structured data.", "5 to 8 years of great working experience using MicroStrategy suite of products.", "Advanced skills with SQL and database systems such as Oracle, SQL Server, Teradata.", "Experience with ETL technologies and approaches.", "Highly analytical skills and ability to work with large and complex technical data sets.", "Ability to leverage insights and opportunities from data and metrics to build strategies and make recommendations.", "Knowledge of, and preferably experience with, Big Data and/or software development, and/or developing visualization tools.", "Ability to work with a team towards common goals.", "Able to manage multiple projects and priorities.", "Self starter who is comfortable working with and presenting to all management levels."]}, {"subtitle": "Preferred Competencies", "body": ["Statistics and math background.", "Experience in Telecom or IT is a strong asset.", "Bilingualism is an asset (English and French); adequate knowledge of French is required for positions in Quebec."]}]