[{"title": "Full Stack Software Engineer"}, {"subtitle": "description", "body": ["Sauce Labs, a successful and rapidly growing startup building high availability software testing tools for developers and enterprises, is looking for passionate Full-Stack Engineer to add to the Growth engineering team.", "Growth team is responsible for the end to end self-service customer experience from sign-up to on-boarding and billing.", " Engineering team members need to collaborate with product management, product marketing, and user experience teams closely.", "We believe in agile, iteration based development, continuous integration and automated deployment, high security practices, and tight feedback loops for maximal knowledge-sharing and course-correction.", "On a daily basis, you will be working with a high availability system that lives on an intersection of massive testing cloud and customers whose work is dependent on solutions you will be creating.", " You will have a direct influence on improving users experience and shaping the face of our current and future products.", " We’re in constant pursuit of the tools that will allow us to deliver best possible results and we’re currently using React to build out intuitive and performant user experiences with Node.", "js and Python as our backend building blocks.", " We’re looking for strong Javascript and Python experience with a good architecture knowledge on both front and backend."]}, {"subtitle": "Responsibilities:", "body": ["Developing, defining, and evolving software in a fast-paced and agile development environment using the latest frameworks and patterns.", "Push our applications to be highly performative and scalable.", "Research and prototype new products and solutions using open source technologies.", "Collaborate with engineers and Product Managers on innovative new product features.", "Work closely with a UX/UI designer to implement new designs.", "Maintain and continuously improve scale, performance, and quality of the frontend and backend applications.", "Participate in the entire development lifecycle, from planning through implementation, documentation, testing, and deployment, all the way to monitoring.", "Produce high quality, maintainable code with great test coverage.", "Make intelligent choices for the adoption of new technologies based on your extensive experience."]}, {"subtitle": "Ideally you'll have:", "body": ["3+ years of software development experience, with significant time spent on development on both sides of the application.", "Strong sense of ownership and passion for engineering great products with stellar user experiences.", "Demonstrated leadership ability.", "Expertise in any of our core languages and technologies, with a good knowledge of their associated ecosystems (JavaScript, Python, Node, React, Django, Docker, Kubernetes).", "Proficient in code versioning tools (Github, Gitlab, etc.", ").", "Familiar with agile process and test driven development.", "Understanding of common security practices involved in protecting customer data."]}, {"subtitle": "Bonus Points For:", "body": ["Practical experience with Docker.", "Familiarity with container orchestration technologies such as Kubernetes and Helm.", "Experience in contributing to open source projects.", "Practical experience with Jenkins, Travis CI, GitLab.", "Bachelors in Computer Science or equivalent experience."]}]