[{"title": "Software Engineer Camera Perception System"}, {"subtitle": "Postmates X ", "body": ["At Postmates X, we’re reimagining how things move in cities.", " Serve, our personable sidewalk delivery robot, is our vision for the future of delivery.", " It’s designed to take deliveries away from congested streets and onto underutilized alleys and sidewalks, to save energy, reduce emissions, reduce traffic, and make deliveries faster and cheaper.", " Why move two-pound burritos with two-ton cars?."]}, {"subtitle": "WHO WE ARE", "body": ["We are tech industry veterans in software, hardware, and design who are pooling our individual talents together to build a legacy.", " Our team is inclusive, agile, and driven by a common purpose.", " We are solving real-world problems with machine learning, computer vision, and robotics, with a mindful eye towards the end-to-end user experience.", " By joining our team, you will help create the first robotic helpers entering our cities: moving alongside us and running our errands!."]}, {"subtitle": "YOUR RESPONSIBILITIES", "body": ["Design, develop, test and optimize reliable and efficient image processing and machine learning inference software on embedded systems.", "Collaborate with infrastructure team on maintaining video encoding/decoding/streaming pipeline.", "Optimize cognition software with CUDA and shared-memory multiprocessing programming.", "Participate in code reviews to ensure code quality and distribute knowledge."]}, {"subtitle": "OUR REQUIREMENTS", "body": ["B.", "Sc.", " in Computer Science, Computer Engineering, Mathematics or a related field.", "Strong C++ and Python programming skills.", "5+ years of hands-on professional experience in C++ (preferably C++11 and newer).", "Good understanding of common families of machine learning models, feature engineering, feature selection and other practical machine learning issues, such as overfitting.", "Deep understanding of computer vision basic concepts.", "Strong communication skills.", " Explaining complex technical concepts to product managers, data analysts, and other engineers shouldn’t be a problem for you."]}, {"subtitle": "OUR PREFERRED QUALIFICATIONS", "body": ["M.", "Sc.", " or Ph.", "D.", " in computer vision, machine learning, or a related field.", "Experiences with OpenMP, OpenGL and CUDA.", "Experiences with GCP or AWS, Kubernetes and Docker.", "Familiar with mobile robots system."]}]