[{"title": "Software Developer"}, {"subtitle": "Job Description", "body": ["As a Software Developer, you will develop world-class software technologies for sophisticated automation equipment.", "Duties include developing and documenting software requirements, developing concepts, software design and development, integration of software with electrical, mechanical and control systems, and supporting other software engineers who deploy the software in specific applications.", " Programming assignments involve real-time controls, configuration and diagnostic tools, simulation and modelling tools and strong integration with high performance automation equipment.", "This position will contribute to new and next generation SuperTrak® linear motion conveyor products and other industry leading mechatronic technologies.", " The Innovation Center is an exciting venture developing state of the art technologies within a large, industry-leading, global automation supplier."]}, {"subtitle": "General Experience", "body": ["Skilled at developing clean code that is efficient, elegant, robust and maintainable.", "Ability to get to root cause of customer problems and deliver innovative software that solves them.", "Team player able to contribute in agile meetings, perform code reviews, brainstorm hard problems and step in and contribute when a challenge needs all hands on deck."]}, {"subtitle": "Specific Experience", "body": ["Experience with C/C++, .", "NET or similar tools.", "Strong programming/software development and problem solving skills.", "Experience with Agile development practices.", "Familiar with issue-tracking and revision-control systems.", "Developing and executing tests to verify behavior and performance.", "Performing and accepting code reviews.", "Contributing to software release plans that align with technology roadmaps.", "Assisting with the generation of software related product documentation.", "Hands-on experience with lab test equipment is an asset.", "Familiarity with automation is an asset (PLC’s, control systems, electrical/mechanical).", "Ability to communicate effectively, both orally and in writing.", "A self-starter with the ability to work as part of a team in a fast paced environment with minimal supervision."]}, {"subtitle": "Education", "body": ["A post-secondary engineering or computer science degree, diploma or equivalent with an emphasis on software design and development."]}, {"subtitle": "Why Join ATS?", "body": ["Be a part of a global organization that is a leader in its industry.", "Subsidized breakfast and lunch daily; free gourmet beverages - coffee, tea and hot chocolate.", " Plus, Treat Day is every other week!.", "Monthly “In-Chair Massage” clinic on-site with a Registered Massage Therapist.", "Ability to participate in a variety of charitable events.", "Social Club that offers BBQs and other social events throughout the year.", "Work with other bright, talented people and discover opportunities for professional growth.", "And much more!."]}]