[{"title": "Software Engineer"}, {"subtitle": "Overview", "body": ["Do you love solving complex problems with technology? Our ideal candidate is someone who is passionate about developing cutting edge software solutions which aid our products and services in finding evil in some of the most complex and diverse systems in the world.", " You will be building on software solution and backend services capable of answering any question about a customer's network and extending collection capabilities through numerous means."]}, {"subtitle": "Job Responsibilities", "body": ["Develop, design, and test software to aid in large scale data collection and computer forensics.", "Deploy and support code in production systems.", "Provide presentations to stakeholders on solution design and architecture.", "Ability to self-start in a fast-paced environment.", "Ability to prioritize work in the face of competing demands.", "Help develop more junior staff."]}, {"subtitle": "Job Qualifications", "body": ["A bachelor’s degree in computer science, computer forensics/information assurance, or the equivalent work experience as determined through technical interview.", "2+ years of software development.", "Expert knowledge and experience using Python and GoLang or Java or C++.", "Expert knowledge and experience using OOP and Design Patterns.", "Experience with shell scripts like BASH and/or windows batch files.", "Familiarity with versioning control systems (Git).", "Proven ability to take on complex problems independently and to generate creative solutions.", "Excellent analytical and problem-solving skills.", "Demonstrates an eagerness to obtain domain knowledge in order to effectively demonstrate technical qualifications.", "Understanding of organization’s development platform and languages.", "Ambitious and capable of leading multiple priorities and tasks as delegated.", "Teamwork skills and ability to get work done through others.", "Proven abilities to operate independently and part of a team of developers.", "Desire to constantly expand technology skill set and squeeze every ounce of performance from a system.", "Comfortable driving new concepts/technologies to peers and management.", "Familiarity with AWS or other cloud hosting services."]}, {"subtitle": "Job Plusses", "body": ["Experience with POSIX and Windows APIs.", "Knowledge of Windows, OS X and/or Linux internals.", "Experience performing/analyzing live memory.", "Continuous Integration / Continuous Deployment tools and methodologies.", "DevOps related tools and processes.", "Experience designing and debugging multithreaded/multi-process applications.", "Familiarity with TCP/IP networking.", "Experience with terraform and AWS services."]}]