[
    {
        "title": "IT and Operations Technologist"
    },
    {
        "subtitle": "JOB SUMMARY",
        "body": [
            "Our client is looking for an IT and Operations Technologist is responsible for providing Information Technology (IT) system support services across the organization.",
            " The position will assist with IT project management, resource management, hardware installation and maintenance, troubleshooting and communicating with all users of the Garnet’s technology infrastructure.",
            " They may be required to assist with IT strategic planning, as well as identifying, selecting and deploying new technology to support organizational goals and objectives.",
            " Other duties will be assigned as necessary."
        ]
    },
    {
        "subtitle": "EDUCATION & QUALIFICATIONS",
        "body": [
            "Post Secondary Degree or Diploma in computer science, or an acceptable combination of education and relevant experience required.",
            "Proficiency with VPN networks, firewalls, encryption, and other aspects of network security technologies.",
            "Minimum of 3+ years of networking and computer support experience."
        ]
    },
    {
        "subtitle": "ESSENTIAL RESPONSIBILITIES",
        "body": [
            "Assist with the planning, development, and implementation of all IT services, programs, and support throughout the company.",
            "Provide internal IT support (server security, software updates, hardware maintenance etc.",
            ").",
            "Assist with the implementation, deployment and operation of information systems and technology solutions for business needs.",
            "Tune, configure and troubleshoot production equipment.",
            "Help to review website functionality and development.",
            "Assist senior management with the direction and facilitation of IT strategic and tactical planning.",
            "Research, design, and implement the appropriate technologies to support and improve corporate communications, access to information, and end-user productivity as directed.",
            "Ensure that applicable project management practices are followed throughout project lifecycles.",
            "Liaise with vendors and service providers to ensure efficient and cost-effective acquisition of technology purchases; oversee warranties and service agreements.",
            "Assist with capacity planning for network bandwidth, storage requirements, messaging, Web sites, and other applications.",
            "Preventative maintenance and monitoring of networking equipment such as servers, switches, gateways, routers, etc.",
            "Ongoing maintenance of company-wide IT security and drafting of procedures, and ensuring adherence to best practices.",
            "Create status reports as required; present findings to senior management.",
            "Perform other related duties as assigned."
        ]
    },
    {
        "subtitle": "SKILLS & KNOWLEDGE",
        "body": [
            "Knowledge of the electronic manufacturing process would be an asset.",
            "Knowledge of networking, operating system, and server architectures.",
            "Knowledge of programming concepts, software development cycles, and associated tools and platforms.",
            "Knowledge of applicable IT laws and regulations.",
            "Project management.",
            "Ability to explain technical concepts and theories to non-technical audiences.",
            "High degree of resourcefulness, flexibility, and adaptability.",
            "Able to effectively communicate both verbally and in writing.",
            "Customer service oriented.",
            "Problem solving and troubleshooting skills.",
            "Team Work.",
            "Quality Orientation.",
            "Accountability.",
            "Dependability.",
            "Operating technical equipment.",
            "Ethics and Integrity."
        ]
    }
]