[{"title": "Junior Systems Engineer"}, {"subtitle": "Job Description:", "body": ["The Junior Systems Engineer will work as part of a multi-disciplinary project team developing new and innovative solutions for the Royal Canadian Navy and its partners in the Anti-Submarine Warfare (ASW) domain.", "The Junior Systems Engineer will work within the Systems Team to analyse system concepts; define requirements; create and document the system design and interfaces; define and manage subsystem requirements; and verify / validate the system to ensure it fulfils the Customer’s requirements and needs.", "Working within a multidisciplinary team to:.", "Contribute to defining and describing the Technical Solution during bids.", "Define and manage system and subsystem requirements.", "Conducting trade studies to evaluate different potential design solutions.", "Contributing to the System Design, through functional and non-functional analysis.", "Support the definition of the Integration, Verification and Validation strategy and manage this through the program.", "Participate in technical reviews.", "Support the continuous improvement of the Systems Engineering function, including processes and tools.", "Other tasks as assigned."]}, {"subtitle": "Required Skills:", "body": ["Bachelor's Degree in Math, Physics, Computer Science or Engineering or similar discipline.", "2+ years of Systems Engineering experience.", "Ability to work on Canadian Controlled Goods and US ITAR controlled articles.", "Candidate must be capable of acquiring a NATO Reliability and Secret security clearance."]}, {"subtitle": "Desired Skills:", "body": ["Master's Degree an asset.", "Maritime Domain (desirable).", "Underwater Warfare or Acoustics (desirable).", "Familiar with Systems Engineering Processes.", "Familiar with the System Engineering lifecycle and experience in several phases of it.", "Aware of the System Design Review process.", "Familiar with Requirements Definition, Requirements Management and Interface Design.", "Aware of System Design approaches and techniques.", "Aware of Algorithm Definition and Validation e.", "g.", " through use of tools like Matlab.", "Aware of Integration, Verification and Validation activities, including Test Planning, Test Conduct and Reporting.", "Willing to work within an interdisciplinary team and understand the perspectives of other disciplines.", "Willing to understand the Concept of Operations in which systems are used.", "Requirements Definition and Management, including familiarity with a requirements management tool such as DOORS or CRADLE.", "Willingness to conduct trade studies to evaluate different potential solutions.", "Willing to contribute to the System Design, through functional and non-functional analysis.", "A team-oriented individual that works collaboratively to achieve team goals.", "Strong communication skills and a positive attitude.", "Must be self-motivated, adaptable, and attentive to details.", "Willing to effectively prioritize and execute tasks in a deadline-oriented environment.", "Occasional travel within Canada, US and Overseas."]}, {"subtitle": "What’s in it for you?", "body": ["As one of Atlantic Canada’s and Nova Scotia’s Top Employers for 2020, our working environment is fast-paced, results oriented and suited to those who thrive on change.", " Our projects are diverse, technically challenging and innovative.", " Our people are intelligent, creative and great to work with.", "Ultra specialises in providing application-engineered bespoke solutions.", " We focus on our customers’ mission critical and intelligent systems in the defence, security, critical detection & control markets.", " Our capabilities and technologies can be found on many of the world’s long-term military programmes.", " We employ over 4,500 employees across the globe and are listed on the London Stock Exchange.", " Ultra operates mainly as a Tier 3 (sub-system) and occasionally a Tier 2 systems provider, in the Maritime, C3 (Communications, Command and Control) and Cyber, military and commercial aerospace, nuclear and industrial sensors markets.", " We use both research and development, to provide innovative, mission specific bespoke technological solutions to our customer’s most complex problems.", " ."]}]