[{"title": "Specialist Product Management – Safety and Environment (Enablon)"}, {"subtitle": "description", "body": ["The role of Specialist Product is to translate business requirements into formal product roadmaps.", " The Specialist works closely with the Business and I&T stakeholders to operationalize these roadmaps for initial development and evolution of the product.", " The Specialist Product supports the full lifecycle of the product and as such seeks regular customer feedback related to the product to understand and improve customer satisfaction.", " This person ensures the product and related enhancements meet business needs based on market trends as well at I&T architecture positioning."]}, {"subtitle": "Business Partnering", "body": ["Create trusted relationships between the Business and I&T organization, ensuring that there is a clear communication channel between the two and that product expectations on either side are aligned.", "Translate Business and Operations needs into solutions through a formal product roadmap.", "Work with the Business to capture, translate and enrich business requirements for new and existing products and related services.", "Provide business leaders with insight into innovative technologies that can disrupt or enhance business models / capabilities.", "Measure satisfaction through various channels and scores (e.", "g.", " Net Promoter Score)."]}, {"subtitle": "Product Life-Cycle Management", "body": ["Develop a pipeline of product innovations.", "Engage with key stakeholders to achieve a shared vision of product goals and priorities.", "Develop a product roadmap aligned to business needs and priorities.", "Work with the business to prioritize features and requirements within the product roadmap.", "Work with cross-functional teams to ensure innovation productization / realization into new products.", "Participate in application configuration and administration to support business evolution.", "Maintain a product lifecycle perspective, and facilitate the balancing of short-term achievements with long-term goals."]}, {"subtitle": "Evolving Product Management Discipline", "body": ["Support and participate in the creation of a modernization framework.", "Support the product manager in evolving the product management discipline."]}, {"subtitle": "Education/Certification/Designation", "body": ["A Bachelor's degree in computer science, business administration or equivalent degree or experience."]}, {"subtitle": "Skills/Knowledge", "body": ["Business acumen, and the ability to communicate, business domain stakeholders and technical staff alike.", "Demonstrate leadership, influence, communication, presentation and facilitation skills.", "Effective planning and organizational skills.", "Excellent analytical and technical skills.", "Knowledge of the Product Management discipline.", "Familiarity with the principles of Design Thinking and Lean / Agile software delivery.", "Ability to develop a product vision and execute to make that vision a reality, with a passion for building great products."]}, {"subtitle": "Experience", "body": ["Minimum 5 years overall work experience.", "Minimum 3 years demonstrating technical leadership qualities and/or overseeing deliverables.", "Experience in administration and configuration of Safety & Environment platforms (Enablon).", "Experience in product management or related role.", "Experience in shaping, building, scaling and sustaining products.", "Experience in diverse roles and increasing responsibilities across Business and I&T, although a business-only career is acceptable if business roles included sufficient technology focus.", "Experience with Lean / Agile software delivery teams (ie – Kanban)."]}, {"subtitle": "Working Conditions", "body": ["This role may require occasional business travel in accordance with CN policy for meetings (10-20% of time)."]}, {"subtitle": "About CN", "body": ["CN is a world-class transportation leader and trade-enabler.", " Essential to the economy, to the customers, and to the communities it serves, CN safely transports more than 300 million tons of natural resources, manufactured products, and finished goods throughout North America every year.", " As the only railroad connecting Canada’s Eastern and Western coasts with the Southern tip of the U.", "S.", " through a 19,500 mile rail network, CN and its affiliates have been contributing to community prosperity and sustainable trade since 1919.", " CN is committed to programs supporting social responsibility and environmental stewardship.", " At CN, we work as ONE TEAM, focused on safety, sustainability and our customers, providing operational and supply chain excellence to deliver results."]}]