[{"title": "IT Server Specialist"}, {"subtitle": "Who are we?", "body": ["Founded in 1924, Irving Oil is a family-owned company with operations throughout Eastern Canada, New England and Ireland with a focus on providing exceptional service and high-quality products to our customers.", " Every day, we strive to put our good energy in action to bring families together, support the environment and local wildlife, and to create learning opportunities that empower the next generation."]}, {"subtitle": "Here's what you can expect from us:", "body": ["When you're a part of our team, you'll see how we bring good energy to our business and our employees.", " Together, we will support our corporate strategy, high standards and the communities where we live and work.", " Our collaborative approach, commitment to diversity and inclusion along with our safety-first culture helps reinforce our internal brand position where People Matter.", " That's why we're dedicated to the development of our employees, so that they can reach their career goals."]}, {"subtitle": "What you can expect in a typical day:", "body": ["The Server Specialist is responsible for working with our vendors in operations to maintain the Data Center by tracking server activity, performing software upgrades, maintaining Server hardware, help with technical problems, and improve efficiency by analyzing and evaluating network server functions."]}, {"subtitle": "What you’ll need to succeed:", "body": ["Responsible to oversee maintenance and operations of multiples servers: database, file, mail, print, web, and application servers.", "Working with vendors to maintain and configure servers to operate at optimal capacity: connectivity, utilization, server administration, and performance tuning.", "Ensuring that storage systems and backups are properly maintained.", "Ensuring that proper server backup and recovery strategy as well as disaster recovery and business continuity practices are followed.", "Provide guidance and ensure that industry best practices are followed with respect to storage systems, operating systems, account security, directory services, and server virtualization.", "Oversee the process of troubleshooting for server issues, know how to identify, diagnose, and resolve problems, document the solution, and track issues whether it’s network, host, or operating systems.", "Work with other team members and vendors to source hardware that will meet company requirements and standards.", "Strong understanding of Microsoft Active Directory.", "Create test plans and strategies for new functionality.", "Create, request, and present technical specifications and requirements for purchase of new servers.", "Willing to work flexible hours when new system upgrades, troubleshooting, or fixes need to be addressed.", "Stay current with system information, changes, and updates and how that may affect functionality."]}, {"subtitle": "Professional Skills:", "body": ["Strong relationship building skills.", "Good listening skills.", "Strong oral and written communication skills.", "Client focused with excellent customer service skills.", "Able to find solutions that fix an issue for the long term – resolution focused.", "Sense of urgency, adaptable and flexible to changing priorities.", "Proactive and can act independently to solve issues while keeping other team members informed.", "Able to work independently while working with a larger team."]}, {"subtitle": "Education and experience:", "body": ["Post-secondary education in Computer Science, Information Technology, Information Systems, or related field.", "8+ years IT experience with a minimum 5 years’ experience working with Enterprise level Server infrastructure, Virtual and Physical.", "Experience working in a vendor supported network environments.", "Network configuration, monitoring, and troubleshooting experience.", "Certifications in ITIL (Information Technology Infrastructure Library) an asset.", "Microsoft certifications an asset, e.", "g.", " MCSE.", "VMware certifications an asset, e.", "g.", " VCP,VCAP.", "Cloud experience would be an asset.", "SCCM suite experience.", "Cisco certifications an asset.", "Linux certifications an asset."]}]