[{"title": "Technical & IT Support"}, {"subtitle": "Position Details:", "body": ["Do you enjoy engaging people and helping them succeed?.", "Can you anticipate problems and proactively help customers with potential issues?.", "Are you methodical and detail-oriented?.", "You will be a core member of our world-renowned primary technical support group.", " Your duties will include phone and email support and recording customer interactions.", " This will entail all aspects of delivering the best solution, from diagnosing the problem through executing the solution to following up with the customer.", " Additionally, you will provide IT support for both internal software and hardware used in our head office.", "To be considered, you must have a formal education in engineering, IT or computer science or equivalent related experience.", " Familiarity with networking infrastructure and common industrial control elements such as PLCs, RTUs, HMIs, and communications protocols would be a strong asset."]}, {"subtitle": "Applicants graduating within the last five years should include a copy of their university transcripts (scanned copies are acceptable).", "body": ["Please direct applications via email to careers@trihedral.", "com and include the position and location of interest in the email subject line."]}, {"subtitle": "Corporate Profile", "body": ["Trihedral Engineering Limited made the list of Canada’s Top Small & Medium Employers in 2018, presented by Canada’s Top 100 Employers and The Globe and Mail newspaper and was chosen by MacLean’s magazine as one of the top 15 best places to work in Atlantic Canada for seven years running.", " In addition, our management was recently awarded Entrepreneur of Year for IT in Atlantic Canada by Ernst & Young.", "We are a software development company with technical leadership in the field of Windows-based industrial monitoring and control software.", " We began in 1986 and have our head office in Bedford Nova Scotia and international offices in Scotland and the United States.", "Our product, called VTScada, is used globally and probably already touches your life by supporting many mission-critical systems.", " It is in a wide variety of applications including municipal water systems, power generation, television broadcasting, offshore oil production, and cryogenic gas distribution.", " VTScada has received honorable mention for the best HMI software in Control Engineering Magazine’s Engineers Choice Awards for two years in a row and was the winner in this category in 2015.", "Our ambition is to continue our success in building a great product without sacrificing our core values.", " We are seeking candidates who experience a child-like delight in applying technology to solve the industry’s most challenging problems, take pride in their work, and exhibit keen attention to detail.", " Doing whatever it takes to get the job done is characteristic of the Trihedral family.", " We require people with a self-starter skill set who can excel in our open management structure.", " If you have the talent, we want to meet you.", " We are a growing company where your effort makes a difference in our success.", "Trihedral offers competitive salaries and benefits, a stock purchase plan, offices with doors overlooking the Bedford Basin and prides itself in treating staff, customers and suppliers the way we wish to be treated."]}]