[{"title": "Infrastructure Analyst"}, {"subtitle": "description", "body": ["Descartes (TSX:DSG) (Nasdaq:DSGX) is the global leader in providing on-demand, software-as-a-service solutions focused on improving the productivity, performance and security of logistics-intensive businesses.", " Descartes has over 147,000 parties using its cloud based services.", " Customers use our modular, software-as-a-service solutions to route, schedule, track and measure delivery resources; plan, allocate and execute shipments; rate, audit and pay transportation invoices; file customs and security documents for imports and exports; and complete numerous other logistics processes by participating in the world's largest, collaborative multimodal logistics community.", " Our headquarters are in Waterloo, Ontario, Canada and we have offices and partners around the world.", " Learn more at."]}, {"subtitle": "POSITION SUMMARY", "body": ["The IT Infrastructure Analyst will assist in the proactive contribution and on-going support and maintenance of the operational environment.", " You will support a variety of hardware and software and ensure that performance and availability of the Descartes applications are always maintained at the highest standards.", " You will be responsible for our virtualized server environment, storage and data management as well as taking care of our co-location datacenters space.", " This will involve supporting all IS departments and the business with their specific infrastructure needs in these areas."]}, {"subtitle": "RESPONSIBILITIES", "body": ["Manage data center inventories related to systems, space, and requests for moves, additions and changes of hardware.", " You ensure that the environment is always update to date (implementing patches, service packs, etc.", ").", "Manage the implementation, configuration, maintenance and monitoring of our enterprise servers, storage, and backup systems.", "Install, upgrade, and troubleshoot virtualization environment in multiple Datacenters.", "Install, upgrade, and troubleshoot fiber channel & ISCSI SAN switches.", "Install and configure new servers, firewalls, switches, load balancers and virtual machines.", "Budget planning for data center infrastructure spend.", "Document problems and resolution, create and update procedures and keep documentation up to date.", "Assist in strategic infrastructure projects like integration/consolidation of datacenters, improvement, and evolution of infrastructure in terms of functionality and technology.", "Ensure corporate change management processes are followed and maintenance is executed in appropriate windows.", "Familiarity with Disaster Recovery planning and execution strategies.", "Monitor system performance and implement performance tuning.", "24x7 Escalation point for all backup, servers & storage issues.", "produce professional logical and physical documentation for all systems and keep CMDB up to date."]}, {"subtitle": "QUALIFICATIONS", "body": ["A degree or diploma in IT, computer science or related discipline.", "5+ years of IT Compute Systems, Storage experience.", "Descartes will support the candidate to learn on the job and build up extensive experience, however knowledge or experience on any of the following is considered an asset :.", "Pure, HPE, Dell-EMC or equivalent SAN technologies.", "Backup systems: Data Domain, networker, Veeam or equivalent.", "VMware ESXi.", "Azure or AWS cloud infrastructure.", "Solid understanding of ITIL fundamentals.", "Excellent communication, presentation and documentation skills.", "Demonstrated analytical and leadership skills."]}]