[{"title": "Integration Consultant"}, {"subtitle": "description", "body": ["As an Integration Consultant using business process engineering techniques, develops technical solutions and management processes to achieve overall objectives by means of implementing systems or enterprise-wide solutions, using the company's or a third-party's hardware/software products.", " Develops and recommends solutions and strategies, based on the analysis of customer business goals, objectives, needs, and existing systems infrastructure.", " Participates in sales and proposal presentations in addition to completing ongoing team account activities.", " Identifies additional product/services opportunities in customer organization.", " In general, customers view this employee as a consultant.", " Performance is typically measured by delivery of agreed to solutions within budgeted hours."]}, {"subtitle": "As part of Global Integration Team you will work with implementation teams to provide support around integration requirements for Kronos Products.", "body": ["Resource communicates clearly and can develop and read specifications.", "Acts as a mentor/coach to others on the Global Integration Team for integration best practices.", "Work closely with Project Managers and Application Consultants, communicating and understanding goals required to complete required tasks on time and budget.", "Designs, develop, modify, debug and evaluate tools developed to aid the Professional Service Teams.", "Support development with tools and applications in other parts the professional services organization.", "Ability to assist Sales, Presales, or Services teams with integration discovery and scoping.", "Exposure to complex technology environments requiring a multi-product solution, as well as product integration and solutions.", "Must be comfortable working with in a cloud environment."]}, {"subtitle": "Qualifications", "body": ["3 + years' experience in a technical consulting environment.", "Ability to assess, design, and develop integration for strategic large and/or very complex customers.", "Ability to translate requirements into working solutions.", "Bachelor's degree or equivalent in Computer Science, Information Systems or related field preferred.", "Travel up to 25%.", "Advanced knowledge of database querying, programming and web services, web transfer methods, file management, and cloud technology.", "Development languages (.", "NET, Java, JavaScript, JSON).", "Development tools (for example source control, defect tracking tools, Postman, etc.", ")."]}, {"subtitle": "", "body": ["Want to be part of an elite group of highly skilled professionals? We think our employees are a special group of talented, energetic, and innovative people.", " And for that reason, we refer to ourselves as Kronites.", " Kronites care about more than just work.", " We recognize the need to maintain a healthy work-life balance – to live inspired.", " In fact, it’s expected! You’ll soon learn that we take work and fun seriously.", " No matter what position you hold at Kronos, you’re a Kronite.", " And we want you to feel like you have the power to make a difference in your life and the lives of others, at work and beyond.", " Want to learn more about our culture? Follow us on Twitter @work4kronos.", " #MyWorkInspired.", "Kronos is a global provider of workforce management and human capital management cloud solutions.", " Kronos’ industry-specific workforce applications are purpose built for businesses, healthcare providers, educational institutions and government agencies of all sizes.", " Tens of thousands of organizations – including half of the Fortune 1000® - and more than 40 million people in over 100 countries use Kronos every day."]}, {"subtitle": "Equal Opportunity Employer", "body": ["Kronos is an Equal Opportunity Employer.", " All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, age, national origin, protected veteran status, disability or any other basis protected by federal, state or local law."]}]