[{"title": "Specialist Solution and System Integration"}, {"subtitle": "Job Summary", "body": ["The Specialist Solution and System Integration is responsible for the successful deployment of advanced infrastructure, telecom, Internet, Industrial IoT, software development, applications and technology solutions, systems and services.", " The Specialist ensures that team members and projects meet all business requirements, and contributes to the global evolution of CN’s I&T.", " The Specialist plays a key role in the team, ensuring that the technology delivered is secure, reliable, available, resilient, performant and aligned with safety standards as per business requirements."]}, {"subtitle": "Main Responsibilities", "body": ["Integration.", "Engage with customers to capture requirements.", "Translate technology solution architecture into technical or software development standards and specifications.", "Establish lab test plans, conduct tests and log results.", "Based on blueprint and test results in the lab, create a detailed/functional solution that meets business requirements and record them in the log book.", "Establish deployment/migration strategy and guide project team and operations.", "Travel to visit field sites and inspect installations, as required.", "Guide other integrators and work with them to address potential and current problems.", "Coordinate installation with technicians in the field and the owner while taking into account maintenance windows.", "Determine appropriate solution for support issues during project migration or deployment through root cause and impact analysis.", "Lead transition-to-core operations: update documentation, systems, training and presentation.", "Define and ensure adherence to engineering and configuration standards.", "Implement and ensure compliance with all appropriate CN I&T standards (e.", "g.", ", security, architecture, project delivery methods, SOX, telecom, software engineering, etc.", ").", "Engage external providers and work with business planning, supply management and legal teams in the context of procuring delivery and/or support services for new or existing services.", "Manage the roadmap (hardware and software) with the vendor based on CN strategy and I&T technology needs.", "Estimate overall solution costs and share information with project managers and stakeholders.", "Create technical diagrams and documentation for the solution.", "Follow the change and release management processes by initiating change controls and executing cut-over plans."]}, {"subtitle": "Experience", "body": ["5 to 10 years’ relevant work experience.", "Minimum 7 years’ experience in a software development, telecom manufacturing, management or service provider environment.", "Minimum 5 years’ relevant technical experience (specialty) in complex detailed design and solution integration.", "Experience designing, configuring and deploying telecom systems.", "Proven experience delivering technology projects involving multiple parties.", "Proven experience with IP protocols and technologies.", "Experience in KPIs and dashboard management.", "Integration experience of complex solutions engaged with Testing, troubleshooting issues, installations, managing multiple vendor, registering bug reports in Jira and follow-up on fixes ensuring timely resolutions."]}, {"subtitle": "Education/Certification/Designation", "body": ["Bachelor’s degree in Commerce, Computer Science, Computer Engineering, Electrical Engineering, a related field of study or equivalent work experience."]}, {"subtitle": "General Skills and Attributes", "body": ["Set goals aligned with CN’s plan and assume responsibility for obtaining results.", "Be able to solve problems creatively.", "Possess organizational, time-management and prioritizing skills.", "Embrace a team mindset: develop collaborative relationships with others.", "Be able to effectively communicate verbally, in writing and make presentations.", "Lead a culture of safety: take the necessary measures.", "Be inspirational: empower and develop people."]}, {"subtitle": "Technical Skills/Knowledge", "body": ["Ability to precisely estimate efforts of the tasks assigned to integrators.", "Technical documentation skills.", "Knowledge of IT security principles.", "Strong systems engineering knowledge.", "Ability to estimate efforts and costs required for delivery.", "Familiarity with Databases (MySQL, Oracle), IP Networking (TCP/IP, VPN, DNS, Firewalls and Load Balancers, Wireshark traces), Linux, Webservices and RESTful APIs.", "Broad knowledge of IT Systems and Infrastructure and Software Development (Python)."]}]