[{"title": "Specialist IAM Solution & System Integration"}, {"subtitle": "The Specialist IAM Solution & System Integration is responsible for the successful deployment of applications, technology solutions, systems and services. The Specialist ensures that IAM requirements are met by team members and projects, and contributes to the global evolution of CN’s I&T. The Specialist IAM Solution & System Integration is a key player in the team, ensuring the technology delivered is secure, performant and aligned with safety standards per business requirements. He will also make it a priority to integrate solutions that are automated to avoid adding manual work to the operations team.", "body": []}, {"subtitle": "Integration", "body": ["Engage with customers to capture requirements.", "Support the Solution & Security Architect during their requirements phase as well as providing expertise on current capabilities to build the high level architecture.", "Translate a portion of the high-level solution architecture document into existing capabilities available within the domain(s) of expertise.", "If needed, define new capabilities required by the project as identified by architecture; ensure maximum automation in the design for deployment.", "Ensure that solution designed meet all business requirements.", "Apply, and ensure compliance with all appropriate CN I&T standards.", "Work with Project managers during the planning phases and identify deployment steps and risks.", "Define testing strategy and align with the functional team in with domain(s) of expertise.", "Establish test plans and tests results for newly defined solution.", "Conduct testing and log results.", "Establish deployment/migration strategy and guide project team and operations.", "For support issues during project migration or deployment, determine appropriate resolution/solution through root cause analysis and impact analysis.", "Estimate efforts of work associated with domain(s) of expertise.", "Create supporting documentation and present to the operations team.", "Transition projects to core operations."]}, {"subtitle": "Decision Making & Impacts", "body": ["The Specialist IAM Solution & System Integration acts as an authority in domain(s) of expertise, make recommendations to the Business and I&T team members on technical matters and commits to the organisation’s deliverables.", "Assist business by providing the right solution(s) for their needs with efficiency, safety, security, productivity, profitability, and cost-saving in mind.", "Provide artifacts to increase transparency to project teams and stakeholders; create deliverables through constant collaboration cycles, ensuring all involved will be in agreement with proposals to keep the project on-track and assist other teams with production planning.", "Research on industry-standard practices and technologies; ensure our position in the Global Market is constantly improving by introducing newer standards that will aid in faster production of solutions, increased efficiencies for administration and clients, and improved visibility."]}, {"subtitle": "Education/Certification/Designation", "body": ["Bachelor’s degree in Computer Science, Information Systems or other related field, or equivalent work experience."]}, {"subtitle": "Skills/Knowledge", "body": ["Strong knowledge in Identity & Access Management concepts and best practices with hands-on experience in: Access Certification, Provisioning/De-Provisioning, Authentication (SSO, MFA), Identity Federation, Privileged Access Management.", "Work experience with integration of solutions into a Central Identity & Access Management tool such as IBM Security Identity Manager (ISIM), Sailpoint or Saviynt.", "Proven experience delivering technology projects involving multiple parties.", "Ability to estimate efforts required for delivery.", "Ability to prioritize tasks and work in a fast-paced environment.", "Ability to handle multiple and moderately-sized assignments simultaneously.", "Competent at problem-solving through ingenuity and creativity.", "Strong team work and interpersonal skills.", "Excellent verbal, written and technical communication skills to interact with individuals from various levels and departments in both English and French.", "Analytical abilities, result-focused, action oriented, and ability to work effectively with customers and IT Leaders.", "Ability to think and act under pressure.", "Ability to learn quickly and thoroughly in rapidly changing conditions."]}, {"subtitle": "Experience", "body": ["Minimum 7-10 years overall work experience.", "Minimum 5 years experience in Identity and Access Management."]}, {"subtitle": "Assets", "body": ["ITIL Management framework – Identity and Access Management.", "Knowledge of ISIM or Saviynt.", "Experience of railway industry.", "For internal candidates, note that the grade level of the position will depend on the employee's experience."]}, {"subtitle": "About CN", "body": ["CN is a world-class transportation leader and trade-enabler.", " Essential to the economy, to the customers, and to the communities it serves, CN safely transports more than 300 million tons of natural resources, manufactured products, and finished goods throughout North America every year.", " As the only railroad connecting Canada’s Eastern and Western coasts with the Southern tip of the U.", "S.", " through a 19,500 mile rail network, CN and its affiliates have been contributing to community prosperity and sustainable trade since 1919.", " CN is committed to programs supporting social responsibility and environmental stewardship.", " At CN, we work as ONE TEAM, focused on safety, sustainability and our customers, providing operational and supply chain excellence to deliver results.", "CN is an employment equity employer and we encourage all qualified candidates to apply.", " We thank all applicants for their interest, however, only candidates under consideration will be contacted.", " Please monitor your email on a regular basis, as communication is primarily made through email."]}]