[{"title": "Cybersecurity Incident Response Analyst"}, {"subtitle": "Who are we?", "body": ["Founded in 1924, Irving Oil is a family-owned company with operations throughout Eastern Canada, New England, and Ireland with a focus on providing exceptional service and high-quality products to our customers.", " Every day, we strive to put our good energy in action to bring families together, support the environment and local wildlife, and to create learning opportunities that empower the next generation."]}, {"subtitle": "Here's what you can expect from us", "body": ["When you're a part of our team, you'll see how we bring good energy to our business and our employees.", " Together, we will support our corporate strategy, high standards and the communities where we live and work.", " Our collaborative approach, commitment to diversity and inclusion along with our safety-first culture helps reinforce our internal brand position where People Matter.", " That's why we're dedicated to the development of our employees, so that they can reach their career goals."]}, {"subtitle": "What you can expect in a typical day:", "body": ["If you’re interested in a career in cybersecurity, joining our growing team of cybersecurity experts could be the opportunity you are looking for.", " As our Cybersecurity Analyst – Incident Response, you will work with cross-functional teams to deal with cybersecurity incidents at a high technical level and be capable of identifying threats and threat vectors that cause security events.", " You will both do some direct monitoring, and also work closely with our Level 1 incident response function that monitors security alerts and action escalated events.", " You will create and maintain standard operating procedures as well as other documentation, and assist in IT security investigations, exercises, and tests.", " Approximately 25% of your time will be spent reviewing and responding to users’ emails."]}, {"subtitle": "What you’ll need to succeed:", "body": ["Experience monitoring security alerts of potential malicious activity detected by security systems such as: Intrusion Detection and Prevention Systems, Log Monitoring, Office 365, Endpoint Detection and SIEM.", "Experience classifying the severity of alerts and assessment of potential impacts.", "Experience maintaining records of security monitoring and incident response activities, utilizing case management and ticketing technologies and techniques.", "Ability to read and understand system data, including, but not limited to, security event logs, system logs, and firewall logs.", "Effective communication skills to.", "communicate alerts to different levels of management regarding intrusions and compromises to their network infrastructure, applications and operating systems.", "Prepare briefings and reports of analysis methodology and results.", "Willingness and ability to maintain a proficiency in current and emerging cyber threats and attacks, as well as security vulnerabilities.", "Comfort with log extraction and (Extraction Translation and Loading)."]}, {"subtitle": "Professional skills", "body": ["Security mindset.", "Able to take ownership of and solve routine daily problems and issues that arise.", "Ability to build rapport and good relationships with cross-functional teams and key stakeholders.", "Able to communicate technical information in a non-technical way.", "An ability to thrive in a high-pressure environment and meet tight deadlines.", "Proven ability to work cooperatively within a team as well as take responsibility for own work.", "Customer service mindset.", "Strong organizational, time management, and prioritization skills."]}, {"subtitle": "Education and experience", "body": ["Minimum 2 years of experience in IT and cybersecurity.", "Post-secondary education in Computer Science, Information Technology, Information Systems, Networking, related fields, or equivalent experience.", "Certifications in cybersecurity industry."]}]