[{"title": "Technical Support Analyst"}, {"subtitle": "Here's what you'll do…", "body": ["Schedule, coordinate and implement customer upgrades for Aptos products.", "Research and resolve technical issues for customers while providing clear and consistent updates through the life cycle of the upgrade.", "Create software packages as required following Aptos best practices and guidelines.", "Conduct & coordinate transition technical reviews following Aptos product best practices and guidelines.", "Ensure all upgrade and transition documentation is kept current and up to date.", "Follow principles of continuous process improvement to ensure quality deliveries for our customers including automation of tasks.", "Enhance client satisfaction by ensuring that response, updates, reviews and upgrades occur within the defined guidelines and objectives.", "Establish and foster strong relationships with a broad audience of customers, partners, peers and leadership.", "Collaborate with cross functional peers to establish and maintain organizational best practices, processes and methodologies.", "Perform other duties as assigned."]}, {"subtitle": "Here's what skills you'll need…", "body": ["A Bachelor's degree in Computer Science, Information Systems or with a Business focus, or a Technical College certificate with 1-2 years relevant experience.", "1-2 years experience in supporting or implementing Aptos products.", "Intermediate SQL skills.", "Experience with scripting languages.", "Experience with log aggregation and analysis.", "Understanding of advanced hardware drivers and peripherals (e.", "g.", " OPOS, PINPads, etc…).", "Strong communication, documentation and presentation skills.", "Ability to function effectively and independently in a fast-paced team environment.", "Flexibility to conduct upgrades off hours.", "Proven strong technical, analytical and troubleshooting skills.", "Knowledge of server, hardware and network technology.", "Experience working with and debugging web applications and/or services."]}, {"subtitle": "Here's what will give you an edge…", "body": ["Experience in the retail industry, specifically with POS or Retail head office software.", "Experience with Powershell scripting an asset.", "Experience with Atlassian products (Jira, Confluence) and Service Cloud."]}, {"subtitle": "Passion.", "body": ["We know it when we see it.", " Passion is not saying how much you love what you do in your most excited voice.", " Passion is revealed in your truest self.", " It's about what you've accomplished; how you want to grow; the ideas you have; your philosophies.", " It's demonstrating through your words and your actions that you truly believe in what you do - and where you work.", " That it matters to you.", " And that's pretty cool."]}, {"subtitle": "Resourcefulness and application. ", "body": ["At Aptos, we have a pioneering spirit - when we have questions, we find answers; when we're faced with challenges, we find solutions.", " We turn to a variety of resources, including our own colleagues, our professional network, the Internet, articles and books - whatever helps us get the job done.", " But it's not just about using a variety of resources to gain knowledge - it's also about applying that knowledge to other areas of the job or business where it might make sense."]}, {"subtitle": "Initiative. ", "body": ["You don't wait around for things to happen or for your manager to tell you what to do.", " You're not only proactive about completing your own work, but when you sense the need to introduce a project that will benefit the team or the organization - even if it's outside your scope of work - you put a proposal together, talk to the team about it, and own it.", " And that also goes back to having a pioneering spirit."]}]