[{"title": "Computer Support Specialist"}, {"subtitle": "ABOUT US:", "body": ["Established in 1934 as a small plumbing and heating company, E.", "S.", " Fox Limited today is recognized as a pre-eminent Canadian multi-trade Industrial, Commercial, Institutional and Nuclear constructor and fabricator.", " E.", "S.", " Fox Limited works in the industries of oil and gas, petrochemical, mining, pulp and paper, steel, automotive, pharmaceutical, casinos, hotels, hospitals, schools, and themed entertainment.", "The company is headquartered in Niagara Falls, Ontario, and maintains full-service regional offices in Hamilton, Toronto, Port Robinson, Oshawa, Tiverton, Kingston, Sudbury, and Thunder Bay.", "With a strong commitment to health, safety, and the protection of the environment, E.", "S.", " Fox Limited has earned a reputation as a people-first, environmentally conscious, socially responsible constructor.", "The Niagara Falls Corporate office is looking for dedicated, analytical and professional Computer Support Specialist to join the Information Technology team."]}, {"subtitle": "SUMMARY OF THE ROLE:", "body": ["The Computer Support Specialist will focus on providing backline or third level technology-related support for E.", "S.", " Fox Limited computer users.", " The position provides user support for all areas of IT including (but not limited to) applications, servers, access credentials, telecom, networking, data & electronic security and desktop/laptops/printers (and any other IT devices).", " In addition to the support related work, this position will also be required to perform IT project work as required."]}, {"subtitle": "KEY CUSTOMERS SERVED:", "body": ["All E.", "S.", " Fox Limited computer users.", "S.", " Fox Management.", "Project Managers and Project Staff.", "Some external customers/partners/vendors."]}, {"subtitle": "KEY RESPONSIBILITIES:", "body": ["Intel-based, Windows desktop & laptop users utilizing our standard software which includes , (but not limited to); MS Office; Project; Visio; Adobe; Symantec AV and BackupExec.", "Windows Operating Systems, including all aspects of a Windows based computer (printing, file-shares, security and networking configurations).", "Log all incoming problems into our work order tracking system and assign tasks or escalate as needed.", "Install/Update/Configure computers as per instructions from IT Operations Manager.", "Update and maintain IT Departmental computer files.", "Monitoring system performance of desktop/laptops, servers and networks.", "Performing desktop/laptop, device, application or server updates as required/assigned.", "Maintain Procedure Documentation (Runbooks), including providing basic user training and proactive support as required (e.", "g.", " showing the user how to do something properly).", "Provide Help Desk administration as required add/update work orders to keep all open Work orders current.", "Attend IT Department Meetings.", "Distribute reports, manage system printers (confidentiality required).", "Any other tasks assigned by the IT Operations Manager or Corporate IT Manager.", "Occasional travel to job sites and/or remote offices to provide Helpdesk support or deploy computers."]}, {"subtitle": "KNOWLEDGE AND EDUCATION REQUIREMENTS:", "body": ["Completion of a College level diploma or another similar type program in computer science, network administration, web technology or in a related field is required.", "Certification or training provided by software or hardware vendors is an asset.", "Knowledge and understanding of standard networking principles and protocols is an asset."]}, {"subtitle": "SPECIFIC EXPERIENCE AND SKILLS:", "body": ["Experience in Microsoft and end user software (as above) in a corporate environment is required.", "Minimal of two years in Computer related studies required.", "Experience with Microsoft servers and its components are an asset.", "Minimum of 3 years' experience working to support Windows-based computers in a corporate environment.", "Must be able to lift, carry and transport computers, IT Supplies and/or IT Devices."]}, {"subtitle": "PERSONAL ATTRIBUTES:", "body": ["Well Organized.", "Excellent Communicator.", "Team Player.", "Demonstrates Creativity, Initiative and Perseverance.", "Excellent Decision-making and Problem-solving Skills."]}]