[{"title": "ISL 18R - Service Desk Analyst"}, {"subtitle": "description", "body": ["Bring your technical expertise and your passion for customer service to this dynamic opportunity.", "The Information Management Branch (IMB) delivers a full suite of information management and technology services to the Ministry of Finance and Office of the Premier, as well as Government House, Ministers’ Offices, and a number of boards and commissions.", " In partnership with our clients, we deliver technology enabled business transformation; design, build and maintain business applications, operate the ministry’s service desk, and provide infrastructure planning, business process mapping, change management support, project management and investment planning as well as information technology security and privacy support.", " Although our work is centered on technology, our success comes from relationship building and a customer centric lens.", "As the Service Desk Analyst, you will provide Tier 2 technical support by receiving, diagnosing, and/or escalating service requests to resolve complex data and application problems.", "The capital of British Columbia, Victoria is a beautiful city, with beautiful beaches and harbours, and a variety of provincial parks to explore.", " Located on Vancouver Island, Victoria offers a bustling downtown scene and has a wide range of restaurants and entertainment venues to choose from.", " This is your opportunity to live in one of the most beautiful regions in British Columbia and work for the BC Public Service.", " We offer a healthy work/life balance, excellent benefits and much more.", "The BC Public Service is an award winning employer and offers employees competitive benefits, amazing learning opportunities and a chance to engage in rewarding work with exciting career development opportunities.", " For more information, please see What We Offer.", "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens.", " We acknowledge all Indigenous peoples on whose territories we work and play.", " We honour their connections to the land and respect the importance of the diverse teachings, traditions, and practices within these territories.", " Consider joining our team and helping us build an innovative, inclusive and rewarding workplace.", "For complete details about this opportunity, including accountabilities, please refer to the attached job profile.", " For specific position related enquiries, please contact Mindy.", "Corser@gov.", "bc.", "ca.", " DO NOT SEND YOUR APPLICATION TO THIS EMAIL ADDRESS.", " For more information about how to complete your job application, add/edit your resume and for more useful tips when applying for jobs, please refer to the Your Job Application page on the MyHR website.", " If you are still experiencing technical difficulty applying for a competition, please send an e-mail to BCPSA.", "Hiring.", "Centre@gov.", "bc.", "ca, before the stated closing time, and we will respond as soon as possible to assist you."]}, {"subtitle": "Job Requirements:", "body": ["In order to be considered for this position, your application must clearly demonstrate how you meet the education and experience as outlined below:.", "Diploma, certification or equivalent in the computer science field or a related field; OR.", "An equivalent combination of education and experience may be considered.", "Minimum 1 year experience providing customer support services in an information technology environment or helping end users to use and understand computer hardware and software.", "Applicants selected to move forward in the hiring process may be assessed on the Knowledge, Skills, Abilities and Competencies as outlined in the attached Job Profile located in the Additional Information section at the bottom of the posting."]}]