[{"title": "Operations Engineer"}, {"subtitle": "About Us", "body": ["Menlo Security's mission is enabling the world to connect, communicate and collaborate securely without compromise.", " COVID-19 has made our mission all the more real.", " We support customers across various enterprises including Fortune 500 companies, leading financial services, and the Department of Defense.", "The world has fundamentally changed.", " We are growing from 250 employees into the next phase of our journey, and we need passionate talent filled with empathy and agility.", "This position can be located anywhere in Canada."]}, {"subtitle": "About the team:", "body": ["Infrastructure Engineering is responsible for building and operating the Menlo infrastructure platform.", " Together we enable our customers to connect to the internet without compromise.", " Our environment spans 40+ datacenters and provides internet services globally.", " We expect failure, build security in by design, create evolvable systems and enable multi-tenancy across the infrastructure.", " Automation is an absolute.", "We are committed to getting it done properly, the first time.", "Experience building and running a high-transactional, 24x7 production environment.", "Experience with cloud services; multiple datacenters and public cloud (namely AWS).", "Sound knowledge and experience with general systems engineering.", "Experience with Linux and Linux kernel internals; configuration and tuning.", "Experience with systems configuration management and CI automation.", "Experience with networking, load balancing, caching, compression, application firewalling, smtp, proxy, SSL termination, systems and application security.", "Undergraduate degree in Computer Science or equivalent engineering experience."]}, {"subtitle": "Why Menlo?", "body": ["Our culture is collaborative, inclusive, and fun! We believe in open communication, supporting new ideas, and sharing a mutual mindset of what we're aiming to achieve together.", " There are also tremendous opportunities to take initiative, implement new ideas, and have a hand in building something great."]}, {"subtitle": "Benefits & Perks:", "body": ["Competitive compensation.", "Fast-paced team-oriented environment.", "Flexible work hours and work from home opportunities.", "Be part of a company that is truly changing the security industry!.", "All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability."]}]