[{"title": "Cybersecurity Incident Response Lead"}, {"subtitle": "Who are we?", "body": ["Founded in 1924, Irving Oil is a family-owned company with operations throughout Eastern Canada, New England and Ireland with a focus on providing exceptional service and high-quality products to our customers.", " Every day, we strive to put our good energy in action to bring families together, support the environment and local wildlife, and to create learning opportunities that empower the next generation."]}, {"subtitle": "Here's what you can expect from us", "body": ["When you're a part of our team, you'll see how we bring good energy to our business and our employees.", " Together, we will support our corporate strategy, high standards and the communities where we live and work.", " Our collaborative approach, commitment to diversity and inclusion along with our safety-first culture helps reinforce our internal brand position where People Matter.", " That's why we're dedicated to the development of our employees, so that they can reach their career goals."]}, {"subtitle": "What you can expect in a typical day", "body": ["As the Cybersecurity Incident Response Lead, you will provide subject matter expertise and thought leadership to the detection of potential threats, consumption of threat intelligence, vulnerability assessments, incident response and digital forensic investigations.", " You will also engage with stakeholders inside and outside IT as a key contributor to Cyber Incident Recovery planning and cross functional response processes."]}, {"subtitle": "What you’ll need to succeed", "body": ["Subject matter expert for SIEM (Security Information & Event Management) and security operation center.", "Subject matter expert for digital forensics and investigations.", "Experience maintaining a security incident response program.", "Experience gathering and actioning threat intelligence.", "Ability to recognize and effectively communicate issues to stakeholders; enable resolution.", "Experience planning and exercising cross-company response to and recovery from a cyber incident."]}, {"subtitle": "Professional skills", "body": ["Excellent analytical, problem solving and troubleshooting skills.", "Ability to quickly identify and mitigate problems.", "Proactive in identifying possible issues and putting actions in place to prevent issues.", "Able to navigate a fast-paced, ever changing environment that operates under tight deadline.", "Able to set priorities based on business and stakeholder need.", "Strong relationship building skills required.", "Strong communication skills, both written and verbal."]}, {"subtitle": "Education and experience", "body": ["10 - 15 years of experience in IT and cybersecurity.", "Post-secondary education in Computer Science, Information Technology, Information Systems, Networking, related fields, or equivalent experience.", "Experience with, Network Security, Remote Access, SIEM, and other similar areas: military or global enterprise incident response experience anasset.", "Relevant IT certifications such as CSSLP, CEH, CISSP, etc.", "Certifications in ITIL (Information Technology Infrastructure Library) an asset."]}]