[{"title": "Computer Support Specialist"}, {"subtitle": " description", "body": ["The Computer Support Specialist will identify and analyze computer support, hardware and application software problems and recommend/implement solutions.", " The successful applicant will assemble, deploy and maintain computers and various other peripherals including printers, monitors, scanners, projections units, as well as internal components such as disc drives, network cards and RAM.", " The Specialist is also responsible to install and test desktop operating systems and application software for users.", " The successful applicant will provide support services to staff such as computer consultation, advice and other supports to staff using personal computers to access various productivity and health information systems.", " The Computer Support Specialist will maintain users and systems in an environment including Microsoft Windows Server domains, terminal services remote access, Microsoft Exchange e-mail services, and hospital information systems such as Meditech, CRMS, PACs, etc.", " When required, the Specialist will provide on-call support for computer users throughout the region and will perform other duties related to computer and software support and operations for the Information Management & Technology Department.", " The successful candidate must demonstrate an awareness of and be responsible for promoting and supporting person-and family-centred care, demonstrate a commitment to safety and partner with all team members to improve worker and patient safety by integrating safety into work practices, identifying risks and implementing improvements."]}, {"subtitle": "Required qualifications:", "body": ["Graduation from high school with a diploma recognized by the Newfoundland and Labrador Department of Education and Early Childhood Development.", "Completion of an undergraduate degree in computer science or technical college diploma in an information technology program approved by Central Health with a minimum three years (2700 hour) duration.", "Minimum of two years' current (within the last four years) progressive experience in information technology.", "Valid, relevant MCP certification (like MCDST).", "Experience in the planning, deployment, and support of information technology in a healthcare environment.", "Current working knowledge of TCP/IP networking, security protocols, secure communication options and network-based services deployment and management.", "Demonstrated ability to work as a highly motivated, client-focused individual who can work independently and who possesses strong interpersonal, analytical, communication and organization skills.", "Demonstrated ability to establish and maintain effective working relationships with staff and exercise substantial judgment and autonomy to prioritize work orders.", "Ability to travel throughout the region.", "Consistent demonstration of Central Health's corporate values; Compassion, Accountability, Respect, Equity and Safety.", "A satisfactory record of work performance and attendance is required for this position.", "A satisfactory Certificate of Conduct from the RCMP or local police authority."]}]