[{"title": "Technical Analyst"}, {"subtitle": "Job Description", "body": ["At Richardson, the work we do is essential.", " Every day, we work together to ensure a steady food supply for people around the world.", " They count on us to perform our roles consistently and responsibly.", " For this important reason, we are committed to remaining operational throughout the COVID-19 pandemic.", " As always, we maintain a strong focus on safety and quality assurance.", "For more information about how we are taking additional precautions to protect the health and well-being of our candidates, colleagues, and customers, visit our Career Opportunities page.", "At Richardson International, being truly invested is at the heart of everything we do.", " For over 160 years, Richardson has been dedicated to Canadian agriculture.", " Recognized as a global leader in agriculture and food processing, Richardson is one of Canada’s Best Managed Companies.", " Headquartered in Winnipeg, Richardson has approximately 3,000 employees across Canada, the U.", "S.", " and the U.", "K.", " At Richardson, we are committed to enhancing our facilities and services and investing in our people and our communities.", "Working with Richardson opens the door to a world of possibility.", " We currently have an opportunity for a Technical Analyst to join our Information Technology department in our Winnipeg Head Office .", " As a member of the IT Service Desk team you will be responsible for providing excellent customer service and support to Richardson’s end users across the world."]}, {"subtitle": "Responsibilities:", "body": ["The design, implementation, administration, maintenance and support of all aspects of the end-user environment including:.", "Desktop hardware and software.", "Telecommunications.", "Web based applications.", "Printing, imaging and network connectivity.", "Participate in on-call support rotation.", "Assist in a variety of projects as assigned."]}, {"subtitle": "Qualifications:", "body": ["A degree or diploma in computer science or equivalent experience.", "Excellent communication and organizational skills.", "A positive attitude with the ability to work independently and as part of the team.", "Demonstrated knowledge of typical desktop hardware/software.", "Previous experience with MS Windows 10, MS Office 2013/2016, Linux, IOS, Android, eDir and iManager, GroupWise 2014/2018, ZCM 2017/2020, Anti-Virus, group policy and imaging is desired.", "Preference will be given to applicants with experience directly related to the particular position and products being used by the organization.", "Experience in any of the following would be an asset:.", "Wired and wireless network connectivity.", "VoIP, ShoreTel, Mitel, Apple, Android and Blackberry products.", "Certifications such as A+, CNE or MSCE.", "Richardson International provides an excellent compensation package consisting of competitive salary, pension, a flexible benefits plan and training and career development opportunities."]}]