[{"title": "Digital Applications Support Specialist"}, {"subtitle": "Job Description:", "body": ["KEY RESPONSIBILITIES:.", "Provide front line application support for NutriOpt (Trouw Nutrition’s Digitally Enabled Platform) and related Digital applications, including but not limited to training, training materials, documentation of operating procedures and user manuals.", "Act as an extension and in conjunction with the Global NutriOpt Service Center.", "First point of contact for external customers ensuring tickets and emails are followed up on and dispatched to the right persons and \\ or teams.", "Work with the Species Councils to learn more about the business & better support, train, and roll out these critical applications.", "Handle emails and Tickets (incidents, changes, requests) as agreed received into the NutriOpt support portal.", "Multi-task and manage multiple support calls meeting specific response times and deadlines.", "Participates in the development and execution of system implementation plans and solutions of the department.", "Assists to better structure support processes related to NutriOpt services.", "Analyses and reports regarding NutriOpt services to product owners/business.", "Supports the On-Boarding process where required.", "Implementing and maintaining knowledge management of NutriOpt Services and products.", "Participating in projects to streamline the transition of products and services to the support organization."]}, {"subtitle": "PREFERRED HIRING CRITERIA:", "body": ["Bilingualism (French/English) mandatory.", "Post-secondary academic qualifications in Business or Computer Science or equivalent disciplines;.", "Five (5) years of systems or support experience;.", "The candidate must be very client focused and possess the ability to analyze and resolve software problems quickly and efficiently;.", "Demonstrated organizational and analytical skills;.", "Outstanding approach to teamwork, collaboration and communication;.", "Ability to multi-task and effectively manage multiple support calls meeting specific response times and deadlines;.", "Self-directed worker with strong problem-solving skills;.", "Proven ability to document problem resolutions;.", "Adheres to the policies and procedures as outlined by the organization;.", "Exceptional interpersonal, negotiation and oral and written communication skills;.", "Prior experience in a food manufacturing environment is an asset;.", "Must be able to perform both individual and group training;.", "Ability to work independently in a dynamic, fast-paced environment;.", "Travel (10-15%)."]}, {"subtitle": "Our organisation:", "body": ["Trouw Nutrition is the global leader in innovative feed specialties, premixes and nutritional services for the animal nutrition industry.", " Trouw Nutrition provides species-specific nutritional solutions consisting of feed concepts, products and nutritional know-how.", " The unique combination of products, models and services Trouw Nutrition offers, boosts productivity and supports animal health through all life stages, contributing to our customers' peace of mind.", " Trouw Nutrition's nutrition solutions have met the need of farmers and home-mixers, feed producers, integrators and distributors.", " Trouw Nutrition has locations in 25 countries and around 5000 employees.", " Our mission is Feeding the Future."]}, {"subtitle": "Equal Opportunity Employer:", "body": ["Trouw Nutrition is an equal opportunity employer; applicants are considered for all roles without regard to race, color, religious creed, sex, national origin, citizenship status, age, physical or mental disability, sexual orientation, marital, parental, military status or any other status protected by applicable local law.", " Please advise us at any point during the recruitment and selection process if you require accommodation.", " Trouw Nutrition is committed to compliance with all applicable legislation, including providing accommodation for applicants with disabilities."]}]