[{"title": "IT Service Technician"}, {"subtitle": "Job Summary", "body": ["This position will be based out of our Surrey, BC location, reporting to the IT Helpdesk Manager.", " We are looking for a strong team player to provide technology related support and resolution to employees of the Flynn Group of Companies while maintaining a high level of quality and customer service."]}, {"subtitle": "Education and required Skills", "body": ["A self-starter, a passion for IT and the ability to work in a dynamic team environment and independently.", "Degree or diploma in Computer Science/Networking or equivalent work experience.", "3+ years related work experience.", "Microsoft or other industry certifications considered an asset.", "Proven analytical and problem-solving skills.", "Exceptional written and oral skills.", "Exceptional interpersonal skill."]}, {"subtitle": "Responsibilities", "body": ["Respond to telephone calls, e-mails, and other requests for technical support.", "Manage and prioritize multiple tasks.", "Focus on customer service and demonstrate courteous and professional behavior.", "Ensure that all support requests are appropriately logged, tracked, and monitored in the ticketing system.", "Demonstrate a consistent sense of urgency and follow-up on open issues to ensure a satisfactory and timely resolution is achieved as defined within the Service Level Agreement.", "Ensure the ongoing protection and integrity of the IT systems.", "Provide troubleshooting and technical analysis of computers, peripherals, software, telephony, and other issues as raised in the Service Tickets.", "Evaluate, recommend and implement solutions based on troubleshooting efforts.", "Automate processes and tests.", "Prompt escalation of tickets to the appropriate teams or individuals.", "Maintain and update inventory and receipts on all computer equipment.", "Must be available to work rotating schedules which include evenings, and some weekends and holidays."]}, {"subtitle": "Desired Qualifications", "body": ["Knowledge of computer hardware, networking, Active Directory, Exchange, software troubleshooting and installation, networked multifunction printer maintenance, telephony, and mobile phone configuration.", "Proficient with Windows 10, Server, and mobile device operating systems.", "Experience with client-side application and software support such as Microsoft 365 Apps and Services for Enterprise, manufacturing and engineering software (i.", "e.", " AutoDesk, BlueBeam), various collaboration solutions such as MS Teams.", " Familiarity with MS Dynamics SL and SAP SuccessFactors an asset.", "General knowledge of a range of diagnostic and logging tools.", "Develop methods and best practices for delivering outstanding service, as well as participate in knowledge sharing through the creation of knowledge base articles.", "Write-up of end user walk-through/how-to documentation for all technologies supported by the IT team.", "Technical writing to document processes and procedures for systems supported by the IT team.", "Ability to maintain devices using SCCM/Intune.", "Ability to maintain and administer WSUS across all branches.", "Ability to package various applications for deployment using SCCM and other deployment tools.", "Produce Power Shell scripts for various purpose."]}]