[{"title": "IT System Analyst"}, {"subtitle": "description", "body": ["Powered by state-of-the-art fibre optic and wireless networks, Eastlink delivers world-class video entertainment and communications services to residential, business and public sector customers across Canada.", " As one of Canada’s Best Managed Companies for 11 consecutive years, Eastlink provides high speed Internet, wireless, TV, telephone, security and automation, data communications and exclusive, locally-produced programming.", " Headquartered in Halifax, Nova Scotia, Eastlink is the largest privately owned telecommunications Company in Canada with an employee base of just over 1500 individuals.", "The System Analyst will be a key member of the Eastlink Business Applications team.", " The System Analyst will focus on service management and workflow development/implementation.", " They will also provide support for cloud applications, ensuring security best practices are followed.", "They will work with groups across the business to identify and adapt existing processes into IT service management workflows.", " The individual will monitor key metrics to ensure applications are well maintained to deliver quality service to internal and external customers.", " The role will provide a high level of technical escalation in troubleshooting and resolution of complex and/or critical outages as well as accept the ownership of the issue until it is resolved."]}, {"subtitle": "Responsibilities:", "body": ["Perform ITSM systems development, design and implementation.", "Analyze services and user feedback to continuously improve ITSM applications.", "Troubleshoot and resolve outages.", "Work with other groups within Eastlink to support their business requirements and projects initiatives.", "Stay abreast of the latest technical advancements, market trends and competitive pressures.", "Prioritize operational, planning and development work to ensure that the most important issues are resolved accordingly."]}, {"subtitle": "Qualifications", "body": ["Post-secondary education in a relevant field (Computer Science, Data Communications/Networking, Information Technology) or equivalent industry experience.", "Minimum 3+ years relevant experience in one or more of the following areas; Scripting Languages, ITIL/ITSM, ServiceNow administration, System Administration, and Request Tracker (RT).", "Advanced level understanding of:.", "Active Directory/LDAP/SAML.", "Data Modeling and Data Science principals.", "Linux and Windows Operating Systems.", "Networking.", "SSL/TLS.", "Any of the following certifications will be considered an asset but not strictly required:.", "ServiceNow Certified System Administrator (CSA) or any other ServiceNow training.", "ITIL Foundation certification or higher."]}, {"subtitle": "The Ideal Candidate:", "body": ["Strong analytical skills and tactically focused.", "Excellent communicator.", "Team oriented, but able to work independently.", "Entrepreneurial approach and mindset – proactively looks for ways to improve service/efficiency/reliability etc.", "Deep technical understanding of the work.", "Takes ownership of problems and tasks.", "Calm under pressure.", "Customer service oriented with an ability to respond to changing organizational priorities."]}]