[{"title": "Jr. System Design Analyst- Contract"}, {"subtitle": "In the role", "body": ["Assist in methodically testing, supporting and implementing all new banking modules and interfaces.", "Work with the System Design Analyst to gather and document detailed Business Requirements to meet business needs.", "Work with Developers in documenting specifications for the build of prototypes.", "Assist in actively gathering and documenting all Temenos specifications.", "Systematically conduct usability testing with the support of a System Design Analyst.", "Help to consistently create and implement support documentation.", "Be involved with Vendor Issue Management and provide support which can include the maintenance of issue logs.", "Build excellent working relationships with vendors and manage any vendor issues that arise.", "Use project management methodology to support various IT initiatives.", "Provide outstanding customer service during all internal and external client interactions.", "Enjoy staying ahead of current industry trends and new technologies that can add value to the business.", "Be part of the bigger team and aid in second and third line technical support when needed.", "Consider health & safety as a primary concern to ensure the safety of self and others.", "Perform other duties as required."]}, {"subtitle": "Within your skills and qualifications, you will…", "body": ["Be proud of your post-secondary diploma or degree in business, computer science or equivalent in a related program.", "Be quick to respond to requests for service from all of your clients in a manner which is clearly understood, both technically and user-friendly.", "Enjoy a challenge when it comes to technical issues and be resourceful in the way you find a solution.", "Be naturally innovative and forward thinking.", "Be analytical and overly detailed oriented when dealing with technical support issues and IT projects.", "Openly share your knowledge with the team."]}, {"subtitle": "Our Story", "body": ["Our emphasis on service means we’re constantly searching for new team members whose dedication to helping people is as powerful as their ambition to succeed.", " We’re committed to providing professional development, and to extending employee activities beyond day-to-day operations to support the communities where we’re located.", " Our people are the difference, it’s a part of why we love coming to work.", "If this sparks your interest and you demonstrate high levels of integrity and credibility, we should talk.", " Check out our website for the full job description and prepare your cover letter and resume listing your experience, qualifications, and submit your resume.", "We appreciate all who express interest; however, only those selected for an interview will be contacted.", " No phone calls please.", "FirstOntario Credit Union will provide accommodations for persons with disabilities, where needed, to support their participation in our recruitment process."]}]