[{"title": "I.T. Systems Administrator"}, {"subtitle": "Career Opportunity: I.T. Systems Administrator", "body": ["About the Immigration Consultants of Canada Regulatory Council (ICCRC).", "ICCRC is the national regulatory body that promotes and protects the public interest by overseeing licensed immigration and citizenship consultants and international student advisors.", " ICCRC establishes effective policies, practices, and procedures to regulate and educate immigration professionals.", "Do you want to be part of a team that strives to improve the quality of Canada’s fast-growing immigration/citizen consulting profession? If you share our passion and purpose, please consider applying to the opportunity below to become part of a team that makes a difference.", "ICCRC is looking for a technically savvy and solutions focused I.", "T.", " Systems Administrator to respond to escalated tickets from our level 2 I.", "T.", " support requests.", "Our ideal candidate is a strong communicator with exceptional I.", "T.", " help desk skills."]}, {"subtitle": "Responsibilities Include (but are not limited to):", "body": ["I.", "T.", " Troubleshooting & Support (Level 2).", "Provide level 2 I.", "T.", " support to users through the research and resolution of I.", "T.", " tickets.", "Guide users through solutions through in-person, remote, phone and e-mail technical support.", "Manage assigned tasks and work requests through the I.", "T.", " ticketing system.", "Contribute to I.", "T.", " disaster recovery sessions and solutions.", "Provide backup to Level 1 support.", "Support and troubleshoot network, printers, servers and computers and systems."]}, {"subtitle": "Equipment Administration", "body": ["Assist with system maintenance and upgrades.", "Monitor, manage and maintain servers, end-user computer system resources, updates and or patches, security and networks.", "Assist in the decommission and retiring of equipment including data migrations to new systems.", "Perform system security audits.", "Ensure inventory maintenance and controls to support effective, onboarding, offboarding and PC failures.", "Maintain Inventory management for office furniture and technology assets."]}, {"subtitle": "User Account Management", "body": ["Maintain and manage an up to date inventory of installed software and licenses assigned to each user.", "Schedule and complete routine system maintenance.", "Coordinate employee onboarding / offboarding procedures."]}, {"subtitle": "Knowledg & Experience Required", "body": ["Degree/Diploma in Computer Science, Computer/Software Engineering, or a related discipline.", "4+ years I.", "T.", " Service desk experience.", "·Experience working on Servers, Cloud environments, Networks and repairing computers.", " Certified in one or more of the following is an asset: Comptia A+, Network+, Server+ or Cloud+.", "Strong hardware and software troubleshooting skills.", "Strong Microsoft operating systems and suite functionality and troubleshooting ability; MCSE certified is an asset.", "Experience in IT security.", " Certified in one or more of the following is an asset: Comptia Security+, CySA+ or Certified Ethical Hacker (CEH).", "Knowledgeable and experienced using VmWare or virtual machines.", "·Strong utility software technical knowledge such as Antivirus programs, Adobe Reader, etc.", "Certified in ITIL is an asset.", "·Strong Network / VPN / Internet connectivity skills.", "Strong computer literacy, including word processing software, spreadsheet functions, database use and Internet search capabilities.", "A proactive and forward-thinking approach to work.", "Strong communication skills both verbally and written.", "Strong ability to interact professionally and respectfully with others.", "Strong decision and problem-solving skills with a consultative approach.", "Strong ability to contribute effectively independently and in a team environment.", "Strong ability to operate in a dynamic work environment that requires flexibility, multi-tasking and prioritizing of demands and commitments.", "Fluency in French is a strong asset."]}]