[{"title": "Systems Analyst II"}, {"subtitle": "Responsibilities:", "body": ["Provides support for endpoint computing systems, peripherals, and software, including all aspects of desktop technologies and cellular devices.", " Helps with the configuration and deployment of all networked printers.", " Includes add, moves and changes to desktop systems and peripherals.", "Helps with the administration, configuration and maintenance of the incident logging system.", " Identifies and implements improvements to the incident logging system to provide a more effective and efficient service to customers.", " Identifies problems that users are experiencing and aids the department in implementing fixes.", " This includes answering Tier 1 and Tier 2 support calls, logging them appropriately within the incident logging system and consulting with other team members to provide best customer support.", "Aids with research, planning, evaluating and recommending products, services and standards that relate to the endpoint computing and peripheral systems (desktops, laptops, printers, etc).", " Also includes helping with the regular deployment of new and upgraded endpoint devices.", "Manages the endpoint inventory and consumables.", " Creates and maintains relevant documentation.", "Provides users with advice and training as needed to assist users in using the County’s information technology systems and other duties as assigned."]}, {"subtitle": "Qualifications:", "body": ["1-2-year Diploma or Degree related to Computer Science;.", "Industry recognized technology certifications such as A+, Network+, ITIL Foundations, MCSE/MCSA, etc.", "1-2 years of related experience.", "Knowledge of Windows desktops and Microsoft environments in a medium sized environment.", "Knowledge of Office 365 applications (OneDrive, SharePoint, Teams, etc).", "Active Directory administration – Group Policy, computer and user management.", "Basic understanding of project management and budget processes or best practices.", "Working knowledge of Microsoft Windows, Microsoft Office, desktop and laptop hardware, mobile devices (cell phones and tablets) and basic network troubleshooting.", "Ability to remotely support and troubleshoot problems with non-technical users over the telephone and email.", "Must possess excellent interpersonal, communication and analytical problem solving skills.", "Strong organization skills with an exceptional ability to multi-task.", "Must have strong customer service skills and communications skills with the ability to act in a polite and professional matter at all times.", "Be willing to continually learn, try new ideas and recommend changes to improve processes.", "Ability to prioritize, meet deadlines and manage changing priorities.", "Have the ability to work well under pressure due to the critical nature of the information technology system.", "Must be able to work within a small team environment by helping other team members and asking for help when needed.", "Class 5 drivers’ license.", "Successful candidates will be required to provide a criminal records check including vulnerable sector, child welfare intervention check and a driver’s abstract."]}]