[{"title": "Microsoft 365 Applications Analyst"}, {"subtitle": "Who are we?", "body": ["Founded in 1924, Irving Oil is a family-owned company with operations throughout Eastern Canada, New England and Ireland with a focus on providing exceptional service and high-quality products to our customers.", " Every day, we strive to put our good energy in action to bring families together, support the environment and local wildlife, and to create learning opportunities that empower the next generation."]}, {"subtitle": "Here's what you can expect from us:", "body": ["When you're a part of our team, you'll see how we bring good energy to our business and our employees.", " Together, we will support our corporate strategy, high standards and the communities where we live and work.", " Our collaborative approach, commitment to diversity and inclusion along with our safety-first culture helps reinforce our internal brand position where People Matter.", " That's why we're dedicated to the development of our employees, so that they can reach their career goals."]}, {"subtitle": "What you can expect in a typical day:", "body": ["The Microsoft 365 Applications Analyst works in partnership with the administrators, users, customers and technical teams.", " This role collaborates across the company to evaluate, recommend and develop solution alternatives, improve system usability through automation, and strengthen our data architecture and integrity.", " Applying development best-practices, this role directly contributes to digital growth opportunities and operational enhancements.", " This is a hands-on role that requires significant technical experience and ability to remain current on industry best practices, and technologies (including cloud technologies)."]}, {"subtitle": "What you’ll need to succeed:", "body": ["Build functionalities in a sandbox, unit testing, apply bug fixes, and deploy.", "Pro-actively work with the user community to ensure appropriate levels of support are given, problems are resolved in a timely way, and enhancements are prioritized improvements to support the business.", "Monitor operational performance, implement changes, and apply updates when required.", "Analyze requirements to determine appropriate solution designs considering capabilities, limitations, and design trade-offs.", "Define and apply change management standards for sandbox testing, promotion to production, and operational controls.", "Document business requirements, specifications, process flows, application designs, application configuration, testing and release management.", "Be proactive in keeping aware of new developments and technologies within the Microsoft 365 platform.", "Design, develop and deliver key components of Microsoft solutions.", "Implement automated workflows, together with development of BI dashboards.", "Provide technical direction and leadership for implementations and daily monitoring activities.", "Apply proven communication, analytical, and problem-solving skills to help maximize the benefit of IT system investments."]}, {"subtitle": "Professional Skills:", "body": ["Client focused with excellent customer service skills.", "Strong relationship building skills.", "Good listening skills.", "Strong oral and written communication skills.", "Able to find solutions that fix an issue for the long term – resolution focused.", "Sense of urgency, adaptable and flexible to changing priorities.", "Proactive and can act independently to solve issues while keeping other team members informed.", "Able to work independently while working with a larger team."]}, {"subtitle": "Education and Experience:", "body": ["Post-secondary education in Computer Science, Business, or related field.", "Min.", " of 3 years development specifically with Microsoft 365 platform.", "Experience with SharePoint Online, Power Automate, Power Apps, Power BI.", "Experience with implementing Taxonomy, Metadata in SharePoint 2013, 2016 or Online (content management, collaboration, SPFx custom web parts, Microsoft Search, and features).", "Experience using Power BI reporting tools.", "Knowledge of Power Shell scripting.", "Experience in creating custom applications using entire Microsoft suite (Power Apps, SharePoint Online, Power BI)."]}, {"subtitle": "Job Requirements - Work Experience", "body": ["Information Technology."]}, {"subtitle": "Job Requirements - Education", "body": ["Bachelors: Computer and Information Science."]}]