[{"title": "System Administrator"}, {"subtitle": "description", "body": ["Powered by state-of-the-art fibre optic and wireless networks, Eastlink delivers world-class video entertainment and communications services to residential, business and public sector customers across Canada.", " As one of Canada’s Best Managed Companies for 11 consecutive years, Eastlink provides high speed Internet, wireless, TV, telephone, security and automation, data communications and exclusive, locally-produced programming.", " Headquartered in Halifax, Nova Scotia, Eastlink is the largest privately owned telecommunications Company in Canada with an employee base of just over 1500 individuals.", "This position will be a work from home position and may transition back into the office on 6080 Young Street, Halifax, NS.", " As part of the IT group, the System Administrator will be responsible for a wide variety of activities relating to the management and maintenance of multiple IT systems and platform products/applications which help deliver Eastlink’s solutions and other valued services.", " Working within a primarily virtualized Linux platform (knowledge and experience with Windows considered an asset), the System Administrator participates in day-to-day installation, configuration and administration of hardware and software systems over a LAN/WAN architecture.", " This role is essential in effectively troubleshooting software and hardware problems, while identifying, implementing and documenting system fixes.", " The Systems Administrator also provides support for operational issues including problem solving, root cause analysis and technical and process recommendations for improvement, and proactively monitors systems performance and status to maintain the service infrastructure and prevent outages.", " System and data file backups/maintenance, recovery of applications and data, and regular system integrity monitoring are also key.", "As the ideal candidate, you are an analytical, creative thinker who enjoys taking initiative, exercises an entrepreneurial approach to their work, and are able to effectively respond to changing organizational priorities within a fast paced, dynamic work environment.", " Highly customer focused, you are a strong communicator, comfortable with cross-departmental interaction in addition to being an autonomous, ambitions contributor, eager to learn and adapt to new, changing technologies."]}, {"subtitle": "Qualifications:", "body": ["Post-secondary education focused in Computer Science, Data Communications/Networking, Information Technology or a related field.", "3-5 years of experience developing and/or administering Operational Support Systems.", "Demonstrated experience and understanding of Linux; Windows experience considered an asset.", "Experience working with the following technologies is preferred:.", "System Monitoring (IDS, Patching and Vulnerabilities);.", "System Programming and Scripting (Python, UNIX Shells);.", "Common Open Source tools and applications;.", "VMware vSphere and SAN technology;.", "Managing system backups and restores.", "Red Hat Middleware (JBOSS).", "Strong internetworking knowledge;."]}, {"subtitle": "Why Choose Eastlink?", "body": ["Eastlink brings you technology in a way that people would want it.", " We work hard to provide the best products – Internet, TV, Wireless, Telephone, and Security and Automation – to keep our customers connected to the things and people that matter the most.", " By putting our customers and their needs at the centre of it all we can show them something special and provide a unique brand experience.", "We are extremely proud of our employees and believe the best people make the best companies.", " As we continue to grow, our goal is to continue to attract the best people.", "Dedicated to representing all of the customers we serve, we embrace diversity throughout all levels of the organization and encourage members of equity groups to self-identify during the application process."]}]