[{"title": "Bluetooth Software Engineer"}, {"subtitle": "description", "body": ["Garmin Canada’s Connected Technology team has an exciting opportunity for a full-time Senior Embedded Software Engineer who is passionate about Bluetooth technology and wireless connectivity solutions.", " Bluetooth enables compelling customer features in Garmin products such as connected widgets and apps on a smartwatch, seamless integration with mobile phones, interacting with IoT systems, and real-time collection and analysis of fitness data from wearables and other sensors.", "As a Senior Software Engineer working on Bluetooth Low Energy / Bluetooth Smart (BLE) you will:.", "Design, implement, debug, and optimize high-quality BLE solutions:.", "Implement new features, architecture, subsystems, and software modules.", "Lead problem solving efforts to improve performance and reliability.", "Investigate complex field issues and create interoperable solutions.", "Integrate, maintain, and contribute to 3rd party and open source software projects.", "Improve and tailor vendor drivers, stacks and applications to our needs.", "Work directly, as a technology expert, with all Garmin product segments including Outdoor, Fitness, Marine, Consumer Automotive, and Portable Aviation to support product features related to BLE:.", "Verify performance through testing and data analysis.", "Evaluate designs for performance, maintainability, and potential security issues.", "Participate in code and design reviews, giving and receiving detailed feedback with other engineers.", "Work with the electrical engineering teams to ensure the best hardware and RF architecture is in place to support a superb customer experience.", "Support compliance and certification activities including Profile Test Suite (PTS) testing, Qualified Design ID (QDID) inspection, and profile version analysis.", "At Garmin Canada, we create more than just products – we inspire solutions and innovations that change and shape how we live, work and play.", " You’ll get to work alongside top talent from around the globe while working on cutting-edge products and enabling compelling ecosystems with ultra-low power wireless technology.", " Here’s why you want to work for us:."]}, {"subtitle": "You’ll bring products to life.", "body": ["Our advanced technology promotes performance, safety and ease of use in every market we serve.", " Become a key contributor to our exciting portfolio of Garmin products and help us bring our devices from concept to market."]}, {"subtitle": "You’ll love the location.", "body": ["Nestled in the foothills of the Rocky Mountains, we’re located just 15-minutes outside of Calgary in Cochrane, Alberta.", " A retreat from fast-paced cities - Cochrane allows us to build relationships with the community and focus on what we do best – creating innovative solutions for unique use-cases in the ultra-low power wireless and sport industries.", " With many other tech companies calling Cochrane home, we can’t think of a better place to be!."]}, {"subtitle": "You’ll love our office culture.", "body": ["Company BBQs, active sports, casual dress, volunteer opportunities, social committee organized events and the occasional sneak peak of new release movies (Star Wars, anyone?) allows team members to get to know each other outside the office."]}, {"subtitle": "You’ll receive fantastic benefits.", "body": ["Opportunities for professional development, no waiting period for vacation or our extensive benefit plan, RRSP matching, stock purchase options, product discounts and flexible work schedules are available for all team members."]}, {"subtitle": "You’ll be part of something big.", "body": ["Our open concept, open door policy office supports a fun, collaborate and supportive work culture.", " All our team members, regardless of their team, are encouraged to think big and share their ideas.", " Our team members are innovators, solution creators and outside-the-box thinkers ready to take on any challenge.", "Bachelor’s degree in Computer Science or Computer Engineering with a cumulative GPA greater than 3.", "0, and a minimum of 5 years relevant software development experience, which must include:.", "Proficiency in writing software in C and C++.", "Hands-on BLE focused software development on embedded systems.", "Debugging the BLE protocol over-the-air with protocol analyzers.", "Collaborative software development in a team environment.", "Debugging complex problems on embedded systems."]}, {"subtitle": "Other desirable skills and experience include:", "body": ["Detailed knowledge of the Bluetooth specification.", "Utilizing Bluetooth on devices to communicate with apps on iPhone and Android platforms.", "Integrating and maintaining 3rd party software packages (e.", "g.", " SDKs).", "Identifying system and software security risks.", "Working on projects with teams distributed across multiple sites.", "Experience with Agile development practices."]}]