[{"title": "Expert Solution and System Integration Cloud"}, {"subtitle": "description", "body": ["The role of Expert Solution and System Integration is responsible for the successful deployment of advanced infrastructure, telecom, Industrial IoT, software development, application, and technology solutions, systems and services.", " The Expert ensures that all business requirements are met by team members and projects, and contributes to the global evolution of CN’s I&T.", " The Expert is a key player in the team, ensuring the technology delivered is secure, reliable, available, resilient, performant, and aligned with safety standards per business requirements.", " As an Integration Expert for Cloud solutions, you will have a key role on all technical aspects within IT projects.", " Working in collaboration with solution architects, you will participate in the design and implementation of cloud based solutions (SaaS & IaaS/PaaS) with CN IT infrastructure.", " Your objective is to make it seamless and transparent to a CN employee to use those solutions."]}, {"subtitle": "Integration", "body": ["Contribute to the technical solution architecture by identifying the existing capabilities in the domain of Security, Single sign-on, access management, networking and data exchange.", "Translate the technical solution architecture into a detailed infrastructure and technology components design, and ensure the seamless integration of all components.", "Work in collaboration with project managers to define work breakdown structure, estimate project effort and project schedule.", "Guide various SME through technical design propositions and specifications, and address any potential design or support issues.", "Develop stabilization and knowledge transfer plans to the various support teams.", "Present and explain designs/solutions per new project to different stakeholder groups.", "Participate and facilitate Security foundation programs (governance, process.", ").", "Participate in vendors selection qualifying technical aspects of their solutions.", "Guide other Integrator(s) and help address potential and current with them.", "Coordinate installation with technicians in the field, or with business owner for maintenance windowFor support issues during project migration or deployment, determine appropriate resolution/solution through root cause analysis and impact analysis.", "Transition-to-core: update of documentation, systems, training, and presentation.", "Define and maintain engineering and configuration standards.", "Apply, and ensure compliance with, all appropriate CN I&T standards (e.", "g.", " Security, Architecture, Project Delivery Methodology, SOX, Telecom, Software Engineering, etc.", ").", "Engage external providers and work with Business Planning, Supply Management and Legal teams in the context of procuring delivery and / or support services of existing or new services.", "Manage the roadmap (hardware & software) with the vendor based on CN strategy & I&T technology needs.", "Estimate overall solution costs and share information with Project Managers and stakeholders.", "Create technical diagrams and documentation for the solution.", "Work with Project managers during the planning phases and identify deployment steps and risks.", "Follow the Change and Release Management processes by initiating Change Controls and executing cut-over plans.", "Pre-configure and lab-test all required components during deployment.", " Document tests and log results."]}, {"subtitle": "Education/Certification/Designation", "body": ["Bachelor’s degree in Business, Computer Science, Compuer Engineering, Electrical Engineering, a related field of study, or equivalent work experience."]}, {"subtitle": "Skills/Knowledge", "body": ["Ability to precisely estimate efforts of the tasks assigned to the integrators.", "Ability to work on multiple projects in parallel and meet deliverables dates.", "Very good technical documentation skills.", "Very good communication, influencing and presentation skills.", "Leadership skills and ability to influence and guide others on integration and technical matters.", "Proven experience delivering technology projects involving multiple parties.", "Proven experience with IP protocols and technologies.", "Knowledge of IT security principles.", "Ability to clarify requirements and insure solution meets business needs.", "Strong systems engineering knowledge.", "Ability to estimate efforts and costs required for delivery.", "Strong sense or prioritization for meeting deadlines."]}, {"subtitle": "Technical Skills/Knowledge", "body": ["Microsoft AD Federation Services (ADFS).", "Microsoft Azure cloud platform.", "Google Cloud Platform.", "3rd party SaaS solutions.", "Security Best Practices Implementation (Cloud solution security assessments.", ").", "Strong knowledge of major cloud platforms (Azure, AWS, GCP…).", "Strong knowledge of authentication/SSO protocols (SAML, Kerberos, LDAP, Radius…).", "Strong knowledge of Microsoft Active Directory (AD, ADFS, AD LDS).", "Strong knowledge of networking and internet protocols (IP, HTTPS, PKI, Firewalls, PKI).", "Strong leadership to bring the team to work and interact with other teams.", "Process driven (improve existing team process and build new ones when required).", "Good business relationship.", "Excellent French and English (spoken and Written).", "Infrastructure as Code DevSecOps."]}, {"subtitle": "Experience", "body": ["10+ years of Solid general knowledge of IT infrastructure and networking.", "3-5 years experience in design and implementation of Cloud based solutions and practices.", "Continuous learning to keep up to date with latest technology innovations and roadmaps related to Security technologies & IT Infrastructure in general."]}]