[{"title": "System Development Engineer II"}, {"subtitle": "description", "body": ["BS in Computer Science or related.", "5+ years of industry experience.", "Programming in Ruby and/or Java in Linux and/or Windows environment.", "Experience building in scalable infrastructure software or distributed systems for commercial online services.", "Experience with AWS services EC2, EBS, RDS, SWF, etc.", "Experienced in leadership role in an engineering environment in driving operational excellence and best practices."]}, {"subtitle": "Overview and Responsibilities:", "body": ["Come join the AWS Marketplace team in our mission to change the way enterprise software is sold for the cloud! AWS Marketplace is the enterprise software \"app store\" for AWS, and we're building a unique new channel for selling and buying software of all kinds.", "The AWS Marketplace Seller Self-Service Team is looking for a Systems Engineer to dive deep into the technical intricacies of the products we sell on AWS Marketplace.", " As a member of the team, you'll be responsible for system level analysis on products we ingest into our catalog, working with our Seller and Catalog Operations team to coordinate and resolve technical seller-facing problems, adding scans and improving our product scanning system with the engineering team, and help drive the future of scanning automation.", " However, your responsibilities don't end there! We're a small team with a brand new product for technical users, and your insight and influence over our strategy, business objectives, and roadmap will be critical to our success.", "In this role, a commitment to team work, hustle, and strong communication skills (to both business and technical partners) are absolute requirements.", " You should have a deep systems-level understanding of various operating systems, Linux and Windows-based, with a strong preference towards their interactions in a cloud enviroment.", " You will be scoping technical problems between the seller and AWS Marketplace, while scripting to automate the most common use-cases.", " Finally, you should have a track record of maintaining high standards for a team across all dimensions."]}]