[{"title": "Specialist Solution and System Integration, Cellular"}, {"subtitle": "description", "body": ["The role of Specialist Solution and System Integration is responsible for the successful deployment of advanced Cellular Access infrastructure, systems and services.", " The Specialist ensures that all business requirements are met by team members and projects, and contributes to the global evolution of CN’s I&T.", " The Specialist is a key player in the team, ensuring the technology delivered is secure, reliable, available, resilient, performant, and aligned with safety standards per business requirements."]}, {"subtitle": "Main Responsibilities", "body": ["Engage with customers to capture requirements.", "Translate the technology solution architecture into engineering standards & specifications.", "Work with Project managers during the planning phases and identify deployment steps and risks.", "Engage external providers and work with Business Planning, Supply Management and Legal teams in the context of procuring delivery and / or support new or existing services.", "Estimate overall solution costs and share information with Project Managers and stakeholders.", "Establish test plans for newly defined solutions and conduct lab testing.", "Based on blueprint and test results in the lab, create Detailed / Functional Design.", "Establish deployment/migration strategy and guide project team and operations.", "As required travel to visit field sites and inspect installations.", "Guide other Integrator(s) and help address current and potential challenges.", "Coordinate installation with technicians in the field and/or with business owner.", "Provide support during project migration or deployment, and in case of issues determine appropriate resolution/solution through root cause analysis and impact analysis.", "Conduct Service Introduction to Operations: update documentation, systems, training and presentation.", "Apply, and ensure compliance with all appropriate CN I&T standards (e.", "g.", " Security, Architecture, Project Delivery Methodology, SOX, Telecom, Software Engineering, etc.", ").", "Manage the roadmap (hardware & software) with the vendor based on CN strategy & I&T technology needs.", "Follow the Change and Release Management processes by initiating Change Controls and executing cut-over plans."]}, {"subtitle": "Technology Specifics", "body": ["Minimum 5 years of relevant technical experience in design and implementation of Cellular Access end-to-end solutions.", "Expertise in Data Cellular technologies (GSM 3G, 4G, LTE).", "Expertise in LAN/WAN technologies (Complex Routing BGP, IS-IS, DMVPN, Switching, QoS (Marking, Queuing).", "Strong knowledge of cellular coverage assessment, bandwidth management and end user experience, RSSSI, RSRP, RSRQ, etc.", ").", "Experience with cellular antennas engineering and performance in live environments.", "Good understanding of Cellular QOS.", "Good knowledge of M2M and IoT over cellular.", "Good understanding of Security (Zoning, VLAN, VPRN, IPS/IDS, etc.", ").", "Assets:.", "Technical certifications (e.", "g.", ", Cisco CCNP – CCIE).", "Good understanding of WiFI technology."]}, {"subtitle": "Education/Certification/Designation", "body": ["Bachelor’s degree in Business, Computer Science, Computer Engineering, Electrical Engineering, a related field of study, or equivalent work experience."]}, {"subtitle": "Skills/Knowledge", "body": ["Ability to precisely estimate efforts and costs of a given project.", "Ability to work on multiple projects in parallel and meet deliverables dates.", "Very good technical documentation skills.", "Very good communication and presentation skills.", "Leadership skills and ability to influence and guide others on technical matters and methodology.", "Proven experience delivering technology projects involving multiple parties.", "Ability to clarify requirements and insure solution meets business needs.", "Strong sense or prioritization for meeting deadlines."]}, {"subtitle": "Working Conditions", "body": ["This role may require occasional business travel in accordance with CN policy for meetings.", "This role supports a 24/7 environment.", "Field sites visits for deployment activities or to attend industry events or conferences."]}, {"subtitle": "About CN", "body": ["CN is a world-class transportation leader and trade-enabler.", " Essential to the economy, to the customers, and to the communities it serves, CN safely transports more than 300 million tons of natural resources, manufactured products, and finished goods throughout North America every year.", " As the only railroad connecting Canada’s Eastern and Western coasts with the Southern tip of the U.", "S.", " through a 19,500 mile rail network, CN and its affiliates have been contributing to community prosperity and sustainable trade since 1919.", " CN is committed to programs supporting social responsibility and environmental stewardship.", " At CN, we work as ONE TEAM, focused on safety, sustainability and our customers, providing operational and supply chain excellence to deliver results."]}]