[{"title": "Technology Professionals, Operational Support"}, {"subtitle": "Job Summary", "body": ["The Canadian Security Intelligence Service (CSIS) is looking for technical professionals who thrive on tackling diverse challenges in a unique environment.", " Working in teams, the ideal candidate will directly contribute to operations via the timely delivery of technical solutions in support of the CSIS mandate.", "You will have the opportunity to contribute and influence project deliverables that support technical operations, including the collection, processing, and analysis of data in support of CSIS’ investigations.", "Successful candidates will benefit from continuous learning where your technical skills will be developed, maintained and enhanced.", " In addition, you will be exposed to specialized security intelligence related technologies, systems and equipment.", "Once you have established yourself at CSIS, your experience can lead to unique and exciting opportunities not available in the private sector.", "If you are up to the challenge and join one of our high performing teams, there is no doubt that your contributions to CSIS will have a meaningful and direct impact in our mission to keep Canada safe.", "As a technology professional, you will:.", "Develop standardized operating procedures and methodologies for the deployment of technical capabilities.", "Lead technical collection, evaluate and test technical capabilities and deploy various technical equipment and solutions.", "Assess and/or contribute to operational plans to identify associated risks and offer alternate solutions.", "Provide technical advice in the planning and conduct of technical operations.", "Train and provide guidance to new technical officers.", "Collaborate with partners both domestic and abroad to advance capabilities.", "Leverage stakeholders and ensure continuing cooperation.", "Maintain technical knowledge and operational readiness; stay current on technical collection capabilities and best practices.", "Adhere to established methodologies and ensure compliance with policies and authorities governing conduct of operations."]}, {"subtitle": "Education", "body": ["Undergraduate or Master’s degree in a related field and three (3) years of related experience.", "Underfill – one (1) year of related experience.", "Technologist diploma or Professional technologist equivalency designation and four (4) years of related experience.", "Underfill – two (2) years of related experience.", "Related field - Computer science, electrical, electronics, network security, telecommunications or similar engineering disciplines.", "The educational program must be from an accredited learning institution recognized in Canada.", "If you completed a program outside of Canada you will be required to obtain proof of a Canadian equivalency at your expense through a recognized credential assessment service.", "Note: Any higher level of education could be recognized as experience."]}, {"subtitle": "Experience", "body": ["Related experience is defined as recent* and significant** experience in each of the following:.", "in providing advice and guidance with respect to the design, deployment and maintenance of technical solutions.", "implementation of technical solutions which require system integration.", "supporting, maintaining and/or performing troubleshooting activities for software and/or systems.", "Candidates must also possess recent* experience in at least two (2) of the following areas:.", "Programming languages such as C, C++, C#, Java, Go, Perl, Python, Bash, Javascript, Lua;.", "Analog/digital design and circuits;.", "Antennas and RF Signal propagation;.", "Telecommunications networks (VoIP, Wifi, Wireless, ADSL/Cable);.", "Telecommunications standards and protocols (SS7, SIP);.", "Network security, infrastructure support, network protocols;.", "Virtualization, hyper convergence or cloud application services;.", "Interfacing with/managing databases (Relational and other);.", "Signal processing and analysis;.", "Voice/data communications (satellite, RF LMR, wireless and telecommunications networks);.", "Data Technology.", "You may possess other experience that may not be requisite for all our positions, but could be an asset for CSIS.", " Let us know which areas you have worked in so we can find the right position for you.", "Recent: is defined as experience acquired in the last five (5) years.", "**Significant: is defined as the depth and breadth of experience that would normally be acquired by a person in a position where the performance of these duties constitutes his or her main functions over that period of time."]}, {"subtitle": "Competencies", "body": ["Adaptability;.", "Interpersonal Skills;.", "Organizational Skills/Multitasking;.", "Problem Solving Skills;."]}, {"subtitle": "Official Language Proficiency", "body": ["The immediate need is to staff positions with a linguistic profile of bilingual imperative and non-imperative (BBB/BBB) and English essential (EE).", "For bilingual imperative positions, an offer will be made to a qualified candidate who meets the linguistic requirements.", "For bilingual non-imperative positions, offers will be conditional upon meeting the linguistic requirements within two (2) years of appointment.", "A written exam may be administered as a screening tool in order to assess the candidates’ relevant technical knowledge.", "Salary will commensurate with qualifications and experience.", "These positions are designated Computer Science (CS); therefore, the employee may be eligible for a terminable allowance.", "Some relocation expenses may be reimbursed."]}, {"subtitle": "Security Requirements", "body": ["Candidates must be eligible to receive an Enhanced Top Secret security clearance.", " The process involves a security interview, a polygraph, and a background investigation that includes credit and financial verifications.", " The use of illegal drugs is a criminal offense.", " Drug use is an important factor considered in your reliability and suitability assessment during the selection process.", " Therefore it is important not to use any illegal drugs from the time you submit your application."]}, {"subtitle": "Important", "body": ["Applicants must clearly demonstrate in their application how they meet each Education and Experience criteria.", " Failure to do so will result in the applicant being screened out of the career opportunity.", "CSIS is a separate employer and is not subject to the Public Service Employment Act (PSEA).", " CSIS has its own classification, compensation system, and a different staffing regime.", " As such, we use a different staffing process and terminology.", "CSIS is committed to diversity and inclusion and the equitable participation of all Canadians.", " Should you require accommodation in relation to a disability, please tell us at the beginning of the selection process.", " This information will be kept confidential.", "The personal information provided in your application is protected under the Privacy Act and will be held in Personal Information Bank SIS/P-PU-025."]}]