[{"title": "VM ware NSX Administrator"}, {"subtitle": "Join our team", "body": ["The Network Support team of TELUS Internet Data Center (IDC) is a Tier 3 Network Operations team consisting of team members in Calgary, Vancouver, Toronto, and Manila (Philippines).", " We support over 300 Managed IT Services (MITS) customers and associated network infrastructure nationally 24x7.", " We oversee service assurance and fulfillment, as well as assist the Pre-Sales and Product Management teams.", " With a growing customer base, there’s no disputing the critical work this team of network professionals tackle daily."]}, {"subtitle": "Here’s the impact you’ll make and what we’ll accomplish together", "body": ["You pride yourself on being a VMware NSX and Fortinet network security expert.", " You have honed not only your technical skills but also your analytical skills and business competencies.", " You will support NSX firewall, load balancer, and VPN, as well as Fortigate Unified Threat Management (UTM) features.", " Moreover, you are multi-dimensional and dynamic.", " You are a natural at forging relationships and delivering relevant security findings as well as recommendations to various stakeholders including operational owners."]}, {"subtitle": "Here’s how", "body": ["3+ Years VMware NSX.", "Design and supervise the implementation of NSX firewall policies, load balancer, and VPN configuration in coordination with customer solutions and systems administration teams.", "Consult and make recommendations on the creation of new NSX based product offerings.", "Fortigate UTM:.", "Create UTM profiles based on current product offering.", "Improve accuracy and completeness of firewall implementations.", "Lead for private Cloud customer onboarding assessment.", "Perform level of effort analysis for new private cloud customer on-boarding/migration.", "Make determination to either perform the work internally or engage third party.", "Obtain cost estimate from third party when required and provide to project team as input into budgeting process.", "Prime Day 2 support for NSX firewalls and Fortigate UTM features.", "Prime for NSX day 2 support activities within private Cloud.", "Prime for Fortigate UTM features for IDC Next-Gen Firewall and Threat Management service.", "Cross-train the Network team to allow for broader security coverage.", "Provide high-level training on UTM security profile management.", "Provide high-level training on NSX firewall support.", "The primary point of contact for MITS network security/compliance.", "Provide input on firewall product enhancements and requirements.", "Assist in process/procedure improvements for MITS network security.", "Represent Network team on MITS security working group.", "Provide assistance to migrate customer’s firewalls from other vendors (Cisco/Fortinet/Palo Alto/Juniper, to VMware NSX firewall).", "Assist with remediation of escalated security events and incidents.", "Support MITS customers in the event of a security incident.", "Provides audit and risk assessment for security policies for NSX and Fortigate firewalls.", "The second point of contact for on-call support and after-hours availability.", "Create, update, and maintain procedures, standards, and guidelines for secure design, implementation, and operation of information systems and services."]}, {"subtitle": "You’re the missing piece of the puzzle", "body": ["Expert with VMware NSX (Distributed and Edge firewall, load balancer, and VPN).", "Valued for your hands-on expertise with next-generation Fortinet firewalls UTM (IPS, AP and Antivirus).", "Acknowledged for your 10+ years of total related technical experience in network security operations.", "Bachelor’s degree in Computer Sciences or Engineering."]}, {"subtitle": "Great-to-haves", "body": ["Relevant certifications such as VMware Certified Professional 6 - Network Virtualization (VCP6-NV) or higher, Fortinet NSE4 and/or higher.", "Strong knowledge of IT security and cybersecurity frameworks (PCI DSS, ISO 27001, CIS, and NIST).", "Experience with security event logging and monitoring, vulnerability management, enterprise response, and detection.", "Direct experience with micro-segmentation, intrusion detection software, firewalls, and content filtering.", "Knowledge of risk assessment tools, technologies, and methods.", "Experience designing secure networks, systems, and application architectures.", "Knowledge of disaster recovery, computer forensic tools, technologies, and methods.", "Experience planning, researching and developing security policies, standards, and procedures.", "Experience in a system administration role supporting multiple platforms and applications.", "Experience conducting technical security assessments and good working knowledge of cloud security.", "Expertise in security protection solutions including firewall, web proxy, application whitelisting products, DDoS protection, and Web application security.", "Experience with threat intelligence analysis and tools.", "Strong understanding of penetration testing and red/blue team activities."]}, {"subtitle": "Who is TELUS?", "body": ["We're a high-performing team of individuals who collectively make TELUS one of the leading telecommunications companies in Canada.", " Our competitive consumer offerings include wireline, wireless, internet, and Optik TV™.", " We also deliver a compelling range of products and services for small, medium and large businesses; and have carved out a leadership position in the health, energy, finance and public sector markets with innovative industry-specific solutions.", "Everyone belongs to TELUS.", " It doesn’t matter who you are, what you do, or how you do it, at TELUS, your unique contribution and talents will be valued and respected.", " Because of the more diverse perspectives, we have the more likely we are to crack the code on what our customers want and our communities' needs."]}]