[{"title": "Systems Support Analyst"}, {"subtitle": "About Firma Foreign Exchange", "body": ["Since 1998, Firma Foreign Exchange has provided global currency solutions to help small businesses grow.", " We believe business across borders can be less complex.", "Firma is a global company moving more than $14 billion in payments around the world safely and securely for our clients.", " Currency exchange can be complicated; at Firma we keep it simple and secure.", "Firma Foreign Exchange is looking to expand our remarkable team, with people who provide remarkable service, resulting in remarkable growth.", "We value those who:.", "1) Dare to be adventurous, have a fresh, outward-looking way of thinking, determined, independent, entrepreneurial and ambitious.", "2) Care to do what’s right and demonstrate trust, reciprocal respect, humility, honesty and personal responsibility in all relationships.", "3) Share by collaborating and working together as one team to pursue mutually beneficial relationships and better outcomes for all.", "4) Uncomplicate by making life easier for customers and each other and make the complex simple and straightforward for everyone.", "5) Deliver by aiming to be the best, leading the way in service excellence and continuously working to innovate and improve products, services and processes.", "Office locations: Canada, Australia, New Zealand, and the United Kingdom.", "Awards: Firma is proud to have been awarded Canada’s Best Managed Companies in 2019 and 2020.", " For the last four years, Firma has also received Great Places to Work Certification and won Great Places to Work in 2018."]}, {"subtitle": "Systems Support Analyst:", "body": ["Reporting to the Manager I.", "T.", " Services, the Systems Support Analyst team diagnoses and resolves internal hardware and software issues and facilitates timely solutions.", " The Systems Support Analyst is the first point of contact for internal users with technical issues and spends the majority of time resolving tickets and escalating technical issues to various information system teams.", " In addition to providing internal technology support and issues resolution, the Systems Support Analyst will research and implement industry-leading use of data and technology-enabled products."]}, {"subtitle": "Responsibilities:", "body": ["Analyze Help Desk tickets.", " Resolve issues in a timely fashion.", "Support technical issues escalated from the Customer Service Team.", "Set-up new employees on Firma systems.", "Assign and remove user access.", " Resolve access issues.", "Troubleshoot desktop hardware and resolve issues.", "Manage and troubleshoot software.", "Create deployment packages and assist with software deployment.", "Monitor desktop and server security by maintaining anti-virus solutions.", "Create custom scripts to automate tasks.", "Manage user email.", "Manage mobile devices."]}, {"subtitle": "Skills and Abilities:", "body": ["Ability to complete tasks with a high degree of diligence and attention to detail.", "Solid working knowledge of Information Technology security best practices.", "Ability to clearly communicate and write concise documentation.", "Ability to prioritize and handle multiple competing tasks.", "Strong interpersonal skills.", "Ability to work under pressure within a fast-paced team environment.", "Solid problem solving and analytical skills.", "Goal-oriented, self-motivated, with a customer service focus."]}, {"subtitle": "Competencies:", "body": ["Customer and Service Focus.", "Drives for Results.", "Cultivates Innovation."]}, {"subtitle": "Education and Experience:", "body": ["Diploma or Degree in the field of computer science or information systems.", "1-2 years’ experience in a customer service or support desk role.", "Knowledge of:.", "Microsoft Windows Active Directory.", "Microsoft Windows Networking Tools.", "Projector and conference room support.", "Microsoft SharePoint.", "Microsoft SCCM.", "Microsoft Windows Desktop Operating Systems.", "Remote User Support Techniques.", "Broadband troubleshooting.", "General printer and hardware maintenance.", "Anti Money Laundering (AML) processes, legislation, and procedures."]}, {"subtitle": "Total Compensation:", "body": ["Salary to be discussed in interview.", "Eligible to earn up to 10% of salary in the form our Corporate Incentive Program.", "Health and dental benefits.", "Paid vacation time plus 5 personal days (pro-rated for first year of employment).", "After 3 months of successful employment, eligible for one half-Friday off per month.", "Funded completion of job-related training.", "Employee recognition system – movie tickets, household items, electronics, gift cards, etc."]}]