[{"title": "IT: Software Developer"}, {"subtitle": "Help us boldly shape retail in Canada", "body": ["Canadian Tire Corporation’s (CTC) rich heritage of serving Canadians from coast-to-coast dates back to 1922.", " Our vision is to become the #1 retail brand in Canada, and we are focused on innovating and making important investments in our business, especially when it comes to our people.", " To reach our goal, we need the best talent to help us evolve and drive change across the business – and boldly help shape Canada’s retail industry.", " As we strive to be at the forefront of a complex and vastly changing retail industry, it is an exciting time to join the Canadian Tire family of companies."]}, {"subtitle": "Our Commitment to students", "body": ["Work in an environment that supports, and fosters knowledge sharing and provides key experiences to increase capabilities through projects or objectives.", "There will be specific and measurable objectives/goals that will support learning & achieving relevant business deliverables.", "Continue to support Canadian Tire’s culture of learning from others, continuous improvement, agility, growth and innovation.", "Investment in the community to create a talented diverse workforce for Canada and Canadian Tire’s future.", "Building & strengthening student social engagement throughout their education and pursuit of their career through ongoing communication and relationship building."]}, {"subtitle": "Roles Available:", "body": ["Software Tools Developer Student (2 roles).", "The Software Tools Developer Student role is a technical role which will participate in productivity initiatives using automation.", " Automation is a key productivity driver in IT for delivery of projects and this role will support automation builds for the data governance and automation team as well as broader automation goals.", " The role will also have an opportunity to get exposure to various database technologies, including Azure Cloud solutions as well as CI/CD pipeline as part of a large data transformation program."]}, {"subtitle": "Who you are:", "body": ["A gile and innovative individuals, who are able to manage in an environment of change and ambiguity to help us take bold and strategic moves in this rapidly evolving retail environment.", "Creative thinkers who take initiative and are capable of building, launching and managing projects/programs that drive results for our customers.", "Problem solvers with the ability to analyze and prioritize to meet business objectives.", "Collaborative team players with superior influencing skills, who build relationships easily across various stakeholder groups to move initiatives forward.", "If you’re curious, ready to take on new challenges and open to doing things differently to help us evolve rapidly, then Canadian Tire is definitely the place to be."]}, {"subtitle": "What you’ve done:", "body": ["Enrolled in a technology, computer science or related program.", "2 nd or 3 rd rotation with previous development or automation experience.", "Experience working in a team environment.", "Demonstrated programming experience with a variety of languages (One or more of: Java, JavaScript, SQL, Python, Shell Scripts, Spark, Hive, and MapReduce).", "Knowledge and experience with various data technology platforms (One or more of: Hadoop ecosystem, Oracle, MySQL, SQL Server, SQLite, PostgreSQL).", "Strong analytical skills with the ability to interpret data."]}]