[{"title": "Software Engineer - PEY Intern"}, {"subtitle": "Job Description", "body": ["Come intern with one of the largest electrical engineering companies in the world!.", "Come Intern with our Programmable Solutions Group (PSG)!.", "You will work on some aspect of the Intel Quartus compile system.", "Roles and responsibilities may include to work on some of the most difficult and interesting algorithmic problems around.", "12-16 months full-time internship starting May 2021."]}, {"subtitle": "Qualifications", "body": ["You must possess the below minimum qualifications to be initially considered for this position.", " Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates.", " Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences.", "Minimum Requirements:.", "Must be pursuing a Bachelor's degree in Computer Engineering, Engineering Science, Computer Science, Math, Electrical Engineering or equivalent.", "Minimum of 3 months experience with:.", "C/C++.", "Python.", "Verilog."]}, {"subtitle": "Inside this Business Group", "body": ["The Programmable Solutions Group (PSG) was formed from the acquisition of Altera.", " As part of Intel, PSG will create market-leading programmable logic devices that deliver a wider range of capabilities than customers experience today.", " Combining Altera's industry-leading FPGA technology and customer support with Intel's world-class semiconductor manufacturing capabilities will enable customers to create the next generation of electronic systems with unmatched performance and power efficiency.", " PSG takes pride in creating an energetic and dynamic work environment that is driven by ingenuity and innovation.", " We believe the growth and success of our group is directly linked to the growth and satisfaction of our employees.", " That is why PSG is committed to a work environment that is flexible and collaborative, and allows our employees to reach their full potential."]}]