[{"title": "Junior Software Developer"}, {"subtitle": "About EazyTeX Solutions Inc", "body": ["EazyTeX Solutions Inc (aka Hypatia Systems) is building hypatia - the world’s most powerful WYSIWYG document creation, publishing, and delivery platform designed for the Science, Technology, Engineering, and Mathematics (STEM) students and teachers.", " Powered by LaTeX - the gold standard for mathematics communication - the hypatia platform enables even novices to share complex math ideas that are difficult to communicate using any other package.", " We are developing an innovative and powerful Math Tutor System based on various methods from compilers, computer algebra systems (CAS), advanced algorithms and machine learning to enable us to build our key competitive features, and we need some great people to help us realize this vision.", " Visit our website at hypatiasys.", "com for more details.", "As the successful candidate for our software developer position, you will help us integrate, develop, deploy, and scale our technology.", "You have a strong background in software development and are able to work independently under the supervision of a senior software designer.", " You will be part of the team that will be instrumental in making our platform easy-to-use, performant, and scalable.", " You are creative, motivated, collaborative, and analytical.", "We have a great open space located in New Westminster’s River Market - just a couple minutes walk from the Skytrain station.", " However, due to COVID-19 situation, we will be most likely working from home during the fall term.", "Think you’re a good fit? Does this sound like you: You thrive in an entrepreneurial environment; enjoy new challenges everyday; relish a fast paced, collaborative team atmosphere.", " You are adaptable, and quick thinking.", " You enjoy new challenges, like people, welcome change, want responsibility, and don’t hesitate to speak up and share an opinion.", " Most importantly, you have a passion for how innovation is impacting people and changing our world, and think often about what this means for the future of education, of work, and of communication.", " Are we talking about you? If all this describes you, then let’s talk."]}, {"subtitle": "Key accountabilities include:", "body": ["· Designing and implementing new features, enhancing and maintaining existing code.", "· Designing, building, deploying, and supporting large-scale applications on the client and server side.", "· Ensuring all code written is tested and integrated with existing product code base and version control system."]}, {"subtitle": "Your experience includes at least some of the following:", "body": ["· Bachelor’s degree in Computer Science or related field.", "· Javascript, HTML, CSS, NodeJS and similar web-based technologies.", "· plugin architectures, especially, with add-ons for Google Suite and add-ins for MS Office applications.", "· parsers and compilers, CAS (Computer algebra systems), especially with Reduce.", "· SQL databases (ER modelling, query optimization) and NodeJS server architecture.", "· Strong background in algorithms.", "· Excellent knowledge of OOD and Design Patterns.", "· Experience and interest in performance, load, and scalability issues.", "· Experience with machine learning techniques.", "At this time, we can consider only candidates who have a valid Canadian work permit."]}]