[{"title": "Technology & Engineering New Grad"}, {"subtitle": "TELUS’ Technology and Engineering New Grad Program", "body": ["Are you a new grad from an engineering, computer science or applied science Bachelor’s program looking to start your career with one of Canada’s leading technology companies? Do you want to work alongside the best minds in the industry to envision and build state-of-the-art technologies like 5G networks, Software Defined Networking (SDN), cybersecurity solutions and fibre optic networks that will power everything from connected homes and businesses to smart cities?.", "If you’re passionate about technology and innovation, come join TELUS’ Graduate Technology Leadership Program (GTLP), a one-of-a-kind career development program focused on personal growth and innovation.", " Being a part of the GTLP will give you exposure to a breadth of functions to grow your career while you deliver on the technology needs of our customers.", "Watch this video to learn about new grad life at TELUS through the vision of our Chief Technology Officer:."]}, {"subtitle": "What will you get to work on?", "body": ["As part of the GTLP, over 27 months, you will complete structured rotations across three different teams to help you develop technical expertise and leadership skills.", " Rotations are designed to promote accelerated development, and you would typically focus on one or two of the following technology streams:.", "Software-defined Networking (SDN):.", "Re-envision our large networks as virtualized, cloud-based software to foster sustainability and improve the customer experience.", "You will gain skills in network function virtualization (NFV), cloudification, and software development and operations (DevOps).", "Cybersecurity Solutions:.", "Develop pioneering cybersecurity and privacy solutions to protect Canadians from the full spectrum of online threats.", "The skills you will develop include cybersecurity and threat assessment, software DevOps and security product development.", "5G and Wireless Networks:.", "Advance Canada’s largest and fastest wireless network as we evolve to a hyper-connected 5G world.", "You could get to work on macro sites, in-building networks and Wi-Fi; and will learn about wireless IP access design, wireless core network design, data analytics, virtualization and DevOps.", "Software Development:.", "Design and develop the next generation of connected living solutions to improve our customers’ lives and deliver on our future friendly brand promise.", "You will work closely with experts on our technology teams to build apps and platforms to elevate the customer experience.", "Digital Home Solutions:.", "Deliver state-of-the-art, market-leading video and connected home solutions for our customers including smart security solutions.", "Working in collaboration with our business and technology implementation teams, the skills you will develop include product development and implementation, software DevOps, the application of virtualization in creating and extending TELUS’ operating and business support systems, the development and deployment of advanced IP TV technologies, and next generation messaging and voice services.", "Your rotation assignments will be based on your strengths and future career interests, combined with strategic business needs, and you will have a mentor alongside you every step of the way to help support your goals and growth.", "Positions are available in Vancouver, Edmonton, Toronto, Montreal, Rimouski and Ottawa so you can stay in one place or take advantage of rotating through national teams and living in different parts of Canada during the program.", " Additionally, TELUS’ Work Styles program gives teams the flexibility, tools and support to work when and where they will be most effective – whether that’s from an office location, from home or a hybrid of the two.", "If you are an engineering graduate wanting to pursue a P.", " Eng accreditation, we will support you in this endeavor by helping you gain relevant work experience towards your designation.", " You will have access to both formal training and experiential learning opportunities, as well as connections with industry experts to widen your exposure to future-focused innovation."]}, {"subtitle": "Qualifications", "body": ["Education & Experience:.", "You must be a recent grad or be expecting to graduate by April 2021 with a Bachelor's or Master's degree in computer science or engineering.", "Required Skills & Abilities:.", "Passionate about learning new technologies.", "Have a deep sense of commitment towards making a difference for our customers.", "Demonstrate leadership in the way you approach your work, as highlighted through your academic, volunteer/community and extracurricular activities.", "Possess strong interpersonal and communication skills.", "Collaborative and skilled at relationship building.", "Have highly-developed analytical and problem-solving skills.", "Self-motivated and have a strong sense of personal initiative and ownership.", "Creative and innovative in your thinking.", "Thrive in a high-performing, fast-paced, large and sometimes ambiguous environment."]}]