[{"title": "Computer Vision Software Engineer"}, {"subtitle": "description", "body": ["Bluewrist Inc.", " develops and markets industrial automation products in the areas of robotics and machine vision, including solutions for robot guidance, bin-picking, dimensional measurement, 3D scanning and robot calibration.", "We’re looking for an experienced Computer Vision Software Engineer who will be in charge of building and maintaining standalone industrial 3D vision application.", "We are a venture capital backed technology driven company with world class clients around the globe.", " This is a unique opportunity to be a part of a high growth Canadian technology company with the ambition of expanding globally."]}, {"subtitle": "Responsibilities", "body": ["Develop and maintain point cloud and image processing models and algorithms requiring advanced mathematical numerical analysis skill.", "Design, deploy and maintain standalone industrial machine vision and point-cloud processing applications.", "Test, debug and maintain software applications written in VB.", "Net, C++ or C#.", "Provide technical support for complex or urgent problems.", "Prepare technical documentation (e.", "g.", ", user manuals, technical specifications)."]}, {"subtitle": "Skills and Experience Required", "body": ["Strong mathematics skills mainly in the areas of point cloud processing, computer vision, 3D modeling and advanced interactive algorithms (ICP, K-d tree, feature extraction, etc.", ").", "Preferably good programming skills in computer graphics (OpenTK and/or OpenGL).", "Preferably experience with OpenCV, Point Cloud Library (pcl) or similar library experience.", "GPU programming, NVidia CUDA preferred.", "Bachelors or Masters in Computer Science or equivalent Engineering degree.", "Strong experience in developing stand-alone Windows applications and in writing clean, well structured, commented, and maintainable code inVB.", "NET, C++ or C#.", "Strong experience VS2008/2012 IDE.", "Experience with collaborative source code control systems and unit testing."]}, {"subtitle": "Other Skills", "body": ["Smart, creative with strong analytical skills.", "Interest in learning and result oriented.", "Enthusiastic friendly team player."]}]