[{"title": "Developer"}, {"subtitle": "description", "body": ["This is your opportunity to join AXIS Capital – a trusted global provider of specialty lines insurance and reinsurance.", " We stand apart for our outstanding client service, intelligent risk taking and superior risk adjusted returns for our shareholders.", " We also proudly maintain an entrepreneurial, disciplined and ethical corporate culture.", " As a member of AXIS, you join a team that is among the best in the industry.", "To support our growth objectives at AXIS, we are investing significantly in our Risk & Actuarial systems through our new Business & Technology Center in Halifax, Nova Scotia.", " This position is for a Developer within the Risk, Pricing and Modeling Center of Excellence (CoE).", " You will be providing your expertise, critical thinking and creativity to help evolve the Risk and Actuarial ecosystem in new and innovative ways.", " This position requires the ability to work on complex system components, while also collaborating as part of dynamic and agile project teams.", "As part of a global team, you will be working with highly-experienced talent to enhance existing solutions and design new ones to deliver and integrate capabilities across (re)insurance pricing, reserving, catastrophe modeling, loss accumulation and exposure management.", " You will embark on an exciting learning journey, gaining a strong grasp of these domains along with the underpinning mathematical, actuarial and statistical methodologies."]}, {"subtitle": "Responsibilities", "body": ["The Developer will be involved throughout the development lifecycle, through requirements analysis, coding, unit testing, system testing, user acceptance testing and warranty phases.", " Success in this position is largely dependent on the ability to implement, integrate, improve and automate capabilities across the development stack, and deliver against roadmaps.", "Contributing to the solution architecture for Risk, Pricing and Modeling solutions, working with AXIS Enterprise Architecture as well as other Domain Leads, CoEs as necessary.", "Partnering with vendors, and colleagues from other CoEs and segments, within blended / unified delivery teams, and working across different time zones.", "Producing, testing and deploying code / solutions as required.", "Contributing to the integration of capabilities into production environments.", "Supporting the smooth transition of new capabilities from project development teams to the application maintenance team through technical documentation and walk-throughs."]}, {"subtitle": "Required Skills And Qualifications", "body": ["Our preferred candidate will have:.", "Experience as a full-stack software engineer/developer.", "Strong experience with Microsoft development and tooling stacks:.", "NET, C#.", "MVC,.", "Web API.", "MS SQL.", "nUnit.", "Entity Framework.", "Experience with Object Oriented JavaScript / modern JavaScript libraries (React, Angular).", "Commercial experience of industry standards, best practice and development methodologies such as factory pattern, IoC, LINQ, delegates and generics.", "Practical experience in branching, merging code, continuous testing and software delivery pipelines and containers using Visual Studio, Test Manager, Team Foundation Server/Azure DevOps, or other tools.", "Real-life experience with Agile methodologies including SCRUM; experience working with Product Backlogs using Team Foundation Server or Azure DevOps.", "The ability to manage APIs, exposing/consuming via Microservices (Rest and SOAP).", "Sound understanding of RDBMS and Data Repositories (SQL Server, MySQL, Azure noSQL).", "Knowledge of distributed systems and service-oriented architecture.", "The ability to collaborate effectively and communicate transparently.", "Strong problem-solving and analytical skills.", "The ability to learn new technologies as required."]}, {"subtitle": "Desirable Skills And Qualifications", "body": ["Additional experience and qualifications that are desirable include:.", "Cloud infrastructure and services (including Azure, Data Factory and Data Bricks).", "Undergraduate degree in Computer Science, Physics or Mathematics.", "Experience in specialty insurance and reinsurance.", "Experience implementing Risk and Actuarial Solutions."]}]