[{"title": "Data Scientist"}, {"subtitle": "Description", "body": ["Excited by using massive amounts of data to create sophisticated security analytics? Does pushing the envelope with user and entity behavior analytics (UEBA) including developing statistical, stochastic and machine learning models for security excite you? Want to help the largest global enterprises operate safely & securely in the cloud at an unprecedented scale?.", "You will enhance real-time proactive and preemptive systems using data driven techniques.", " The analytic techniques are applied at each stage from detection to response mitigation.", " This job will challenge you to dive deep and understand the unique challenges in operating this platform at a scale unrivaled in the industry.", " Our scale provides unique opportunities that simply don’t exist elsewhere, but these opportunities can only be revealed by a scientific thinker with a curious mind, who is committed to improving every single day.", "This is an opportunity to operate in a truly groundbreaking manner given the sheer scale, breadth, and fast pace of the AWS environment.", " Data scientists are collaborative and highly determined, working backward from threats to create new and innovative ways to detect, assess and react to malicious activity.", "Your job is distilling meaningful insights from large volumes of data to address the constantly evolving threat and attack space from sophisticated adversaries.", " This role will give you an opportunity to use and grow a broad range of skills in data science, analytic development, and information security – all using and creating cloud services in large scale computing environments.", " Considering the scale and the magnitude of the technical challenge, this role is a great opportunity to make a meaningful contribution to an extremely important area.", " Operating in the cloud at our scale enables activities that have never before been possible, providing new advantages and opportunities for innovative work.", "We are hiring technical specialists at the convergence of the four hottest areas in tech: Data Science, Security, Software Development and Cloud Services.", " Worried that you do not have hands-on experience in all four areas? We are looking for solid base and expertise in two areas - you will grow expertise in the remaining areas to round out your background in all four key areas.", " Alongside your team, you will work directly with the biggest internal and external Amazon customers – leveraging data and analytics to create innovative ways to work securely in the cloud."]}, {"subtitle": "Basic Qualifications", "body": ["MS + 8 yrs experience or BS + 10 yrs experience in predictive modeling, data science, machine learning, or user and entity behavior analytic development.", "At least 4 years focused on applications of Data Science/Analytics.", "A minimum of two years’ experience in applying Data Science/ Analytics to security related problems.", "A minimum of 4 years’ experience introducing automation and operating within a fast paced prototyping environment."]}, {"subtitle": "Preferred Qualifications", "body": ["An M.", "S.", " or Ph.", "D.", " in Mathematics, Computer Science, Electrical and Computer Engineering, or equivalent degree.", "A post graduate degree in a scientific field is preferred but successful development and deployment of security analytics count.", " The right candidate has a background in probability and statistics, applied mathematics, or computational science and a history of solving difficult problems using a scientific approach.", "Experience with analytic development for endpoint and network security.", "Experience with one or more cloud services.", "Analytic development - streaming and a Hadoop ecosystem (Hive, Spark, etc.", ").", "Analytic development - SQL, NoSQL, graph-based, Key/Value stores, document stores, Python and/or R.", "Experience applying machine learning to real-world production systems, analytic development based on SparkML and other ML libraries such as scikit-learn, caret, mlr, MLlib.", "Excellent written and oral communication skills, strong sense of ownership, urgency, and drive.", "Meets/exceeds Amazon’s leadership principles requirements for this role.", "Meets/exceeds Amazon’s functional/technical depth and complexity for this role."]}]