[{"title": "Software Engineer"}, {"subtitle": "Job Details", "body": ["This is your time to shine.", " Our software engineering interns are considered full-time employees by their peers.", " In fact, you will be expected to contribute right away as a member of our Engineering teams for future releases.", " As the world leader in enterprise cloud computing, we release 3 new versions every year with close to 100 new features each release.", " You will write code that reaches millions of subscribers who use a number of our applications ranging from Marketing Cloud, Service Cloud and Security to just name a few.", " Additionally, you willwork on our automated testing infrastructure and craft the tools that provide real-time monitoring of our service.", " With such a quick turnaround, we don’t want our interns to sit on the sidelines and enjoy the view— we want you to change the way our customers connect their business to the world!.", "As a Futureforce intern, you will not only get to contribute to the meaningful work our teams are doing, but you will also have the opportunity to interact with senior executives and network with a number of employees at Salesforce.", " In addition to these impactful opportunities, ensuring that you get to participate in a number of events outside of your day-to-day duties is something that is top of mind for us.", " Throughout the summer, you will get to attend reoccurring “Lunch and Learns” where you will hear from a number of different representatives from the business about their career paths, attend events that take place outside of the office such as local Baseball games and finally, you will have the opportunity to give back to the community through a number of organized volunteer events.", " At Salesforce, we care deeply about the work that you do as an intern and additionally want to ensure that you are provided ample opportunities to create meaningful connections with other Salesforce employees as well as other students from across the country during your summer in the office."]}, {"subtitle": "Key Responsibilities", "body": ["Work under the direction of software architects and senior developers on a project that you will get to present to other interns and Salesforce Developers.", "Work with your team members on timely and relevant projects that may be included in a future software release.", "Contribute to our suite of automated tests and testing infrastructure."]}, {"subtitle": "Required Skills", "body": ["Enrolled and working towards obtaining a BS or MS in Computer Science or related field.", " Please note that in order to be eligible for an internship, we require that you be returning to school the following quarter/semester to work towards completing your degree.", "Must be attending a University in North America.", "Academic or professional/internship experience working in a professional coding setting is a plus.", "Understanding of object-oriented programming/design.", "Strong understanding of CS fundamentals and how to apply them to code.", "Understanding of algorithms and data structures and how to efficiently implement them into a solution.", "Ability to produce clear, efficient and concise code."]}, {"subtitle": "Desired Skills", "body": ["Team-player with the ability to work effectively and efficiently with others.", "Strong analytical and problem-solving skills.", "Commitment to putting quality first and delivering quality solutions.", "Be a self-starter and possess a strong sense of self-motivation.", "Ability to quickly learn new technologies.", "Coursework in SQL and relational database concepts.", "Strong competency in javascript and associated frameworks.", "Working knowledge of HTML and web technologies.", "General knowledge of front end and back end languages."]}, {"subtitle": "About Futureforce University Recruiting", "body": ["Our Futureforce University Recruiting program is dedicated to attracting, retaining and cultivating talent.", " Our interns and new graduates work on real projects that affect how our business runs, giving them the opportunity to make a tangible impact on the future of our company.", "With offices all over the world, our recruits have the chance to collaborate and connect with fellow employees on a global scale.", " We offer job shadowing, mentorship programs, talent development courses, and much more.", "Accommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.", "Posting Statement.", "At Salesforce we believe that the business of business is to improve the state of our world.", " Each of us has a responsibility to drive Equality in our communities and workplaces.", " We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more.", " Learn more about Equality at Salesforce and explore our benefits.", "Salesforce.", "com and Salesforce.", "org are Equal Employment Opportunity and Affirmative Action Employers.", " Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status.", " Salesforce.", "com and Salesforce.", "org do not accept unsolicited headhunter and agency resumes.", " Salesforce.", "com and Salesforce.", "org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.", "com or Salesforce.", "org."]}]