[{"title": "Junior Software Developer"}, {"subtitle": "Company Description", "body": ["As one of the largest independent technology companies in Atlantic Canada, Mariner has a team of over 200 IT and software professionals working with clients both regionally and across the globe.", " With extensive capabilities in the areas of analytics, automation software, information security and IT consulting, Mariner has been delivering innovative solutions with a strong emphasis on productivity and customer experience since 2003."]}, {"subtitle": "Job Description", "body": ["To help in our planned growth, we are pro-actively recruiting for a Developer to support a Halifax based project initiative.", " The Junior Developer will be a key member of our Professional Services team."]}, {"subtitle": "Qualifications", "body": ["We are looking for Agile software developers who have demonstrable skills in collaboration and communication, and can balance feature velocity with high quality code delivery.", "1-3 years development experience.", "At least 1 year development experience in C++.", "High-speed networking and network transport protocols.", "Knowledge of Embedded systems.", "Cloud technology including AWS, Azure and GCS.", "Exposure to test-centric Development.", "Familiarity with Agile/Scrum methodologies, and a desire to work within a highly-collaborative, fast-paced team.", "Passionate about delivering high quality software.", "Strong communication and interpersonal skills.", "A degree in Computer Science, Software Engineering, or Computer Engineering.", "Familiarity with Azure or Bitbucket pipelines, or equivalent.", "Golang exposure would be considered an asset.", "Familiarity with AWS, Azure or Google Cloud storage protocols would be considered an asset.", "Low-level networking experience (socket programming) would be considered an asset.", "Additional Information."]}, {"subtitle": "Why Mariner Partners?", "body": ["We believe in making a positive impact in the communities where we live and work – our team is located in major cities all across Canada, throughout the US and internationally.", " We are proud to be headquartered here, and are passionate about growing a strong technology sector here in Atlantic Canada and beyond.", " We offer competitive compensation; benefits packages and training and development.", "We recognize that empowered employees are more innovative, more efficient, deliver better customer service and can flat out-perform conventional organizations.", " Our people have built products for national deployments at the world’s largest telecom companies and leading real estate, oil & gas, financial, government and utilitites organizations.", "We are looking for passionate IT professionals who love providing solutions for customers and who want to grow their careers."]}]