[{"title": "Online Software Engineer "}, {"subtitle": "We are EA Sports", "body": ["EA SPORTS is one of the leading sports entertainment brands in the world, with top-selling videogame franchises, award-winning interactive technology, fan programs, and cross-platform digital experiences.", " EA SPORTS creates connected experiences that ignite the emotion of sports through industry-leading sports video games, including Madden NFL football, FIFA Soccer, NHL® hockey, NBA LIVE basketball, and EA SPORTS UFC."]}, {"subtitle": "The Challenge Ahead", "body": ["The Online Engineer is involved in the whole creation process from architecture design, implementation, debugging, and tuning on multiple platforms and device, working on complex problems with Designers, Artists and other Engineers in the Online and Game Modes domain.", " You will report to the team's manager and work with your peers on developing the game's foundation layer."]}, {"subtitle": "What You Will Do As An Online Engineer", "body": ["Develop technical solutions for online game features.", "Work with a proprietary engine to develop stable, scalable, efficient and shareable code.", "Work with people on a large team both locally and remotely.", "Work with 3rd party software APIs."]}, {"subtitle": "We Are Looking For", "body": ["3+ years of experience in C++ software development.", "Experience with Client/Server, Peer-to-Peer and multi-threaded architectures.", "Knowledge of modern database technologies.", "Knowledge of networking protocols.", "Knowledge of good software programming practices.", "Experience with 3rd party APIs."]}, {"subtitle": "Nice To Have", "body": ["Bachelor’s degree in computer science or related field, or equivalent training and professional experience.", "2+ years of experience working on Microsoft, Sony or Nintendo game consoles or other embedded systems.", "Experience of real-time game networking.", "Experience with Visual Studio and deep knowledge of the debugging tools.", "Experience with source control systems will come in handy.", "Experience with scripting languages (Python, Lua) and interpreted languages.", " (C#)."]}]