[{"title": "Data Scientist"}, {"subtitle": "Company Description", "body": ["SAP started in 1972 as a team of five colleagues with a desire to do something new.", " Together, they changed enterprise software and reinvented how business was done.", " Today, as a market leader in enterprise application software, we remain true to our roots.", " That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.", "SAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees.", " We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all.", " We believe that together we can transform industries, grow economics, lift up societies and sustain our environment.", " Because it’s the best-run businesses that make the world run better and improve people’s lives."]}, {"subtitle": "PURPOSE AND OBJECTIVE OF POSITION", "body": ["SAP CX helps businesses on every continent sell more goods, services, and digital content through every touch point, channel, and device.", " Join a team that promotes an empowered culture, allowing all employees the ability to contribute and make a difference.", "Cloud Operations and Support is one of several teams that provide support for the SAP Commerce Cloud, which is a component of the C/4HANA platform.", " We are a global team, using a follow-the-sun model to deliver 24/7 coverage for our customers around the world.", "We are seeking motivated individuals to join a high performing team to work on challenging projects as a machine learning intern.", " By joining the team, you will have a unique opportunity to apply analytics on big data and be part of projects with some of our top customers."]}, {"subtitle": "EXPECTATION AND TASKS", "body": ["Build microservice-based data processing pipeline and intelligent services.", "Develop expertise in data science and build predictive models.", "Evaluate existing predictive analytics tools / functions and / or develop new approaches and methods.", "Provide support for both batch-based and stream-based data processing.", "Work in a cross functional team leveraging Scrum and Agile methodologies.", "Collaborate with representatives from the business to understand their needs."]}, {"subtitle": "Skills / Competencies", "body": ["Strong problem solving and analytical skills.", "Fluency in English, French an asset.", "Curiosity and ability to express ideas and perspectives.", "Excellent communication and collaboration skills.", "Ability to work independently.", "Proven experience with linear algebra, calculus and statistics.", "Proficiency in R, Python ML packages and TensorFlow.", "Programming skills in any language.", "Experience with cloud-based development using Cloud Foundry, Kubernetes/Docker, AWS, GCP, Azure and other container/IaaS technologies.", "Experience in REST API implementation.", "Hands-on experience with continuous integration, TDD and build tools like Jenkins is a plus.", "Knowledge in BI, SAP Analytics Cloud or any other reporting/analytics solution is a plus."]}, {"subtitle": "Educational Requirements", "body": ["University degree in Computer Science, Engineering, Mathematics, Statistics or similar.", " Completed or in progress."]}, {"subtitle": "What You Get From Us", "body": ["Success is what you make it.", " At SAP, we help you make it your own.", " A career at SAP can open many doors for you.", " If you’re searching for a company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense of purpose, and provides a fun, flexible and inclusive work environment – apply now."]}, {"subtitle": "SAP'S DIVERSITY COMMITMENT", "body": ["To harness the power of innovation, SAP invests in the development of its diverse employees.", " We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.", "SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities.", " If you are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas: Careers.", "NorthAmerica@sap.", "com or Careers.", "LatinAmerica@sap.", "com, APJ: Careers.", "APJ@sap.", "com, EMEA: Careers@sap.", "com).", "Successful candidates might be required to undergo a background verification with an external vendor."]}]