[{"title": "Software Developer"}, {"subtitle": "This position has a term length of 4 yrs less a day and offers a comprehensive benefits package which can be viewed at: Faculty & Staff Benefits.", "body": ["The university-community Partnership “21st Century Tools for Indigenous Languages”, a project funded by the Social Sciences and Humanities Research Council (SSHRC) of Canada, is seeking a dynamic individual as a full-time Software Developer to add to its team in the Alberta Language Technology Lab (ALTLab) at the University of Alberta."]}, {"subtitle": "Duties", "body": ["Software development of language technological applications, tools, and resources (70%), e.", "g.", " on-line electronic dictionaries, computer-aided language learning applications, keyboards and spell-checkers, linguistically analyzed, search collections of written or spoken texts.", "Engaging with our Partners and end-user communities.", "Participating in the dissemination of the results of our work."]}, {"subtitle": "Qualifications", "body": ["A Bachelor’s degree in Computer Science or Software Engineering, Master's Degree preferred.", "A minimum of 2 years of experience in software development in Python using modern tooling, techniques and methodologies.", "A minimum of 2 years experience in software development in JavaScript and/or TypeScript using modern tools, techniques and methodologies.", "A minimum of 2 years experience using the git version control system with GitHub and/or other online repository hosting platforms.", "Demonstrable understanding of test-driven development, unit testing, and integration testing in Python and front-end JavaScript.", "Experience performing code reviews.", "Knowledge of a language other than English."]}, {"subtitle": "Apply On Line With", "body": ["an application/cover letter and/or curriculum vitae outlining your competences, as well as the.", "names and contact details of at least two referees that we may get in touch with for more background information."]}]