[{"title": "Data Scientist"}, {"subtitle": "A Little Bit About Us", "body": ["Good Food, Good Life is the very essence of Nestlé.", " This philosophy can be traced back to our beginnings.", " The Nestlé Company was founded in 1867 by Henri Nestlé, who developed the first milk-based baby formula.", " Today, 150 years later, we are recognized as the world’s largest Food and Beverage Company employing around 280,000 people and have factories or operations in almost every country in the world.", " Nestlé Canada has a wide variety of food, beverage and nutrition products to help you and your family live happier and healthier lives including: Gerber and Good Start, Nescafé, KitKat, Smarties, Aero, Delissio, Häagen-Dazs, Boost, Purina, and Nestlé Waters.", " Nestlé Canada supports your personal growth with a people-focused culture and a flexible and diverse working environment.", " Our aim is to create a unique career experience for talented young professionals like you.", " Join us to find out why, There is more to Life at Nestlé…."]}, {"subtitle": "Position Summary", "body": ["We are looking for a Finance Data Scientist Intern based at our North York Location from May to August 2021.", " This role will be responsible for engaging with stakeholder to understand the business needs to produce insightful, actionable analytics and KPI’s.", "A day in the life of.", "As a Finance Data Scientist Intern you will be working on the Analytics team, to empower business partners by providing powerful tools and insightful analytics.", "You will also:.", "Explore data, answering questions and finding new business opportunities.", " You will perform ad hoc analysis producing valuable insights to business stakeholders engage with stakeholders to understand the business needs to produce insightful, actionable analytics and KPIs.", "Add value to the business by working on key decision support solutions from various facets of our business.", "Build your business acumen and leadership capabilities and support your development and long-term success."]}, {"subtitle": "What Will Make You Successful", "body": ["As the successful candidate, you will have a passion for solving challenging issues, through seeing a story behind the numbers.", " You are curious for discovery, able to think outside the box, and can understand the user needs and translate the tech language.", "You will also:.", "Currently enrolled in a Computer Science program or a related discipline.", "A proactive creative thinker who can generate new ideas/solutions to meet end user requirements.", "Ability to cultivate business relationships with strong interpersonal, communication and presentation skills.", "Fast learner, and must be comfortable working within a dynamic, challenging environment.", "Results oriented with proven exceptional analytical and critical thinking skills.", "Good foundational understanding of statistical, predictive modelling, machine learning.", "Strong coding skills.", "Experience with data visualization tools is a plus (QlikView, Microsoft BI).", "We have a friendly, supportive team with a coaching and mentoring environment.", " There are real opportunities for future development and progression – this really could be a move towards the exciting Financial career you’ve always wanted."]}, {"subtitle": "What You Need To Know", "body": ["What can we offer in return? Excellent training and development programs as well as opportunities to grow within the company.", " You will also receive developmental feedback throughout your work-term to ensure that you are learning and understanding the importance of Finance within the world’s largest food company.", " You will also build your business acumen and leadership capabilities and support your development and long-term success.", "The closing date for applications is October 31st.", " We will be considering applicants as they apply, so please don’t delay in submitting your application.", "Nestlé is an equal opportunity employer committed to diversity and inclusion.", " If you are selected to participate in the recruitment process, please inform Human Resources of any accommodations you may require.", " Nestlé will work with you in an effort to ensure that you are able to fully participate in the process."]}]