[{"title": "IT Business Analyst"}, {"subtitle": "IT Business Analyst", "body": ["JSG is currently recruiting for a long-term contract role for an IT Business Analyst for work with our client, a large multinational energy infrastructure company based in Calgary, AB.", "The IT Business Analyst serves as direct liaison to functional process owners in order to translate and prioritize requirements for assigned area project and maintenance work."]}, {"subtitle": "Key Responsibilities", "body": ["Responsible for translating high-level business requirements into detailed functional specifications and managing requests for changes to the specifications.", "Assists the business in determining which business requirements can and should be automated and how they are then integrated with other business and technical processes.", "Maintains functional peer relationships and detailed working knowledge of the assigned areas systems, organization, and business processes.", "Participate in requirements prioritization.", "Assist in the definition of project scope and success criteria.", "Perform project management tasks as needed.", "determine, assign, track and manage project tasks, documentation, issues, change requests, status, etc.", "Partner with development team to provide reporting and status on project deliverables.", "Coordinate and participate in Testing activities."]}, {"subtitle": "Criteria & Qualifications", "body": ["Degree in Information Systems, Computer Science or related technical discipline or equivalent.", "7-10 years of systems analysis, programming or other IT related experience.", "Complete understanding of the software development lifecycle.", "Strong interpersonal skills.", "Excellent written and oral communication skills.", "Outstanding problem-solving skills.", "Ability to translate technical information into terms understandable by non-IT savvy personnel.", "Adept at interacting in both business and IT focused discussions.", "Ability to influence and negotiate with clients and suppliers.", "Proficient at operating within a North Americanly distributed team.", "Advanced knowledge and experience with Microsoft Office products."]}]