[{"title": "Junior Data Scientist"}, {"subtitle": "The Invest Ottawa Talent (Pilot) Program aims to help growing Ottawa firms to attract, develop and retain the top tech and business talent required to thrive, compete and succeed in the global market. As lead economic development agency for knowledge-based industries in Canada’s Capital, Invest Ottawa is committed to addressing Ottawa’s talent shortage, and helping companies address key talent challenges, accelerate business growth, and create new jobs that fuel our economy.", "body": ["Leveraging technology, knowhow and capabilities in talent management strategy, sourcing and employer branding, the IO Talent Program equips Ottawa’s fast-growing startups, scaleups and SMEs with a talent advantage by providing coaching and mentorship; access to global tech expertise; and talent solutions and support for every stage of growth.", " Integrated within its broader suite of venture development and global expansion programs and services for companies, the IO Talent Program leverages Invest Ottawa’s Work in Ottawa and Why Ottawa campaigns to help drive the attraction and retention of top talent and showcase why Ottawa is the best place to learn, work, live, and play.", " To learn more, visit www.", "workinottawa.", "ca."]}, {"subtitle": "Job Summary", "body": ["Our client providing IoT (Ai)-based solutions, is looking for a Junior Data Scientist to join their growing team.", " You are the type of individual who wants a new challenge every day and is not content with the status quo.", " You will be proposing solutions and strategies to business challenges which you will develop through deep learning.", " If this sounds right for you, please apply!."]}, {"subtitle": "Responsibilities", "body": ["Performing fundamental research work on applying deep learning to different types of data.", "Constructing data pipelines and applying data processing, cleansing and integrating.", "Developing, testing and evaluating deep learning algorithms to tackle the underlying problem.", "Assisting in model deployment and optimizing for performance.", "Developing documentation for developed models.", "Assisting in development of materials and analysis for project proposals and proof of concepts.", "Proposing solutions and strategies to business challenges through deep learning."]}, {"subtitle": "Skills", "body": ["Bachelor’s degree in Data Science, Computer Science, Math, Statistics, Engineering or a related field.", "2+ years hands-on experience using Python (including NumPy, pandas and SciPy).", "Strong grasp of computer science fundamentals, algorithms, data structures, and design patterns.", "Background in statistical modelling, data mining and deep learning."]}]