[{"title": "Science Software Developer"}, {"subtitle": "description", "body": ["GHGSat offers greenhouse gas detection, measurement, and monitoring services to industrial and government customers around the world.", " We use our own satellites and aircraft sensors, combined with third-party data, to help industrial emitters better understand, control, and reduce their emissions.", "GHGSat’s capability is unique: we provide high-resolution, local measurements of atmospheric methane and carbon dioxide concentration from space.", " This further enables to detect greenhouse gas emitters and to visualize and quantify their emissions.", "At the core of the GHGSat measurement concept is a suite of scientific software tools, the GHGSat Retrievals Toolchain, which retrieves local concentrations of methane and carbon dioxide from the imagery acquired by GHGSat instruments.", " We are seeking a Software Developer with experience performing computational software development and developing scientific software infrastructure."]}, {"subtitle": "Responsibilities", "body": ["Build new tools and maintain existing tools in the GHGSat Toolchain to support in-service and upcoming GHGSat satellite and aircraft instruments.", "Implement greenhouse gas retrievals algorithms developed by the GHGSat Science and Systems Team into efficient, scalable code.", "Develop Testwares for internal tool testing and feature integration.", "Maintain experimental software tools for R&D purposes and ensure that internal users are empowered by these tools: i.", "e.", ", add new features and improve existing ones; implement accommodations for edge cases.", "Engage collaboratively with GHGSat teams (in particular the Science and Software Teams) to define requirements for new tool features and suggest improvements to existing tools.", "Independently architect, design and implement efficient, reusable and scalable code.", "Apply CI/CD practices to prevent integration problems as well as ensure that the code is releasable at any point in time."]}, {"subtitle": "Must Have", "body": ["Strong experience with C++ and Python in a Linux environment.", "Demonstrable understanding of basic calculus, linear algebra and an understanding of mathematical optimization.", "Experience with Docker and Kubernetes or similar orchestration frameworks.", "Experience in contributing to a large, constantly evolving C++ and Python codebase.", "Good code documentation habits."]}, {"subtitle": "Good to Have", "body": ["Experience with developer tools and environments (Git, Continuous Integration, Continuous Deployment, build systems, bug trackers, etc).", "Experience with program optimization via design/algorithmic optimization, code vectorization and multicore/GPU programming.", "Interest in scientific analysis, atmospheric sciences, remote sensing systems and space."]}, {"subtitle": "Background", "body": ["Bachelor of Science in Computer Science, Engineering, Applied Science or related field.", "Minimum of 3 years’ experience in relevant roles.", "Fluent in French and/or English.", "Able to obtain Controlled Goods Program security clearance.", "GHGSat offers a creative and highly motivating work environment.", " We are located in the vibrant Plateau-Mont-Royal area.", " We offer competitive salaries, health and social benefits including flex-time and continuing development.", " We are an open and transparent company, firmly value our team spirit, and we are committed to preserving a diverse work environment."]}]