[{"title": "Junior Developer"}, {"subtitle": "description", "body": ["Listed as one of Canada’s hottest start-ups by the Globe and Mail, Next Pathway is a technology services company providing clients a pathway from existing to emerging technologies.", " Our automation technology helps our customers accelerate the migration of complex applications and workloads to the cloud.", "Next Pathway is full of bright and diverse thinkers.", " With deep exposure to AI, Machine Learning and Robotic Process Automation, our team members have opportunities to be trailblazers in the technology space.", " We encourage self-starters, transparency and team connectivity.", " We know diverse teams make strong teams.", " We welcome people of diverse backgrounds, experiences, and perspectives.", "Our work environment is based on 3 core principles:.", "·    Emphasize quality first, each and every time.", "·    Put people in roles where they will succeed and feel challenged.", "·    Build a team of well qualified individuals that can share ideas and learn from each other.", "Next Pathway rewards people for hard work, loyalty, innovation and mutual support.", " We aim to match people’s strengths, skills and talents to our requirements.", " Identifying this ideal match between attitude, skill and need, leads to success.", "Next Pathway is located in the heart of the Financial District, minutes from Union Station and the Subway.", "We are looking for Junior Developers (Mutations) to join our Team."]}, {"subtitle": "Qualifications:", "body": ["·      Programming and Scripting Knowledge, including SQL, Shell and Bash Scripting, Python.", "·      SQL review and optimization capabilities.", "·      Be aware of differences between different SQL dialects.", "·      Develop scripts to automate file manipulation and data loading.", "·      Creating and Modifying databases, along with creating/using views, stored procedures, and triggers to manipulate data.", "·      Have knowledge of regex and be able to create capture strings to match input.", "·      Work with QA and senior developers to develop test plans to cover delivered functionality.", "·      Have a basic understanding of Linux systems, such as using the command line and be familiar with the GUI.", "·      Understanding with working in the GIT environment.", "·      Editing programs such as VI, VIM and VSCode."]}, {"subtitle": "Additional Requirements:", "body": ["·      Computer Science or related background.", "·      Proven ability to write efficient, well documented and maintainable code.", "·      Adoption and experience with Agile and Scrum Development Methodology.", "·      Team Player with excellent interpersonal and communication skills (both written and verbal).", "·      Strong work ethic and a positive attitude.", "·      Be able to work productively as an individual when required.", "·      Have a passion for development.", "·      Strong analytical and problem-solving skills.", "·      Excellent time management skills."]}, {"subtitle": "Other Technologies you Might Work with Include:", "body": ["·      Microsoft Office Suite (Excel, Word, PowerPoint, Outlook).", "·      Basecamp: Project Management & Team Communication.", "·      Slack: Messaging Platform.", "·      Zoom: Meetings and Video Conferencing.", "·      Confluence: Collaboration Tool.", "·      JIRA: Project Management Software."]}]