[{"title": "Machine Learning"}, {"subtitle": "About Us", "body": ["Deep Genomics is a Toronto-based startup company that is changing the future of medicine using artificial intelligence.", " Founded in 2015, Deep Genomics brings together a multidisciplinary team of world-leading experts in machine learning, genomics, chemistry and biology.", " Together we are on a mission to develop an AI-powered platform for rapid discovery and development of the best genetic medicines, focusing on oligonucleotide drugs for the treatment of patients with rare genetic diseases."]}, {"subtitle": "Job Description", "body": ["We are seeking exceptional graduate students for an 8 to 12-month internship in 2020.", " Deep Genomics is poised to become the foremost AI-powered genetic medicine company by using data-driven approaches at every step of the drug design process.", " This involves a series of steps from processing raw genomic data, to training and evaluating large-scale machine learning models and applying them to accelerate target discovery and drug design.", " With the help of experimental data generated as part of our drug discovery process, our models continuously improve by learning from both successes and failures.", " Successful candidates will have an opportunity to contribute to the AI revolution in Genomics and help better understand and cure genetic disease by working closely with our research scientists and engineers on problems that are highly relevant to our mission."]}, {"subtitle": "Collaboration Is At The Heart Of Our Teams, We Often", "body": ["Our ML team works on developing our state-of-the-art AI workbench and using it to answer critical scientific questions.", "Meet with engineers and scientists with genomics, molecular biology, and medicine backgrounds to identify unique problems and brainstorm technical solutions.", "Present our analyses to a broad multi-lingual audience to ensure statistical robustness and reproducibility.", "Organize internal hackathons to quickly prototype solutions to problems."]}, {"subtitle": "Requirements", "body": ["Currently enrolled in a graduate program at a top-tier university in Computer Science, Electrical or Computer Engineering, Mathematics, or a related discipline.", "Experience with designing, training, debugging and evaluating neural networks using modern frameworks such as Tensorflow or PyTorch.", "Excellent scientific writing and presentation skills.", "Programming experience in at least one of Python, C or C++.", "Strong organizational, interpersonal, and communication skills."]}, {"subtitle": "What we offer", "body": ["Opportunity to collaborate with leading scientists working at the intersection of ML and genomics and contribute to this rapidly advancing field.", "Inspiring, creative and fast-moving startup located right next to the University of Toronto and within the MaRS Discovery District – an expanding hub of research in AI and genomics.", "Competitive compensation package.", "Deep Genomics thanks all applicants, however only those selected for an interview will be contacted."]}]