[{"title": "Software Engineer"}, {"subtitle": "Description", "body": ["The AWS Container Services organization is responsible for building and operating some of the core services that help customers run containerized microservices, including Amazon ECS, Amazon EKS, AWS Fargate, Amazon ECR, and AWS App Mesh.", " We have an ambitious roadmap that seeks to redefine how our customers build their applications and run them at scale.", " AWS Fargate is one of our big areas of investment.", " We want to let developers take full advantage of the speed, agility, and immutability that containers offer so they can focus on building applications rather than managing infrastructure.", "To achieve this vision, we are looking for a Software Engineer for the Fargate Data Plane team.", " The Fargate Data Plane is responsible for running container workloads (https://aws.", "amazon.", "com/blogs/containers/under-the-hood-fargate-data-plane/).", " This is where Fargate and Firecracker (https://firecracker-microvm.", "github.", "io/) meet and also where we work with other cutting-edge technologies such as container security, logging, metrics, and observability in the broadest possible sense to help customers run their tasks.", "If you are someone who is interesting in building high performance software and passionate about freeing developers to focus on building applications instead of managing infrastructure, this job is for you.", " You will be joining a team with the charter to make containers the new compute primitive and the first choice when architecting modern applications.", " You will have the chance to be a part of defining how developers use containers at scale."]}, {"subtitle": "If You Join Our Team, You Will", "body": ["Obsess over your customers and deliver a first-class experience for them.", "Take ownership of ambiguous problems and deliver solutions for them.", "Work on the complete software development life cycle: definition to delivery.", "Use data to make decisions and validate assumptions.", "Learn from others and help grow those in your team to achieve their best.", "Amazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation / Age."]}, {"subtitle": "Preferred Qualifications", "body": ["4+ years of professional software development experience.", "MS in Computer Science or related field or equivalent work experience.", "Technically sound in software development activities and life cycles.", "Experience with containers and the broader container ecosystem.", "Strong verbal and written communication skills.", "Strong analytic and problem solving skills.", "Solid knowledge of Linux internals.", "Internet and operating system security fundamentals."]}]