[{"title": "Masters Intern Software Engineering"}, {"subtitle": "Job Description", "body": ["NortonLifeLock Inc.", " (NASDAQ: NLOK) is a global leader in consumer Cyber Safety.", " NortonLifeLock is dedicated to helping secure the devices, identities, online privacy, and home and family needs of its nearly 50 million consumers, providing them with a trusted ally in a complex digital world.", " For more information, please visit NortonLifeLock.", "com or connect with us on Facebook , Twitter , LinkedIn , Instagram and YouTube .", "Want to work on products and services in use by millions of customers? Want to make an impact by helping people work, play, and communicate safely online?.", "This is an exciting internship opportunity with the Norton Engineering team where you help guard our customers against cybercrime."]}, {"subtitle": "Responsibilities", "body": ["Work on small research projects.", "Create test tools and work on product automation.", "Testing code and debugging failures.", "Support the product CM/Build framework."]}, {"subtitle": "Qualifications", "body": ["Candidates must be pursuing an Undergrad, Masters or PhD degree in Engineering, Computer Science, Computer Engineering or related field.", "Must be proficient in C/C++, Python.", "Knowledge of Windows development.", "Have a solid understanding of object-oriented design principles.", "Strong analytical, problem solving skills.", "Good knowledge of Algorithms and data structures.", "NortonLifeLock is proud to be an equal opportunity employer.", " We celebrate diversity and are committed to creating an inclusive and accessible environment for all employees.", " All employment decisions are based on merit, experience, and business needs, without regard to race, color, national origin, age, religion, sex, pregnancy (including childbirth or related medical conditions), genetic information, disability (physical or mental), medical condition, marital status, sexual orientation, gender identity or gender expression, military or veteran status, or any other consideration made unlawful by federal, state, or local law.", " NortonLifeLock strictly prohibits unlawful discrimination based on such protected characteristics and seeks to recruit the most talented candidates from diverse cultures and backgrounds.", "We also consider for employment qualified individuals with arrest and conviction records.", " In addition, NortonLifeLock will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant.", " Learn more about pay transparency .", "EEO is the law.", " Applicants and employees of NortonLifeLock Inc.", " are protected under Federal law from discrimination.", " See the EEO poster and supplement ."]}]