[{"title": "Software Engineer"}, {"subtitle": "about us", "body": ["Tenstorrent is helping enable a new era in artificial intelligence (AI) and deep learning with its breakthrough processor architecture and software.", " The company's mission is to deliver orders of magnitude better performance and efficiency for AI workloads from the datacenter to edge of Cloud by co-designing hardware, software and AI algorithms with our unique technology.", "Tenstorrent's architecture scales from datacenter servers to IoT devices with dramatically improved efficiency, flexibility, programmability compared to legacy accelerators including CPUs, GPUs, FPGAs, and TPU-type processors.", " It is developed by our world-class team with deep expertise in computer architecture, hardware design and verification, systems engineering, compilers, software development, and machine learning algorithms.", "Our engineering-based culture is focused on achieving the highest levels of AI innovation across all of Tenstorrent's technical disciplines.", " We constantly strive to blend best-in-class aspects of integrity, openness, diversity and collaboration throughout the company: from the CEO to the engineering leadership and to the newest employee who may be a recent college graduate.", " By joining Tenstorrent, you will be an integral part of a highly accomplished and distinguished team that has many years of experience at companies that include AMD, Arm, Intel and NVIDIA, and that thrives on delivering new, innovative products.", "Based in Toronto with offices in Austin, Tenstorrent is growing quickly.", " And, we are proudly backed by top-tier Venture Capital firms including Real Ventures and Eclipse Venture Capital, as well as prominent industry luminaries.", "Tenstorrent offers a highly competitive compensation package and benefits, and we are an equal opportunity employer."]}, {"subtitle": "Responsibilities", "body": ["Develop machine learning graph compiler.", "Participate in the co-design of Tenstorrent's hardware and software stack.", "Benchmark, analyze, and optimize performance of key machine learning applications across Tenstorrent's hardware and software stack.", "Develop performance analysis and estimation infrastructure that feeds into Tenstorrent compiler.", "Develop high-performance run-time engine.", "Integrate the Tenstorrent software into leading machine learning frameworks.", "Work closely with machine learning engineers to discover the hardware and software requirements of current and future machine learning applications."]}, {"subtitle": "Qualifications", "body": ["BSc, MSc or PhD in Electrical/Computer Engineering or Computer Science;.", "Experience with algorithms, data structures, and software development in C/C++.", " Python expertise is welcome as well.", "Familiarity with and passion for any of the following -- machine learning, compilers, parallel programming, high-performance and massively parallel systems, processor and computer architecture -- is a plus."]}]