[{"title": "Backend Software Engineer"}, {"subtitle": "about us", "body": ["We have come a long way since our first currency feed 23 years ago, we are an award-winning global company offering leading currency solutions for both retail and corporate clients, from a tech start-up to a global corporation.", " Founded in 1996, we became the first company to share exchange rate information on the internet free of charge and in 2001, we launched a trading platform that helped pioneer the development of online-based trading around the world, enabling forex and CFD investors the ability to trade the financial markets.", " Our vision is to transform how our clients can meet all of their currency needs with innovative and award-winning solutions.", " Under new ownership with significant ambitions to grow the business on the global stage, we are looking for highly motivated, passionate individuals who want to make a mark in a dynamic environment.", "Talented Software Engineers are critical to OANDA’s business success: as a software company - our products are only as good as the people who create them.", " With that in mind, OANDA looks for highly intelligent, innovative, and dedicated technology professionals."]}, {"subtitle": "Duties And Responsibilities", "body": ["Work in a small agile team building OANDA's core trading, hedging and execution services.", "Collaborate with product managers and other teams in defining new features and product offerings.", "Influence technical direction, choosing the best tools and approaches for the job at hand.", "Ensure delivery of a high-quality end product, that is usable, performant, and maintainable.", "Mentor team members, helping them succeed as developers and grow their careers.", "Working within a Linux / Solaris environment, you will research, design, test, implement, and maintain online and backend trading and data services infrastructure applications.", "Work closely with OANDA’s business and technical leadership to understand business requirements, and will collaborate with development team members to design and write applications systems and programs."]}, {"subtitle": "Qualifications", "body": ["At least 5 years of post-graduate working experience in a software engineering role.", "A University degree in computer science, computer engineering, or a related field.", " A graduate degree would be an asset.", "Solid application development experience using C++.", "Relevant experience in the development of Internet-ready applications programs using Internet communications protocols (TCP/IP).", "Experience with UNIX / Linux / Solaris operating systems.", "Proven ability to innovate in ways that contribute to the success of the business.", "A strong team orientation combined with the drive and ability to contribute at the individual level.", "Exceptional communications skills – both oral and written.", "Developer experience with scripting languages such as Python would be an asset."]}]