[{"title": "Machine Learning Software Developer"}, {"subtitle": "Position Overview:", "body": ["Circle Cardiovascular Imaging Inc.", " is looking for a Machine Learning Software Developer in the field of machine learning.", " The ideal candidate is someone who is passionate about pursuing new ideas, is strong at solving complex problems and has a willingness to challenge the status quo to create remarkable solutions.", " The successful candidate will be highly organized, results-driven and effective at presenting intricate ideas and concepts to others."]}, {"subtitle": "General Responsibilities:", "body": ["Research and develop advanced machine learning algorithms and big data analysis in the medical industry.", "Leverage and improve upon state-of-the-art machine learning methods to solve challenging problems across a variety of domains.", "Research and develop advanced image processing algorithms.", "Work closely with a team of developers to design and develop medical image post-processing software.", "Work closely with regulatory and quality assurance analysts to ensure development of quality software.", "Work closely with scientific advisors and physicians to develop algorithms for solving clinical problems ."]}, {"subtitle": "Required Skills/Experience:", "body": ["Strong theoretical knowledge, including mathematical foundations of modern machine learning systems and techniques.", "Strong programming skills in C++, Python, and TensorFlow."]}, {"subtitle": "Beneficial Skills/Experience:", "body": ["Experience with QT, OpenGL, and OpenCV.", "Experience with DICOM images (MR and CT).", "Experience with macOS, Linux, and Windows command line interface.", "Experience in the medical imaging software industry."]}, {"subtitle": "Educational Requirements:", "body": ["MSc or PhD in Engineering, Computer Science or related field."]}, {"subtitle": "About Circle Cardiovascular Imaging Inc.", "body": ["Circle Cardiovascular Imaging Inc.", " develops world class, advanced reading and reporting solutions for cardiac imaging.", " Circle is a prominent company for the global cardiac imaging community bringing together an experienced and qualified team of over 150 people.", " .", "Circle’s imaging platform, cvi42, is the best-in-class cardiovascular imaging reading and reporting solution for cardiac MR, cardiac CT, cardiac Interventional Planning and Electrophysiology.", " Annually, millions of cardiac exams - in over 1,000 hospitals and in more than 50 countries - are interpreted using cvi42, giving physicians the tools to accurately quantify and diagnose complex cardiovascular diseases whilst improving patient outcomes and the effective utilization of healthcare resources.", " Currently at version 5.", "11, cvi42 fully embeds AI into one easy to use platform demonstrating capabilities within the same range as expert human readers."]}, {"subtitle": "How to apply:", "body": ["We are an equal opportunity employer and value diversity at our company.", " We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.", " While we thank all those who apply, however please note that we will only be contacting those selected for an interview.", " No phone calls or unsolicited agency referrals please."]}]