[{"title": "C++ Software Developer"}, {"subtitle": "About us:", "body": ["INIT is the worldwide leading supplier of IT solutions for buses and trains.", "We assist more than 700 transport companies in making public transport more attractive and more efficient.", " Thus, we make mobility easy for both, the users of our systems and passengers in Europe, America, New Zealand, Australia and Asia.", " .", "INIT offers space for ideas and responsibility.", "Joining us will give you the chance to significantly contribute to the future of mobility while building your career.", " Implement your own ideas with the joy of success, assume responsibility and develop your professional and personal skills – that’s what you can achieve with us.", " Flexible working hours, comprehensive additional benefits and a good working environment – that’s what we offer you.", " We look forward to receiving your online application at www.", "initse.", "com."]}, {"subtitle": "Your missions:", "body": ["You will be part of our software development teams developing and implementing of innovative solutions for public transport.", "Your main task will be the development of software in C++ for our PC- and ARM-based products such as on-board computers, ticket printing devices such as ticket vending machines and passenger information displays.", "You will analyze, design and implement software in close cooperation with our software teams in Karlsruhe, Germany, and international customers.", "You will take over project responsibilities and be in contact with our customers."]}, {"subtitle": "Your profile:", "body": ["University degree in a technical field such as computer science or similar.", "Hands-on experience in C++, object-oriented software design / development.", "Knowledge of Git version control system, Microsoft Visual Studio, cmake and Windows 7/10 would be a plus.", "Very good communication skills and sense of responsibility.", "Team spirit as well as motivation to work in an international environment.", "Willingness to travel (inter alia during the initial training period in Karlsruhe).", "Proficient in written and spoken English."]}]