[{"title": "Data Science Manager"}, {"subtitle": "about us", "body": ["The data team as part of AI@Unity provides data science solutions and machine learning capabilities for Unity’s internal needs across multiple departments.", " We solve business problems with the teams by partnering and implementing state of the art machine learning business applications, data science algorithms, and other data-fueled solutions.", " The Data Science team responsible for recognizing and developing these business opportunities is growing and needs a leader who understands machine learning to focus on growing and fostering our Data Science team.", "In this role, you will lead our data science in identifying, scoping, and solving business problems with machine learning and data across our globally distributed company.", " From partnering with our Operate teams to collaborating with our marketing teams, you’ll have the opportunity to have an impact on how our business operates and grows around the world."]}, {"subtitle": "Responsibilities", "body": ["Provide thought leadership for connecting data needs, and data collection across Unity.", "Actively engage with business stakeholders to discover new opportunities for Machine Learning to support Unity’s customers and operations.", "Build and grow a global team of talented data scientists.", "Work with the product team to define how services based on machine learning can help our customers.", "Empower a team of top-talent to implement top of the class solutions as part of our services offering."]}, {"subtitle": "Requirements", "body": ["Education on machine learning, math, physics, computer science or equivalent.", "Sold high level understanding of machine learning principles and methodologies.", "Desire and experience to hire, grow, nurture and lead highly skilled professionals.", "Understanding of Mobile Games ecosystem, vision and passion for solving problems.", "Capable driver of initiatives and motivator of people.", "Experience managing or leading teams of machine learning developers or data scientists."]}, {"subtitle": "Bonus Points", "body": ["Expertise in computer vision or reinforcement learning.", "Experience building end-to-end machine learning systems and deploying them to production."]}, {"subtitle": "About Unity Technologies", "body": ["Unity is the world’s leading platform for creating and operating real-time 3D (RT3D) content.", " Creators, ranging from game developers to artists, architects, automotive designers, filmmakers, and others, use Unity to make their imaginations come to life.", " Unity’s platform provides a comprehensive set of software solutions to create, run and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices.", "The company’s 1,400+ person research and development team keeps Unity at the forefront of development by working alongside partners to ensure optimized support for the latest releases and platforms.", " Apps developed by Unity creators were downloaded more than three billion times per month in 2019 on more than two billion unique devices.", " For more information, please visit www.", "unity.", "com.", "Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees.", " Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law.", " If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.", "Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers.", " Unity does not accept unsolicited headhunter and agency resumes.", " Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity."]}]