[{"title": "Data Science Engineer"}, {"subtitle": "TD Description", "body": ["Tell us your story.", " Don't go unnoticed.", " Explain why you're a winning candidate.", " Think \"TD\" if you crave meaningful work and embrace change like we do.", " We are a trusted North American leader that cares about people and inspires them to grow and move forward.", "Stay current and competitive.", " Carve out a career for yourself.", " Grow with us.", " Here's our story: jobs.", "td.", "com."]}, {"subtitle": "Department Overview", "body": ["Job Description Summary.", "Develops and maintains technical solutions that adhere to engineering and architectural design principles while meeting business requirements.", " Provides technical expertise with a focus on efficiency, reliability, scalability, and security; includes planning, evaluating, recommending, designing, operationalizing, and supporting solutions in compliance with enterprise and industry standards."]}, {"subtitle": "Job Description", "body": ["CUSTOMER: Leverage deep technology expertise for own area of specialization to deliver and ensure that all areas across the organization that provision, manage and support various technologies have the necessary tools, processes and documentation required to effectively execute on their respective mandates.", "• Execute on Engineering strategy as it relates to the introduction of tools and the automation of build, test, release and configure activities across Application, Platform and Infrastructure.", "• Partner with the Operations team to automatically integrate with appropriate tools and processes as part of automated/self-serve Application, Platform or Infrastructure releases.", "• Work with partners across Technology and apply in-depth understanding of relevant business needs to identify and leverage synergies across the various areas.", "• Act as the expert or lead innovator and agent of change for the programs and services under management.", "• Work with other teams to implement best practices for engineering and management.", "• Work with vendor platform providers and engineering peers to keep abreast of trends, products, frameworks, and applications.", "• Identify and effectively manage stakeholder engagement and impacts across the enterprise.", "• Interpret client needs, assess engineering related requirements and identify solutions to non-standard requests.", "SHAREHOLDER: Apply best practices and knowledge of internal / external business issues to improve products or services in own discipline.", "• Monitor and control costs within own work.", "• May interact with governance and control groups, (e.", "g.", " regulatory / operational risk, compliance and audit) to provide subject matter expertise and consult on risk issues / items related to Engineering technology and tools.", "• May develop and/or contribute to negotiations of third party contracts/agreements.", "• Maintain knowledge and understanding of external development, engineering and emerging solutions, market conditions and their impact.", "• Proactively identify emerging technologies and innovative solutions for building more robust platform domains.", "EMPLOYEE / TEAM: Continuously enhance knowledge/expertise in own area and keep current with emerging industry trends, new technologies and best practices in the external market that can contribute to delivering effective client solutions.", "• Prioritize and manage own workload in order to deliver quality results and meet timelines.", "• Support a positive work environment that promotes service to the business, quality, innovation and teamwork and ensure timely communication of issues/ points of interest.", "• Participate in knowledge transfer with senior management, the team, other technical areas and business units.", "• Work effectively as a team, supporting other members of the team in achieving business objectives and providing client services.", "• Identify and recommend opportunities to enhance productivity, effectiveness and operational efficiency of the business unit and/or team."]}, {"subtitle": "Job Requirements", "body": ["BREADTH & DEPTH: Advanced knowledge of specific domain or range of engineering frameworks, technology, tools, processes and procedures, as well as organization issues.", "• Advanced knowledge of TD applications, systems, networks, innovation, design activities, best practices, business / organization, Bank standards.", "• Advance experience, knowledge and skills in own discipline.", "• Works independently with minimal guidance.", "• Acts as a SME resource for colleagues with less experience.", "• Solves complex problems; takes a new perspective on existing solutions.", "• Generally reports to a Manager or above.", "EXPERIENCE & EDUCATION: University or post-graduate degree.", "• Strong academic background (e.", "g.", ", computer science, engineering).", "• 5-7 years relevant experience."]}, {"subtitle": "Inclusiveness", "body": ["At TD, we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported.", " We are dedicated to building a workforce that reflects the diversity of our customers and communities in which we live and serve.", " If you require an accommodation for the recruitment/interview process (including alternate formats of materials, or accessible meeting rooms or other accommodation), please let us know and we will work with you to meet your needs."]}]