[{"title": "Software Engineer"}, {"subtitle": "about us", "body": ["Do you want to be a part of an organization that:.", "gives back to the community.", "has leadership that inspires, coaches and mentors.", "allows you to speak up and be heard.", "AND .", " likes to have FUN?.", "What about tech? Cutting edge solutions? Big Data and AI? Pelmorex has all of that covered!.", "Founded in 1989, Pelmorex has become an international weather information and data management company.", " We own and operate the popular weather brands: The Weather Network, MeteoMedia, Eltiempo.", "es , Clima and Otempo.", "pt .", " We also operate the National Alert Aggregation and Dissemination (NAAD) System, which is the technical backbone of Alert Ready, Canada's Emergency Alerting System."]}, {"subtitle": "Why We Need You…", "body": ["We are looking for an enthusiastic and motivated Software Engineer to join our Real-time Bidding team.", " You will work with the entire engineering department to build out business critical features, tools and improvements that allow us to scale rapidly.", " If you want hands on experience with high frequency, data driven systems, then this position will be a great fit."]}, {"subtitle": "Whats The Day To Day Look Like…", "body": ["You get to have the opportunity to work with Software design and architecture.", "Analysis is your jam and you like to work with Software efficiency analysis.", "Big picture thinker you will have the opportunity to build tools for our team, and sometimes for others.", "Team work makes the dream work and working with other teams in the engineering department to continuously push features into production is your jam.", "Be a change driver - Implement performance driven improvements to our system.", "Diagnosing complex issues that affect business."]}, {"subtitle": "But What Really Makes You Stand Out Is…", "body": ["Bachelor’s or Master’s degree in Computer Science.", "2-3 years of experience as a server-side software engineer.", "You meticulously test your code before deploying it.", "You have touched asynchronous web frameworks such as Tornado, Twisted, asyncio, aiohttp etc.", "You have experience with multi-processing architectures.", "You have experience working with non-relational databases, such as MongoDB, Redis, Cassandra, etc.", "Bonus if you’ve worked in ad-tech before."]}, {"subtitle": "You are Made for This if You…", "body": ["Designing and developing backend systems using a variety of technologies is what you enjoy doing most.", "You love what you do but you are seeking more professional and personal development.", "Python, and Bash are your second language."]}]