[{"title": "Software Engineer"}, {"subtitle": "about us", "body": ["We are the leading provider of Academic-Dental software solutions; our products enable the delivery of transformative learning experiences.", " We have been successful in taking ownership of the Enterprise Academic-Dental market in North America with greater than 90% market share through our people first approach to business.", " We want to continue building on that success while expanding our presence in related markets.", " To achieve those goals, we are looking for a Software Engineer who is passionate about continuous learning, brings strong software development experience and adopts a collaborative approach to problem solving.", " .", "The primary responsibility of this role is to build our market-leading axiUm desktop enterprise solution, along with our suite of services.", " You will be engaged throughout all phases of the software development life cycle and use your drive for technology and quality to help us exceed customer expectations.", " .", "You have 5+ years of experience as a Software Engineer being involved both with front end and backend development.", " You are passionate about technology and look forward to a role that will have you work as part of a cross-functional development team with full ownership for the entire product.", " This role reports to the Development Manager, axiUm."]}, {"subtitle": "Responsibilities:", "body": [" Build technically sound solutions that optimize for maintainability, performance, scalability, and security.", "Constantly help the team improve quality and productivity, while simplifying existing code.", "Participate in an Agile environment collaborating with Project Management, Product Owners, QA and Documentation to ship high-quality software on time.", "Continuously learn and leverage technologies to improve and effectively build enterprise software."]}, {"subtitle": "Qualifications:", "body": [" Bachelor’s Degree in Computer Science or equivalent experience.", "5+ years of hands-on software development experience.", "Several years of development experience with C++, C# and .", "NET technologies.", "Solid understanding of Oracle or other relational databases.", "Professional knowledge of OOP and enterprise design patterns.", "Hands-on experience with scaled web application development and service-oriented architecture.", "Experience with CI/CD pipelines."]}]