[{"title": "Junior Software Engineer"}, {"subtitle": "about us", "body": ["Arista Networks is looking for world-class software engineers to join our Extensible Operating System (EOS) software development team.", " As a core member of the EOS team, you will be part of a fast paced, high caliber team building features to run the world's largest data center networks.", " Your software will be a key component of Arista's EOS, Arista's unique, Linux-based network operating system that runs on all of Arista's data center networking products.", "The EOS team is responsible for all aspects of the development and delivery of software meant to run on the various Arista switches.", " You will work with your fellow engineers to understand functional and technical requirements for upcoming projects.", " You will help write functional specifications, design specifications, test plans, and the code to bring all of these to life.", " You will also work with customers to triage and fix problems in their networks.", " Internally, you will develop automated tests for your software, monitor the execution of those tests, and triage and fix problems found by your tests.", " At Arista, you will own your projects from definition to deployment, and you will be responsible for the quality of everything you deliver.", "This role demands strong software engineering fundamentals, and good understanding of networking including capabilities like L2, L3, and fundamentals of commercial switching HW.", " Your role will not be limited to a single aspect of EOS at Arista, but cover all aspects of EOS."]}, {"subtitle": "Responsibilities:", "body": ["Write functional specifications and design specifications for features related to forwarding traffic in the internet and cloud data centres.", "Implement solutions to small-sized problems in our EOS software, using the C, C++, and python programming languages.", "Write test plan specifications for small-sized features in EOS, and implement automated test programs to execute the cases described in the test plan.", "Debug problems found by our automated test programs and fix the problems.", " .", "Work on a team implementing, testing, and debugging solutions to larger routing protocol problems.", "Work with the System Test Engineers to analyze problems found in their tests and provide fixes for those problems.", "Review and contribute to the specifications and implementations written by other team members.", "Help to create a schedule for the implementation and debugging tasks, update that schedule weekly, and report it to the project lead."]}, {"subtitle": "Qualifications:", "body": ["BS Computer Science/Electrical Engineering/Computer Engineering + 2 years experience, or MS Computer Science/Electrical Engineering/Computer Engineering, or equivalent work experience.", "Knowledge of C, C++, and/or python.", "Knowledge of UNIX or Linux.", "Understanding of networking including at least one of the following areas is desirable:.", "IP routing protocols, such as RIP, OSPF, BGP, IS-IS, or PIM.", "Layer 2 features such as 802.", "1d bridging, the 802.", "1d Spanning Tree Protocol, the 802.", "1ax Link Aggregation Control Protocol, the 802.", "1AB Link Layer Discovery Protocol, or RFC 1812 IP routing.", "Ability to utilize, test, and debug packet forwarding engine and a hardware component’s vendor provided software libraries in your solutions.", "Infrastructure functions related to distributed systems such as messaging, signalling, databases, and command line interface techniques.", "Hands on experience in the design and development of ethernet bridging or routing related software or distributed systems software is desirable.", "Applied understanding of software engineering principles.", "Strong problem solving and software troubleshooting skills.", "Ability to design a solution to a small-sized problem, and implement that solution without outside help.", " Able to work on a small team solving a medium-sized problem with limited oversight."]}]