[{"title": "Process Control Programmer"}, {"subtitle": "about us", "body": ["With a legacy that spans over 100 years, Stelco is a company that has grown along with Canada and its global partners.", " We understand that twenty-first century competition demands the highest quality products, period.", " So, Stelco is bringing together the people, technology, and unmatched market knowledge to, once again, take on that challenge from here at home."]}, {"subtitle": "About the role:", "body": [" .", "We are seeking talented, motivated people to help us create the next generation of Stelco, known for consistently out-performing the competition, delivering superior returns, and creating value for our customers as a world-class supplier of innovative steel products and solutions.", "Safety is the Core Value of Stelco and the individual will make Safety their first priority in all work activities.", "This is a Process Control Programmer / Analyst role in the Steelmaking area and reports to the Manager - Process Automation.", "Your day-to-day:.", "Implement manufacturing process improvements through software changes in an Oracle Forms and Reports 12c environment.", "Design, develop, test and document Oracle objects.", "Learn and understand the steelmaking process and apply appropriate software enhancements to improve operating efficiencies.", "Work with personnel from various disciplines in a manufacturing environment toward continual improvement in production capabilities.", "Support critical production applications in a timely fashion to avoid production delays.", "Off-hours, on-call response to high priority issues is required."]}, {"subtitle": "Job Qualifications:", "body": ["Bachelor’s degree or college diploma in Computer Science, Software Engineering or similar program.", "A valid license and reliable vehicle are required.", "Working knowledge of Oracle SQL and PL/SQL is required.", "Experience with Oracle Developer Suite (Oracle Forms and Reports Developer).", "Experience with relational data, ERDs, and data normalization.", "A positive attitude with an interest in expanding responsibilities."]}, {"subtitle": "Job Skills and Knowledge:", "body": ["Communicate in a clear and concise manner, both written and verbal, that is appropriate for the audience.", "Ability to troubleshoot and work through complex technical issues.", "Ability to work as part of a larger team as well as independently.", "Excellent organizational and multi-tasking skills.", "Demonstrated analytical/mathematical abilities.", "An interest in career development.", " ."]}, {"subtitle": "Other Preferred Skills:", "body": ["Oracle Application / WebLogic Server.", "Oracle Database Administration.", "Experience with C, C#, C++, or other object-oriented programming.", "Familiarity with active directory, DNS, DHCP, FTP, TCP/IP, batch files and the ability to troubleshoot basic networking problems would be an asset."]}, {"subtitle": "Work Environment:", "body": ["Includes work in both office and mill environments with a high impact team."]}]