[{"title": "macOS Software Developers"}, {"subtitle": "About Us", "body": ["In 2004, Teradici set out to create the best virtual desktop and workstation experience in the world, and along the way we've enabled the most demanding use cases with requirements like top secret security, complex IT infrastructures, and intensive graphics performance.", " Our PCoIP technology fundamentally simplifies how computing is provisioned, managed and used.", "With over 15 million endpoints deployed around the globe, we're no startup.", " Top government agencies, media conglomerates, production studios, financial firms, and design houses trust Teradici to support their need for secure, high-performance virtual desktops and workstations delivered from private data centers, public clouds, or any combination of both."]}, {"subtitle": "Overview", "body": ["We are looking for talented, creative and team orientated Software Developers to participate in the design and development of our PCoIP Cloud Access Software, which is used by many of the big names in the Media & Entertainment industry, offering a secure, full-fidelity user experience - delivering the ultimate in remote access performance.", " Our Cloud Access Software product spans Linux, and Windows including kernel drivers and application software.", " In addition, the client product suite includes macOS, iOS and Android clients.", "As part of an Agile development team, you will be responsible for the design, development and testing of software for all levels of the product.", " To be successful in this role, you should have previous experience in at least one of the following development layers: application development and/or driver development on macOS."]}, {"subtitle": "Responsibilities", "body": ["Work within a Scrum team to design, implement and maintain application software and kernel drivers.", "Write high performance, secure, reliable and maintainable code with solid unit test coverage.", "Troubleshoot issues in the lab, utilizing debugging tools for application software and kernel drivers."]}, {"subtitle": "Requirements", "body": ["Bachelors or Masters in Computer Science, Computer Engineering, Software Engineering or equivalent.", "Strong macOS development knowledge and experience.", "Minimum of 2 years of C++ software development experience.", "Excellent software design and programming skills.", "First class analytical, diagnostic and problem solving skills.", "Excellent verbal and written communication skills with an ability to collaborate with developers, product owners and other team members.", "Passion to work in an exciting environment and deliver new technologies and products to the marketplace.", "Ability to learn quickly.", "Please advise in your application whether you are eligible to work in Canada."]}, {"subtitle": "Bonus Points", "body": ["Experience with multi-threaded high performance programming with in-depth knowledge of CPU architectures.", "Hands on experience with test automation and scripting languages (e.", "g.", " Perl and/or Python).", "Experience with Agile development approaches such as Scrum."]}, {"subtitle": "Values", "body": ["Secure products.", " You understand the importance of a secure SDLC and that this is not an afterthought once all the features are developed.", "Automate everything.", " You actively automate many manual tasks as possible so that these tasks can be repeated many times and allow us to scale.", "Self-managed teams.", " You hold yourself accountable for the full end-to-end lifecycle of what you are working on, from ensuring you are building something that will deliver customer value to getting it into customers' hands.", "Customer collaboration.", " You want feedback from customers to ensure your work is providing value and to enable you to iterate on that work.", "Tech-debt reduction.", " Software can live longer that you expect; therefore, you need to ensure it stays healthy and manage your technical debt accordingly.", "Collective ownership.", " You value contribution, wherever it comes from, and believe in peer review, continuous integration, test coverage and customer validation."]}, {"subtitle": "Perks", "body": ["We offer a competitive base salary, Employee Bonus Plan (company performance based) and stock option grants.", " Our health benefits and retirement savings contributions start right away – no waiting period! We also offer three weeks of vacation for the first year (accrued and increased annually, up to 20 days per year).", "We develop and nurture our employees to be their best and bring their authentic selves to every team interaction.", " We strive for a dynamic team environment that is transparent and allows everyone to contribute and be heard.", "The health and safety of our employees is our top priority.", " As a result of COVID-19, we have implemented a Work From Home initiative for all employees and we encourage our teams to stay connected virtually during this time.", "Once our office is open again, we are excited to offer:.", "Monthly social events & activities.", "Luxury shuttle service to and from the nearest SkyTrain station.", "Underground and secured bike \"cage\".", "Fully equipped onsite gym, Basketball, \"Beach\" Volleyball court and weekly yoga classes.", "Teradici supports remote work flexibility using our own Cloud Access Software!."]}]