[{"title": "Junior Programmer"}, {"subtitle": "SUMMARY STATEMENT", "body": ["This role will be responsible for supporting senior programmers and consultants in managing the delivery of reports for multiple study programmes; with the aim of ultimately being able to manage and run a complete programme.", " .", "This is a perfect role for an ambitious programmer just starting their career who is keen to work in an un-hierarchical and global organisation.", " You will have exposure to studies programs from end to end including scoping, creating, iterating and producing, and will be able to learn from qualified experts in the team, in addition to working closely with our consultants and clients.", " It is expected that the incumbent will contribute project experience, research and analysis skills to the team, and will be able to apply out of the box thinking and creativity to truly make an impact within the organisation.", " ."]}, {"subtitle": "KEY RESPONSIBILITIES", "body": ["Success in this role will see the following achieved:.", "Develop, manage and deliver the desired outputs for the assigned insights programmes.", "Manage survey data from different sources – face-to-face interviews, online and phone studies.", " This includes, storage, review and cleansing, and sharing.", "Analyse survey data using both existing and innovative methodologies.", "Visualise results using both existing (SAS) and interactive dashboards.", "Understand existing data and code structure, workflow and processes and proactively suggest innovations.", "Develop skills in order to be responsible for each stage of the programme cycle, as follows:.", "Questionnaire design (either paper or online).", "Data capture template development.", "Data entry/data audit.", "Deliver reports (static and interactive) to various clients.", "Manage various ad hoc requests.", "Interact proactively and positively with programme managers and colleagues from other areas of NMG to gain better understanding of the various programmes and deliver accurate outputs.", "Applying a creative and curious mindset, applying new and evolving approaches to improve the effectiveness and efficiencies of our Insights studies.", "Living the NMG Values of Collaboration, Make it Count, Curiosity and ‘Go for it!’."]}, {"subtitle": "YOUR EXPERIENCE", "body": ["The successful candidate for this role will be able to demonstrate:.", "Qualifications & Experience:.", "Graduate-level position (up to 3 years’ experience).", "A bachelor degree or higher (in Computer Science, Statistics/Mathematics, Computing or equivalent) with strong academic performance.", "Strong visualisation skills (dashboard and/or graph designing).", "[Essential] Working knowledge in SAS (SAS Base, SAS/GRAPH) – current data management and reporting are done in SAS.", "[Plus] Knowledge in other programming languages is valued e.", "g.", " VBA, JavaScript, HTML, CSS, Python, R.", "Proficient in Excel and Power Point.", " .", "Competencies:.", "Good analytical abilities, ability to interrogate and model data.", "Creativity and ability to think ‘outside the box’.", "Excellent attention to detail.", "Ability to prioritise competing demands and organise work flows clearly.", "Ability to work well under pressure.", "Effective communication skills at all levels, able to build excellent working relationships with clients and team members.", "Proved fast and keen learner – willing to ask questions when necessary.", "Passion in programming as well as data analysis.", "Curious, flexible and learning-oriented.", "Ambitious and motivated."]}, {"subtitle": "ABOUT NMG", "body": ["The NMG Group is a global advisory and intermediary firm focused exclusively on the financial services sector.", " Established in 1992, NMG has enjoyed rapid expansion internationally and now has over 800 employees in 18 cities worldwide.", " Our guiding principal is to always ‘Find a Better Way’.", "NMG Consulting is a leading multinational insurance, reinsurance and investments consultancy, integrating consulting, insights and analytics.", " Our consultants provide strategy consulting, insights, analytics and actuarial services to financial institutions including banks, insurers, reinsurers and fund managers.", "We are constantly evolving and the range of work that we do challenges and expands our peoples’ knowledge at lightning speed.", " Our flat, team-based structures encourage participation from all experience levels – everyone is encouraged to contribute, regardless of their role.", " We advocate hearing different points of view, collaboration and constructive debate."]}]