[{"title": "Machine Learning Engineer"}, {"subtitle": "About Us", "body": ["We build technologies that empowers our parent company, the world's fastest-growing mobile payments and commerce ecosystem.", " In addition to the our app we use our skills and our biggest asset - data, to make our dent in this universe.", "We are committed to offering the most transparent, secure, and personalized consumer experience to over 230 million users.", " We believe that this kind of scale and the unique problems that it presents attracts curious candidates like yourself."]}, {"subtitle": "Job Description", "body": ["We are looking for engineers with a passion to develop novel machine learning software systems for fraud detection, personalization and CTR prediction and deploy the systems to production, and test them to ensure all client's business needs are covered.", "In this team of data scientists, statisticians and machine learning engineers, you will create software that are used by millions of people.", "You will perform ETL to build model features using petabyte scale datasets and develop high throughput and low latency systems to serve models in production touching lives of more than 300M customers everyday.", " You will collaborate with highly innovative engineering teams to put machine learning functionalities into production systems that we build in-house.", "We are looking for someone who oozes passion, ownership, and a love of building great things.", " The Product and Engineering teams will rely heavily on your build.", " You'll have a ton of trust and responsibility.", " So, if challenges excite you, and you're ready for a big one, let us know."]}, {"subtitle": "Responsibilities", "body": ["Perform ETL with massive data from multiple applications and 300 M+ customers.", "Architect, design and evaluate novel approaches for handling high-volume real-time data streams in an inferencing environment.", "Own the development, training, optimizing, and deployment of machine learning systems.", "Develop measurement and feedback systems at web scale to improve the selection of features and/or algorithm design."]}, {"subtitle": "Qualifications", "body": ["Strong software development skills (+3 years working experience), with proficiency in Python or Scala preferred.", "Experience in building ETL pipelines to perform feature engineering on large-scale dataset using Big Data technologies such as Spark.", "Ability to explain and present analyses and machine learning concepts to a broad technical audience.", "Ability to initiate and drive projects to completion with minimal guidance.", "Knowledge in advanced data structures and can use them to solve problems.", "You have a Masters degree or equivalent in Computer Science, Engineering, Mathematics or related field.", "Working knowledge of PyTorch, Tensorflow or other similar frameworks is a plus.", "Creative, collaborative, & product focused."]}, {"subtitle": "What we Offer!", "body": ["We are proud to announce that we have been certified as a Great Place to Work!.", "A collaborative, open work environment that fosters ownership, creativity, and urgency.", "Enrolment in the Group Health Benefits plan right from Day 1, no waiting period.", "Fuel for the day: Weekly delivery of groceries and all types of snacks to our office.", "All types of signature drinks from coffee to lattes to cappuccinos.", "Catered lunch and desserts on a monthly basis!.", "Ping Pong and Pool: Become our next Table Tennis/ Pool champ!.", "And so much more!."]}]