[{"title": "Data Scientist"}, {"subtitle": "description", "body": ["We're looking for a data scientist to join our fraud team to help us identify risk exposures, develop and implement suitable fraud risk mitigation strategies to minimize losses.", " All while ensuring a strong user experience!.", "Your goal is to help accelerate Dapper's growth as a trusted platform by providing insights and data in order to protect our community and userbase.", " The work you do to detect, prevent, and mitigate unwanted behaviour (particularly around payments) will be a key component to scaling Dapper to our partners games and applications."]}, {"subtitle": "The Ideal Candidate Has", "body": ["Previous experience working in fraud detection and prevention, and is looking for the next phase of their growth at a emerging company.", "If you are excited about the opportunity to join as the first data scientist on this team and to build and grow a service of your own then this could be the right opportunity for you!."]}, {"subtitle": "A Little About Us", "body": ["Dapper Labs is the company behind CryptoKitties and the Flow blockchain as well as upcoming titles like NBA Top Shot.", " Founded in 2018, Dapper Labs uses blockchain technology to bring new forms of digital engagement to fans around the world.", " Blockchain-enabled applications can bring fans closer with the brands they love, give people a real stake in the communities they contribute to, and create new ways for consumers to become creators themselves.", " Publicly-announced Dapper Labs partners include the NBA and NBPA, Warner Music Group, Ubisoft, and UFC.", " Notable investors in Dapper Labs include Andreessen Horowitz, Union Square Ventures, Venrock, Google Ventures, Samsung, and the founders of Dreamworks, Reddit, Coinbase, Zynga, and AngelList, among others."]}, {"subtitle": "What We’ll Accomplish Together", "body": ["Work cross-functionally to analyze large amounts of behavioural and transaction data to uncover fraudulent behaviour and activity.", "Create predictive models to understand user-level fraud risk.", "Consistently consume and produce massive amounts of data while optimizing for speed, accuracy, and quality.", "Research and develop how advanced data science techniques and machine learning can enable and empower our fraud detection capabilities.", "Innovate our data methods to create a single coherent platform with sources of truth that serve many stakeholders including the Dapper product team and our finance department."]}, {"subtitle": "A Little About You", "body": ["You have previous experience working in fraud detection and prevention, with an understanding of the impact that has on other areas in the company where business and product decisions are made.", "You are capable of applying your skills across a variety of use cases; inflexible specialists need not apply.", "You have a bachelor's degree in a highly quantitate field (Computer Science, Machine Learning, Statistics, Mathematics), and a master's degree preferred.", "You have 5+ years working experience in data science and or machine learning.", " Strong knowledge of SQL and python programming and graph databases.", "You are naturally curious and passionate about fraud prevention: if something seems off, you want to investigate what's going on and solve the true problem.", "You are capable of tackling very loosely defined problems and thrive when given autonomy in your day to day decisions."]}, {"subtitle": "More About Dapper Labs", "body": ["At Dapper Labs we recruit the best and foster an environment that empowers our team.", " That means a workplace that is diverse, inclusive, and open-minded.", " We welcome applicants of all backgrounds, regardless of race, colour, religion, sexual orientation, gender identity, national origin, or disability.", " Even if you feel you don't meet all the requirements listed above, we encourage you to apply!.", "Dapper team members are humble and curious entrepreneurs, builders, and tinkerers who share a passion to demystify blockchain technology and tap its potential to create change in the world.", " Our people are our greatest strength: our diverse crew flourishes in a distributed hierarchy where personal autonomy and professional growth are encouraged.", " We value our culture above else: regardless of where you came from, what you studied, or who you used to work for, your role here will necessitate both a high level of creativity and strategic thinking on complex issues.", " Everyone here is a founder, and no one fits in a box.", " We’re all driven by an insatiable thirst for learning and development, and that’s what brings us together."]}, {"subtitle": "Our People Are What Makes Our Team Special - Because Of That, We Work Hard To Provide Our Full-time Team Members Perks That Make Their Lives Better By Offering", "body": ["○ Flexible vacation & remote work policy - as we accomplish our goals, time off is more than a must.", " Most team members take between 15-20 days off per year, but we have no hard limit for our high impact individuals.", "○ Diverse opportunities for learning and development - we provide resources for conferences, classes, books, and other opportunities to maintain and expand your skill set and professional growth.", "○ Fitness reimbursements - stay fit with our reimbursements for health-related benefits like gym memberships, fitness apps, and personal training.", "○ Top-Line equipment - in addition to receiving a company smartphone of your choice with a paid voice/data plan, every team member receives a generous equipment budget to try new gadgets, tools, and platforms.", "○ Flexible parental leave policies - We understand the importance and demands of a growing family.", " In addition to state, provincial, and federal leave allowances, parents on the team have the flexibility to work from home or take days off when family needs to come first.", "○ When we can safely return to our office, fuel up with healthy snacks and coffee, get fit with an onsite gym, recover with onsite RMT/acupuncturist, and meet the many furry friends of our dog-friendly office!.", "Check out our careers page to learn more about what other benefits we offer!."]}]