[{"title": "Junior Staff Scientist"}, {"subtitle": "description", "body": ["ONC seeks an individual with a background in geophysics to join the Science team.", " This new Junior Staff Scientist will primarily support projects related to seismology, tectonics, and seafloor geodesy, as well as gas hydrates, sea bed dynamics and geological storage of CO2.", " In particular, the successful candidate will assist with managing the seismological data acquisition, analyzing geophysical data streams, coordinating sensor tests and calibrations, collating data sets, and supporting the scientific community by organizing workshops and with generating publications and proposals."]}, {"subtitle": "Job Summary", "body": ["Ocean Networks Canada is a world-leading organization supporting ocean research and discovery, and ocean observing technology innovation.", " ONC is a not-for-profit society that operates and manages cabled observatories in the coastal and deep Pacific and Arctic Oceans on behalf of the University of Victoria that supply continuous power and Internet connectivity to various scientific instruments located in coastal, deep-ocean, and Arctic environments.", " ONC’s cable arrays host hundreds of sensors distributed in, on and above the seabed along with mobile and land based assets strategically located, instruments that address key scientific and policy issues (subsea earthquakes and tsunamis, ocean acidification, marine biodiversity, etc.", ") within a wide range of environments.", "The core ONC user base is composed of scientists accessing the facility and data archives to conduct world-leading research.", " The ONC Science Services department provides a wide range of services to assist in the planning, execution, and completion of marine research, with the primary outcome being world leading scientific publications.", " .", "Within the Science Services department, itself a part of the User Engagement Division, Junior Staff Scientists contribute to the execution of science-based services as articulated in the Strategic Plan of ONC, in which serving the research users and providing scientific solutions to stakeholders are core mandates.", " The Junior Staff Scientist, Geophysics,works with and reports to Senior Staff Scientist to facilitate research support activities for ONC users and stakeholders, particularly focusing on their respective area of competency.", " In conjunction with staff from the ONC Data Team, the Junior Staff Scientists are responsible for validating data quality through managing sample collection and analysis.", " They are also responsible for ensuring users receive the data necessary to support their research objectives.", " In this capacity, they may also be responsible for collecting and transferring field samples to external science users.", " Under the direction of the Staff Scientists, they assist with multivariate earth-ocean data analysis.", " .", "The Junior Staff Scientist, Geophysics, will support the ONC Science team in the geophysical programs in seismology, tectonics, seafloor geodesy as well as gas hydrates, sea bed dynamics and geological storage of CO2.", " In particular, they will assist with managing the seismological data acquisition, analyzing geophysical data streams, coordinating sensor tests and calibrations, collating data sets, and supporting the scientific community by organizing workshops and with generating publications and proposals.", "The Junior Staff Scientists also work with Data Team members to assemble and publish observatory data sets.", " Junior Staff Scientists assist in the planning and execution of annual maintenance expeditions and other field-based activities as they relate to instrument preparation, data integrity, and sample collection.", " Together with the other members of Science Services, they also support workshops, conference presence and other user engagement activities as required.", " ."]}, {"subtitle": "Job Requirements", "body": ["The successful applicant will have a minimum of a Masters (M.", "Sc.", ") degree in Marine Geophysics, including experience in seismometry, geodynamics, and/or geodesy, with at least 2 years of relevant data analysis experience in an observational, experimental, or modelling in Geophysical marine science discipline.", " An equivalent combination of education, training, and work experience may be considered where appropriate."]}, {"subtitle": "Essential qualifications include: ", "body": ["Oceanographic expedition experience, including collecting, processing, and analyzing samples at sea.", "Significant work experience using advanced programming environments (e.", "g.", " MATLAB, R, Python, or IDL) to analyze and integrate multi-dimensional, multi-variate data.", "Significant work experience in data visualization and the presentation of data analysis .", "Experience in producing accurate scientific communications, including peer-reviewed publications, conference abstracts and presentations, and summaries for broader audiences."]}, {"subtitle": "In addition, the following attributes and experience are highly desirable: ", "body": ["Experience with modeling and computer simulation.", "Experience with web content management and web-based interactive collaboration environments .", "Experience with web-based data access technologies .", "Experience in organizing, running, and summarizing scientific workshops.", "Experience in preparing regular briefings and status reports .", "A sound reputation in the marine science community, either locally or nationally combined with data related marine science publications either as the lead or with a co-author.", " ."]}, {"subtitle": "Assets include: ", "body": ["Excellent analytical, critical thinking and problem solving skills.", "Superior communication skills, both written and verbal.", "Ability to build and maintain productive working relationships with all stakeholders.", "Ability to work independently and collaboratively in a team environment.", "Proven track record achieving project goals on time and produce deliverables of a high quality."]}]