[{"title": "Software Engineer"}, {"subtitle": "Job Description", "body": ["Would you be excited about creating reliable and scalable online services and features, to be used by millions of players all around the world?.", "We are an independently-run part of Activision with a small company feel.", "Do you love games, engineering, working with other senior technical staff, and online/multiplayer technology? Then we’d love to hear from you!."]}, {"subtitle": "Your Mission", "body": ["You will be a part of our titles department in Demonware and work here in our Vancouver office.", "Your mission is to work on delivering large name games titles, leveraging many of the existing technologies created by Demonware and developing new online services and features to support the future of the online gaming market.", " The development is geared towards low-latency and large-scale distributed systems that can handle millions of concurrently connected users.", "Meaning you will have a large impact on the online and multiplayer experience for AAA multiplayer games, including Call of Duty."]}, {"subtitle": "Your Responsibilities", "body": ["Developing custom backend online services and features that are reliable and scale to be used by millions of players all around the world.", "Own, operate and support the services and features you develop.", "Working as a partner to game studios, designing online and multiplayer player experiences.", "Working with game studio engineers to troubleshoot problems with online and multiplayer features.", "When necessary, travel to game studios to provide on-site design and integration support.", "Providing technical mentorship to other team members through software engineering best practices.", "Good understanding of the Software Development Lifecycle including, but not limited to, agile software development methodology (Scrum or Kanban)."]}, {"subtitle": "Your Profile", "body": ["Expertise in Python or C++ coding, or skills in a similar language.", "Experience with databases (ideally MySQL, Cassandra, and redis).", "Understanding of networking technologies, e.", "g.", " TCP, UDP, security and scalability.", "Excellent problem solving and analytical skills.", "Good communication and customer facing skills.", "Degree in Computer Science, Computer Engineering or equivalent program."]}, {"subtitle": "Nice To Have", "body": ["Experience with multi-platform development, including PC, Xbox One, and PS4.", "Understanding of large scale services (up to millions of concurrent users).", "Has initiative, and is able to complete complex tasks with minimal supervision.", "Enjoys working with other engineers.", "Willingness to travel for extended visits to game studios."]}, {"subtitle": "What Demonware Offers", "body": ["An excellent salary, with annual performance reviews and discretionary bonuses.", "5 weeks of vacation, standard.", "Pension matching and contributions.", "Top-tier medical, dental, and life insurance coverage.", "Flexible working practices, based on the belief that the quality of your work is not dependent on the number of hours sitting behind a desk.", "A culture that emphasizes continual learning and improvement, with opportunities for career progression, travel, and a commitment to open source."]}, {"subtitle": "Demonware By The Numbers", "body": ["469+ million gamers.", "3.", "2+ million concurrent online gamers.", "100+ games.", "300,000 requests per second at peak.", "Average query response time of <.", "02 second.", "630,000+ metrics a minute.", "132 billion+ API calls per month."]}]