[{"title": "Data Scientist"}, {"subtitle": "Are you the next Data Scientist at Theory+Practice?", "body": ["Do you want to apply advanced AI and Ml to real-world problems? Have an insatiable appetite for learning and finding solutions? Love to access some of the worlds largest data-sets? Then, you may be the right fit.", "Theory+Practice is a rapidly growing data science company focused on bringing cutting edge AI/ML solutions to unlock value for companies with large data sets.", "Our Fortune 500 clients leverage our Intelligent Intervention Frameworks to make strategic decisions about the right moments and actions to improve customer journeys and maximize key business metrics.", " .", "With an ever-increasing client base, we are looking to hire Data Scientists into our team.", " The ideal candidate will be passionate about solving high-impact problems for our clients in a fast paced, collaborative team and has experience using data to find opportunities for businesses.", " .", "We attract independent thinkers who share a desire for excellence within an open culture.", " If you have passion for leveraging state of the art analytics to solve complex problems, we invite you to join our team!."]}, {"subtitle": "Description​", "body": ["A Data Scientist will join a growing group of AI specialists and software engineers at Theory+Practice working closely with client business specialists to systematize data driven insights and decision making.", " If you have a passion for leveraging new technologies and methods to solve complex problems, and love to be in an environment that fosters growth while being part of a great team we invite you to consider joining our team!."]}, {"subtitle": "Responsibilities​", "body": ["Build pragmatic, scalable and rigorous ML and AI solutions for TAP customers that enables data driven improvements for businesses such as recommendation engines, opportunity scoring frameworks, customer intent models, etc.", "Deliver effective business solutions from ideation to QA and deployment.", "Work collaboratively with Theory+Practice colleagues and clients to define problem statements, collect data and define solution approaches.", "Build and maintain ML models, experiments, and forecasting analytics.", "Leverage Python, Hadoop, Spark and similar Big Data frameworks to deliver efficient analytics.", "Communicate clearly the methods, impact and processes you have taken with clients and other stakeholders."]}, {"subtitle": "Qualifications​", "body": ["Masters or Ph.", "D.", " degree in a STEM field (e.", "g.", " Computer Science, Engineering, Physics, Mathematics, Statistics, Economics, or related field);.", "3 to 5 years of industry or academic experience solving analytical problems using ML approaches;.", "Experience performing data extraction, data cleaning, exploratory data analysis and sharing results over medium to large datasets;.", "strong Python and SQL skills;.", "Experience with NumPy, SciPy, and Pandas;.", "Experience with one or more of Scikits-learn, TensorFlow, Keras, Theano or PyTorch;.", "Excellent analytical skills to self-assess robustness and performance of machine learning models;.", "Good communication skills to explain insights and methods;.", "Experience with Big Data systems and frameworks (Hadoop, AWS, GCP, Spark, etc) is a plus.", "Enjoy learning new data science methods and technologies."]}]