[{"title": "Research Software Developer"}, {"subtitle": "description", "body": ["IFG is on the search for a Software Developer.", " The Software Developer will leverage their skills and experience to develop training tools and experimental frameworks to support our client; a global IT giant and leader in using deep learning to solve complex language-understanding problems and in training machines to model the reasoning and decision-making capabilities of humans.", "In this position, you will build and maintain model training management tools.", " You will also work closely with the Research team to define infrastructure requirements and implement features to facilitate large-scale research experiments on compute resources."]}, {"subtitle": "Responsibilities", "body": ["Architect and program efficient and scalable training systems that drive state-of-the-art ML / deep learning research.", "Accelerate the lab’s research by improving access to and efficiency of distributed training infrastructure.", "Run engineering projects end to end with minimal supervision.", "Maintain our tools for experiment deployment and ensure researchers are empowered by those tools, i.", "e.", ":.", "add new features and improve existing ones.", "implement accommodations for edge cases.", "keep up with features/changes in backends.", "track issues and fix bugs.", "keep documentation up to date.", "Engage collaboratively with researchers on how they use experimental platforms, explore alternative approaches, and enable new use cases without compromising accessibility or stability."]}, {"subtitle": "Requirements", "body": ["Bachelor degree or an advanced degree (Master, PhD) in Computer Science, Engineering, mathematics, or related field (or the equivalent combination of education and experience).", "3+ years of software development experience in Python and ability to produce maintainable, reusable code.", "Experience in contributing to or maintaining open-source (OSS) projects.", "Ability to architect, design and implement large scale systems."]}, {"subtitle": "Preferred Requirements", "body": ["Experience in machine learning, distributed systems and working with GPU infrastructure.", "Experience in applying, implementing, and/or developing algorithms for machine learning, artificial intelligence, or statistics.", "Experience with Docker and Kubernetes or similar orchestration frameworks.", "Hands-on experience with at least one of the following tools: PyTorch, Tensorflow."]}]