[{"title": "Intern, Business Data Analyst"}, {"subtitle": "description", "body": ["The Intern, Business Data Analyst Business is responsible for supporting the Customer Service team and contributing to CN’s Intermodal offering by comparing rail, truck and terminal operations to CN’s customer commitments.", " With an expertise in analysis and reporting, the incumbent mines data while adopting the latest Business Intelligence (BI) tools rolled out by I&T which are key to driving self-serve reporting within Intermodal.", " Role responsibilities include managing and analyzing a large volume of data pertaining to shipments, building customer scorecards to drive and measure CNs performance, working with end-users to drive self-serve analytical tools such as Tableau and Power BI, and consolidating cross-functional data to help identify operational gaps across the network on all services."]}, {"subtitle": "Major Responsibilities", "body": ["Analyze Key Performance Indicators (KPI) and scorecards.", "Participate in training and user adoption on self-serve.", "Evaluate synergies within the end-user and consumer base.", "Collaborate with I&T & BI teams.", "Design and develop reporting solutions."]}, {"subtitle": "Requirements", "body": ["Strong numeracy skills.", "Analytical thinking.", "Knowledge of Microsoft Office, specifically Excel.", "Knowledge of Tableau and Power BI."]}, {"subtitle": "Education", "body": ["Working towards a Bachelor’s Degree in Mathematics, Computer Science, or Business."]}, {"subtitle": "About CN", "body": ["CN is a world-class transportation leader and trade-enabler.", " Essential to the economy, to the customers, and to the communities it serves, CN safely transports more than 300 million tons of natural resources, manufactured products, and finished goods throughout North America every year.", " As the only railroad connecting Canada’s Eastern and Western coasts with the Southern tip of the U.", "S.", " through a 19,500 mile rail network, CN and its affiliates have been contributing to community prosperity and sustainable trade since 1919.", " CN is committed to programs supporting social responsibility and environmental stewardship.", " At CN, we work as ONE TEAM, focused on safety, sustainability and our customers, providing operational and supply chain excellence to deliver results.", "CN is an employment equity employer and we encourage all qualified candidates to apply.", " We thank all applicants for their interest, however, only candidates under consideration will be contacted.", " Please monitor your email on a regular basis, as communication is primarily made through email."]}]