[{"title": "Cloud Engineer"}, {"subtitle": "About Us", "body": ["BeyondTrust is the worldwide leader in Privileged Access Management (PAM), empowering organizations to secure and manage their entire universe of privileges.", " Our integrated products and platform offer the industry's most advanced PAM solution, enabling organizations to quickly shrink their attack surface across traditional, cloud and hybrid environments.", "The BeyondTrust Universal Privilege Management approach secures and protects privileges across passwords, endpoints, and access, giving organizations the visibility and control they need to reduce risk, achieve compliance, and boost operational performance.", " We are trusted by 20,000 customers, including 70 percent of the Fortune 500, and a global partner network."]}, {"subtitle": "Position Summary", "body": ["The Cloud Engineer is responsible for researching, designing, implementing, securing, and maintaining a mission critical cloud infrastructure used by users located around the globe.", " The Cloud Engineer must display self-motivation and the ability to respond with innovation to new technological problems and new possibilities."]}, {"subtitle": "Responsibilities And Essential Functions", "body": ["Responsible for the day to day availability, monitoring, maintenance, incident response and resolution of the BeyondTrust cloud infrastructure.", "Experience operating, securing, and managing AWS or Azure cloud environments.", "Managing cloud environments in accordance with company security guidelines.", "Relevant work experience with user access administration and automation in AWS or Azure.", "Implement risk and compliance policies and procedures.", "Define and enforce policies to achieve required cloud security, uptime, and availability.", "Update process documentation - ensure documentation of entire environment is current.", "Evaluate and implement effective solutions for systematically identified and defined problems, threats, and preventive maintenance items.", "Work with various stakeholders across multiple internal organizations to define and deliver services that meet their business needs.", "Communicate problems, risks, or issues with peers and manager in clear, concise, positive, friendly, and end-user understandable manner.", "Scope assigned project/tasks and provide accurate time estimates."]}, {"subtitle": "Education / Experience Requirements", "body": ["2 or more years’ experience managing a large cloud environment.", "Proficiency in AWS and Azure.", "AWS or Azure certifications a plus.", "Bachelor's Degree in Computer Science, Computer Engineering, or equivalent experience."]}, {"subtitle": "What professional traits will make me successful?", "body": ["Problem Solving: Open to a wide range of ideas, will consider both traditional and innovative options.", " Driven and resolved to ‘fix’, possess a self-belief and confidence in ideas and solutions.", "Communication Skills: Ability to engage and appreciate the needs of different audiences.", " Ability to communicate through proper documentation.", "Customer Focus: Capacity to deal with internal departments in an engaging, professional and courteous way.", "Life Learner: Enjoys learning and is always learning something new.", "Interpersonal Skills: Has awareness of the way one comes across to others and has a professional demeanor.", "Analytic: Possesses a systematic and problem-solving style.", " Logical approach to issues, wary of superficial conclusions, prefer to examine relevant information.", "Flexibility: Capacity to cope with the unexpected.", " Appreciate when traditional approaches no longer work and may be due for a review.", " Recognize the need for re-organization, whether they are a proponent or are on the receiving end of change.", "Team Orientation: Should be receptive, tolerant and willing to share.", "Motivated: Self-motivated to keep up with technological advancements in managing large scale cloud deployments.", "Willingness to support and adhere to Company’s Core Values."]}, {"subtitle": "description", "body": ["This is an exciting and pivotal point in the company’s evolution.", " More enterprise organizations are recognizing the regulatory compliance and cybersecurity best practices of securing and managing privileged access to systems with highly sensitive data.", " BeyondTrust’s industry-unique ability to automatically discover and secure privileged credentials, while also protecting privileged access pathways, positions BeyondTrust for sustained growth in the burgeoning Privileged Access Management market.", " The importance of the channel has never been greater.", "It’s paramount that you feel safe and secure throughout our hiring process and, if successful, as you onboard into the business.", " In response to the current Covid-19 pandemic, whilst the majority of our offices remain open, we are recommending that our employees work from home where possible.", " All of our interviews are taking place virtually over Microsoft Teams or Zoom and we are onboarding all new global hires on a remote basis.", "We understand that the world of work is evolving and we are a company that prides ourselves on our adaptability and ability to provide an inclusive and flexible environment which embraces all team members regardless of whether they are based in one of our offices or at home."]}]