[{"title": "Software Engineer"}, {"subtitle": "About Us", "body": ["Launched in 2011, Twitch is a global community that comes together each day to create multiplayer entertainment: unique, live, unpredictable experiences created by the interactions of millions.", " We bring the joy of co-op to everything, from casual gaming to world-class esports to anime marathons, music, and art streams.", " Twitch also hosts TwitchCon, where we bring everyone together to celebrate, learn, and grow their personal interests and passions.", " We’re always live at Twitch.", " Stay up to date on all things Twitch on LinkedIn , Twitter and on our Blog ."]}, {"subtitle": "About The Role", "body": ["Amazon Interactive Video Service (IVS) is an exciting new AWS service for building live interactive experiences using the same technology that powers Twitch’s own live video system.", " Every day, millions of people across the globe experience the joy of interactive live video powered by IVS.", " We’re looking for a software engineer to join our passionate and supportive team to help expand the IVS platform with features to bring new interactive experiences to life.", "As part of the Interactivity team, you will support a product roadmap of new features that help connect live broadcasters and audiences.", " You’ll lead a team of experienced engineers in designing, and operating highly available distributed systems.", " Your efforts will power public-facing APIs for AWS customers and developers, and systems that end-users directly work with at scale.", " You will work closely with engineers, product, operations, and leadership from across the Video Platform.", "You will be thoughtful engineers who communicate clearly and have a demonstrated history of delivering solutions to complex problems.", " You are passionate about engineering excellence and are committed to building a collaborative team culture where everyone’s ideas are valued.", "At Twitch, you will experience the benefits of a fun and supportive environment, while having access to the tools and resources of AWS."]}, {"subtitle": "You Will", "body": ["Deliver new interactivity features for Amazon Interactive Video Service.", "Contribute to the design, implementation, and operations of distributed systems using Go and AWS.", "Collaborate in a fun and supportive team environment committed to engineering excellence."]}, {"subtitle": "You Have:", "body": ["A degree in Computer Science, a related Engineering discipline, or equivalent experience.", "Hands-on technical experience building distributed systems at scale.", "Significant knowledge of networking, systems design, API design, and web security.", "Expertise with AWS or similar cloud platform services."]}, {"subtitle": "Perks:", "body": ["Medical, Dental, Vision & Disability Insurance.", "401(k).", "Maternity & Parental Leave.", "Flexible PTO.", "Amazon Employee Discount.", "Monthly Contribution & Discounts for Wellness Related Activities & Programs (e.", "g.", ", gym memberships, off-site massages , etc.", " )."]}]