[{"title": "Senior Gameplay/Animation Programmer"}, {"subtitle": "Company Overview", "body": ["WarnerMedia is a leading media and entertainment company that creates and distributes premium and popular content from a diverse array of talented storytellers and journalists to global audiences through its consumer brands including: HBO, HBO Max, Warner Bros.", ", TNT, TBS, truTV, CNN, DC Entertainment, New Line, Cartoon Network, Adult Swim, Turner Classic Movies and others."]}, {"subtitle": "About WB Games Montreal", "body": ["Since its launch in 2010, WB Games Montréal has more than 300 employees and continues to grow and recruit additional talents.", " Working with some of Warner Bros.", " Studios’ biggest brands, including DC Entertainment, the studio is dedicated to developing triple A videogames ."]}, {"subtitle": "Job Description", "body": ["WB Games Montreal, a division of Warner Bros.", " Interactive Entertainment (WBIE), seeks a Senior Gameplay/Animation Programmer to work with its game development team responsible for a new IP, AAA title.", "As a Senior Gameplay/Animation programmer, this individual will design, develop, maintain, and optimize cross-platform Gameplay systems and algorithms with specific 3Cs/Animation components, examples of which include: NPC behaviors, character controllers, IK, facial animation."]}, {"subtitle": "Job Responsibilities", "body": ["Design, develop, maintain and debug efficient Gameplay/animation systems.", "Work with gameplay engineers, game designers and tech animators to integrate and use the developed systems.", "Gather requirements from game and level designers and document the systems.", "Identify and implement efficient Gameplay/Animation systems and algorithms."]}, {"subtitle": "JOB QUALIFICATION STANDARDS:", "body": ["3-5 years of software development experience in the game industry.", "6+ years of experience with C/C++.", "Experience developing for Xbox One and/or PS4.", "Experience with advanced animation techs (FK/IK, animation graphs, powered ragdolls, …).", "Relevant experience with Unreal Engine 4 is a plus.", "Procedural animation experience is a plus."]}, {"subtitle": "Education, Professional Training, Technical Training or Certification", "body": ["Minimum of B.", "S.", " in Computer Science or related field."]}, {"subtitle": "Knowledge/Skills", "body": ["Strong knowledge of 3D maths.", "Good grasp of animation techs.", "Good grasp of gameplay systems (AI, pathfinding, character controllers, etc).", "Good grasp of multithreading challenges.", "Good communication skills.", "Experience debugging large systems.", "Microsoft Visual Studio development environment.", "Experience with large-scale console games programming at all stages of the life-cycle."]}, {"subtitle": "Other Requirements", "body": ["Ability to work well under pressure and deadlines.", "Creative, focused, results-oriented, self-motivated, resourceful problem-solver.", "Strong code architecture and design skills.", "Ability to collaborate with engineers and content creators in an open, team environment."]}]