[{"title": "Software Developer Analyst"}, {"subtitle": "about us", "body": ["At CN, we work together to move our company—and North America—forward.", " Be part of our Information & Technology (I&T) team, a critical piece of the engine that keeps us in motion.", " From enterprise architecture to operational technology, our teams use the agile methodology to automate and digitize our railroad ensuring our operations run optimally and safely and our employees can focus on value-added tasks.", " You will be able to develop your skills and career in our close-knit, safety-focused culture working together as ONE TEAM.", " The careers we offer are meaningful because the work we do matters.", " Join us!."]}, {"subtitle": "Job Summary", "body": ["This role is responsible to produce properly programmed and tested software solutions to meet defined business requirements.", " This involves producing design specifications for solution components when needed.", " This also involves translating detailed design specifications into executable code and includes programming, testing, analyzing, maintaining and documenting new and/or existing software applications.", "Main Responsibilities Software Development.", "Software design (e.", "g.", " technical designs, component and class designs).", "Test cases/scenarios and test data (unit test, automated testing and support integrated testing as needed).", "Tested and documented program code.", "Gather requirement and produce or contribute to functional and non-functional design.", "Translate the functional design into a software design, e.", "g.", " program specifications, including technical designs for both 3rd party package components and/or custom developed solution components.", "Provide, or verify, work estimates.", "Ensure optimal re-use and leveraging of existing program components versus the need for the development of new and/or customized functions.", "Write new, or modify existing, program code based on software design and/or programming specifications.", " This includes documenting the program code.", "Conduct unit testing.", " If required, also conduct functional and integration testing, including preparation of test cases/scenarios and test data.", "Diagnose and resolve code defects.", " Determine whether redesign is required for proper resolution.", "Ensure solutions are able to satisfy high-availability and disaster recovery requirements.", "Analyze, design and produce application enhancements.", "Report progress status and issues.", "Apply, and ensure compliance with, all appropriate CN IT standards (e.", "g.", " Code quality, Security, Architecture, Project Delivery Methodology, SOX, etc.", ").", "Working Conditions.", "The role has standard working conditions in an office environment with a regular workweek from Monday to Friday.", " The role requires occasional travel in North America."]}, {"subtitle": "Requirements Experience", "body": ["Minimum of 3 years’ experience in a related field such as software development."]}, {"subtitle": "Education/Certification/Designation", "body": ["Bachelor degree in computer science, information system, engineering, or equivalent related project experience."]}, {"subtitle": "General Skills and Competencies", "body": ["Ability to summarize complex situations in an efficient manner.", "Ability to manage development on many projects simultaneously.", "Advocate the re-use of existing components, frameworks and libraries.", "Provide guidance and support to team members including integrators and testers.", "Understand and follow corporate processes (e.", "g.", " SDLC & SOX processes).", "Functional/technical proficiency with large full life cycle projects with Back-End development."]}, {"subtitle": "Technical Skills/Knowledge", "body": ["Experience in Project delivery and software engineering projects in a corporate or enterprise environment using Java (+ UI/UX (Angular) is an asset) and Python.", "Experience with JEE, Spring, J2EE, ResfFull Web Services (and MQ messaging experience is an asset).", "Experience working with XML, REST APIs, SOAP APIs JBoss, SQL/PSQL, Maven, Jenkins, Jira, and source control systems (Git Bitbucket).", "Experience developing Shell scripts (Unix).", "Proficient in Development Practices and methodologies (Agile, Iterative, Waterfall)."]}, {"subtitle": "About CN", "body": ["As a leading North American transportation and logistics company, CN is a true backbone of the economy.", " With a team of approximately 25,000 railroaders, our focus is on moving both our company and the economy forward.", " We transport US$200 billion worth of goods annually for a wide range of business sectors from resource to manufactured products to consumer goods, across a 20,000-mile network spanning Canada and mid-America.", " CN is the only Canadian company listed in the Transportation and Transportation Infrastructure sector of the Dow Jones Sustainability World Index (DJSI).", " Launched in 1999, the DJSI World represents the gold standard for corporate sustainability.", " At CN, we work as ONE TEAM, focused on safety, sustainability and our customers, providing operational and supply chain excellence to deliver results."]}]