[
    {
        "title": "Systems Analysts"
    },
    {
        "subtitle": "Ideal candidates should have",
        "body": [
            "10 years’ experience as a systems or integration analyst in a project environment including integration specifications, data modeling, and data migration experience.",
            " The Response should include at least 3 examples including duration of the project or work that total at least 10 years.",
            "5 years’ experience involved in the implementation of clinical information systems in a healthcare environment in an analysis role.",
            " The Response should include at least 2 examples including duration of the project or work that total at least 5 years.",
            "3 years’ experience analyzing patient data conversion and mapping requirements from a central client registry system to new systems implemented in a healthcare setting.",
            " The Response should include at least 2 examples including duration of the project or work that total at least 3 years.",
            "1 year of experience implementing an Initiate client registry system in a healthcare setting.",
            " The Response should include at least 1 example including duration of the project or work that totals at least 1 year.",
            "3 years’ experience performing integration and data conversion analysis on a Radiology Information System (RIS) or a Picture Archiving and Communication System (PACS) used for diagnostic imaging services.",
            " Integration must follow the Health Level 7 (HL7) standard.",
            " The Response should include at least 1 example including duration of the project or work that totals at least 3 years.",
            "3 years’ experience implementing the Allscripts Suite of products in a healthcare setting including integration and reporting analysis.",
            " The Response should include at least 2 examples including duration of the project or work that total at least 3 years."
        ]
    },
    {
        "subtitle": "Required Qualification",
        "body": [
            "Post-Secondary degree majoring in computer science, software development, business computing, or management information systems.",
            "Valid PRINCE2 Foundation or Practitioner certification."
        ]
    }
]