[{"title": "Associate QA Engineer"}, {"subtitle": "Eligible to Work Remotely: Yes, occasionally", "body": ["Expectation is to mainly be lab based in location (Mumbai, London, Paderborn) with potential of occasional remote work.", "Expect more.", " Connect more.", " Be more at Diebold Nixdorf.", " Our teams automate, digitize, and transform the way more than 75 million people around the globe bank and shop in this hyper-connected, consumer-centric world.", " Join us in connecting people to commerce in this vital, rewarding role."]}, {"subtitle": "Position Overview", "body": ["The Associate Quality Engineer is responsible for reviewing system requirements, support test automation, create test plans, create test cases, develop data requirements, execute test cases and organize and present results."]}, {"subtitle": "You are responsible for", "body": ["Plans own work under supervision as input to estimation of effort required by team.", "Assists in the review of test requirements and specifications and the definition of cases and scripts in collaboration with experienced tester.", "Supports the creation of test environment and executes and interprets results of test scripts and cases of low complexity and reports back results to test manager.", "Documents test results and records defects properly and timely according to pre-defined criteria and formats.", "Provides quality and status-reports associated with own work according to pre-defined criteria and formats.", "Signals irregularities in test execution and provides feedback to senior testers/ QA manager.", "Performs impact analysis of change requests and changing requirements of low complexity and reports back results to test manager.", "Participates in best practice sharing events and gains lessons learned.", "Completes own work per defined schedules and quality expectations to satisfy project priorities with little direction from lead/manager.", "Contributes to the development and implementation of team and group process improvements.", "Actively participates in the decision-making process regarding test coverage for system under test."]}, {"subtitle": "Qualifications", "body": ["University/College Alumni in Computer Science or Math or equivalent experience.", "Must have 1-2 years of Experience including experience building test data & testing stored procedures.", "Strong understanding of Microsoft Windows / Deployment Environment Building.", "Experience in building PC’s and relevant device hardware.", "Experience generate execution plans and identifying identify red flags would be an asset.", "Experience with Jira is an asset.", "Familiarity with hard drive imaging an asset.", "A thorough understanding of development and testing methodologies.", "Industry knowledge of Requirements Based Testing and Test Driven Development.", "Demonstrate expertise at test case, test script, and test plan development, execution and automation.", "Solid and hands-on experience in designing, developing and maintaining test plans, establishing test infrastructure, test automation.", "Strong understanding of software integration process & pitfalls.", "Strong judgment and decision-making abilities, problem solving ability.", "Should be able to share opinions openly & challenge processes, testing methodologies etc.", "Work with minimal supervision, but know when to ask the right questions.", "Ability to manage time and handle multiple priorities.", "Must be analytical, detailed and team oriented.", "Must have VERY good communication & interpersonal skills.", "Acute attention to detail, a must have value quality!."]}, {"subtitle": "Why should you join Diebold Nixdorf?", "body": ["Brightest minds + technology and innovation + business transformation The people of Diebold Nixdorf are 23,000+ teammates of diverse talents and expertise in more than 130 countries, harnessing future technologies to deliver personalized, secure consumer experiences that connect people to commerce.", " Our culture is fueled by our values of collaboration, decisiveness, urgency, willingness to change, and accountability.", "–Diebold Nixdorf is an equal opportunity employer and we value diversity at our company.", " We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."]}]