[{"title": "Computer System Validation Consultant"}, {"subtitle": "description", "body": ["Resolute Workforce Solutions is dedicated to helping organizations achieve tangible results and lasting improvements via successful project delivery, continuous process improvement and effective management of change.", " We serve businesses in a wide range of industries including Pharmaceuticals, Food & Beverage, Chemicals, and Medical Cannabis.", "Currently we are looking for highly motivated and energetic individual to join our team as a Computer System Validation Consultant, with a focus on Computer Systems, Computerized Systems, Automation, in GTA.", " We are looking for the \"right\" person with the can-do, results-oriented, and analytical attitude with ability to excel in challenging conditions.", "NOTE: This incumbent will be responsible for ensuring the regulatory compliance of projects related to Computer Systems, Computerized Systems and Automated Systems and act as a quality and compliance resource with knowledge and expertise pertaining to the quality, regulatory and validation requirements for various departments."]}, {"subtitle": "Responsibilities:", "body": ["Technical Compliance in Computer System Validation:.", "Provide validation, quality and cGMP compliance guidance and expertise to project teams and all other departments including Quality Assurance, Production and Engineering departments.", "Conduct quality review and approval of the design of new computer systems, computerized systems and automated systems (such as User Requirements and Design Specifications).", "Conduct quality review and approval of quality policies, validation plans, qualification / validation protocols and other relevant documents for computer systems, computerized systems and automated systems as a QA approver.", "Review and/or assist in developing validation strategies and associated documentation against the requirements of the Validation Plan (VP) to ensure that compliance and business needs are achieved.", "Act as a QA responsible for Change Control requests.", " Perform quality and compliance assessments to determine impact of changes to the validation status, using the appropriate change control procedures and act as Validation and/or QA approver as required.", "Defend the validation strategies and programs for computer systems, computerized systems, automated systems during regulatory audits as primary point of contact to ensure company compliance to all regulatory requirements.", "Act as a quality/compliance subject matter expect (SME) for investigation records, making decisions and solving problems and for review/approval of proposed remedial and corrective actions.", " Ensure that any proposed CAPA are appropriately assessed for validation impact.", "Provide quality guidance and assessment to ensure the maintenance of and changes to the validated systems are managed in accordance with current corporate and regulatory requirements.", "Ensure that all work is performed in full compliance with cGMP's, SOP's and established safety standards.", "Project Management and Co-ordination:.", "Attend all relevant project meetings, create minutes and agendas; follow up on actions.", "Ensure that all validation activities are coordinated appropriately with other departments to meet project timelines.", "Attend Change Control Request board meetings, assist in drafting the action plan, managing Change Control Requests to ensure timely closure.", "Communicate project expectations to team members and resolve issues to meet validation timelines and deliverables.", "Coordinate approval of validation documents and deliverables, where required."]}, {"subtitle": "Qualifications:", "body": ["Minimum a bachelor degree in science, engineering, computer science or other technical discipline.", "Minimum 5 years of direct experience in quality assurance and compliance in the pharmaceutical or biopharmaceutical industry with a focus on Computer Systems, Computerized Systems and Automated Systems.", "Excellent working knowledge in GAMP standards for computerized systems and automated systems and regulatory requirements in data integrity and 21 CFR Part 11.", "In-depth understanding and working knowledge of regulatory requirements (FDA, HPFBI, EU) in validation and qualification standards for pharmaceutical or biopharmaceutical drug product manufacturing for the international markets.", "Experienced in attending and responding to regulatory audits will be an asset.", "We thank all applicants in advance; however, we will only contact the candidates whose qualifications match closely to the job requirements.", "Resolute Workforce Solutions welcomes and encourages applications from people with disabilities.", " Accommodations are available on request for candidates taking part in all aspects of the selection process."]}]