[{"title": "Performance Measurement Analyst"}, {"subtitle": "Job Summary", "body": ["The Performance Measurement Analyst is responsible for working with Specialists, Business Analysts or directly with Business Partners to define business requirements for reports and dashboard development, as well as metrics and Key Performance Indicators (KPIs), design performance dashboards and reports.", " The incumbent interacts with Business Intelligence (BI) Analysts, Modellers, and other Front-end Developers to design and deliver business information layers to support metrics and dashboards.", " The incumbent is accountable for the development and the testing of metrics and KPIs to support business requirements.", " The position ensures reports and dashboards are delivered to Business Partners."]}, {"subtitle": "Main Responsibilities", "body": ["Reports and Dashboard Design and Implementation.", "Interact with Specialists, Business Analysts and Business Partners to derive requirements for various report and dashboard requests and to design performance dashboards and reports leveraging Visual Analytics best practices for Dashboard Design Standards.", "Provide development effort estimates.", "Analyze data that are underlying business requirements.", "Work with BI Analysts, Modellers, and Information Architecture to source, profile and model information sources to support dashboards.", "Develop metrics and KPIs to support business requirements.", "Develop reports and dashboards to satisfy customer needs.", "Define test strategies, test plans and execute tests to validate measures and visualizations developed and ensure they comply to defined specifications."]}, {"subtitle": "Reports and Dashboard Support", "body": ["Work with Specialists, Business Analysts and Business Partners to enhance the solutions that have been delivered and optimize them.", "Investigate and fix any issues with reports and dashboards delivered.", "Work with Center of Excellence team to monitor and answer business questions sent on support mailbox."]}, {"subtitle": "Continuous Improvement", "body": ["Stay up to date with technologies used to develop and test visualizations implemented as well as their new features.", "Learn visualizations best practices and performance optimization and apply them in the solutions developed."]}, {"subtitle": "Working Conditions", "body": ["The role has standard working conditions in an office environment with a regular workweek from Monday to Friday.", " Due to the nature of the role, the incumbent must be able to meet tight deadlines, handle pressure and manage stress."]}, {"subtitle": "Experience", "body": ["Reports and Dashboards.", "Minimum 2 years of overall work experience.", "Experience with Visual Analytics concepts and best practices.", "Experience in BI and Analytics*.", "Any experience for these above would be considered as an asset."]}, {"subtitle": "Education/Certification/Designation", "body": ["Bachelor’s Degree in Computer Science, Information Systems, or equivalent."]}, {"subtitle": "Competencies", "body": ["Inspires others with impactful communications and adapts to the audience through speech and writing.", "Applies analytical thinking.", "Innovates through problem solving.", "Knows the business and stays current with industry trends to elevate expertise and work.", "Demonstrates organizational abilities.", "Collaborates with key internal stakeholders to enable higher productivity.", "Works independently with little supervision."]}, {"subtitle": "Technical Skills/Knowledge", "body": ["Knowledge of Tableau, Power BI or any similar tools.", "Data modelling knowledge*.", "Any knowledge for any of the above would be considered as an asset."]}]