[{"title": "Specialist Solution Management"}, {"subtitle": "description", "body": ["The role of Specialist Solution Management will provide technical and/or functional subject matter expertise (SME) to other team members and will coordinate / provide directions to other IT stakeholders involved in maintaining the integrity and evolution of the products he/she is accountable for.", " He/she will ensure those products do perform within the agreed upon SLA, are aligned to IT Standards (Security, Architecture, etc), meet our support excellence standards and are kept current at all time.", " The Specialist acts as first escalation contact during problem resolution and will keep business stakeholders informed on progress.", "On life cycle and product evolution management activities (enhancements), the Specialist evaluates impacts to the products under his/hers responsibilities and will provide direction and coordination’s to teams involved in product.", " On project, this role provides SME knowledge and lead T2C activities to ensure smooth transition to operations of new product just built and ensure our support excellence standards are met."]}, {"subtitle": "Main Responsibilities", "body": ["Operation Excellence.", "Day to day coaching and mentoring of junior members in team.", "Act as first escalation in production problem resolution and lead incident to full recovery and resolution.", "Manage releases; define implementation plan details, including deployment, cutover and fallback.", " Ensure successful deployment of all components to the production environment.", "Lead incident and problem investigation and follow-up resolution, including defect creation.", "Ensure compliance with, all appropriate CN IT standards (e.", "g.", " Security, Architecture, Project Delivery Methodology, SOX, ITIL, etc.", ").", "Automate and optimise support tasks.", "Ensure business stakeholders are informed of recovery activities effectively and timely.", "Interfaces with business colleagues, I&T help Desk, IT Command Center (ITCC), I&T support teams or Vendor.", "Collaborate with other team members to improve overall support activities and product evolution activities.", "Ensure our SAP systems stays up to date with patches as part of our maintenance.", "Delivery (Product Evolution/Project).", "Evaluate impacts of enhancements / projects to the products under his/hers responsibilities.", "Estimate work to complete tasks.", "Provide direction and coordination’s to teams involved in enhancements.", "Define and execute enhancement / project activities around configuration, design specification and testing.", "Provide SME knowledge direction and guidance, Identify key requirements for the operationalization and support of the application and lead T2C activities to ensure smooth transition to operations of new product just being built.", "Participate in the project design phase to establish support structure for solution management.", "Work with project team to deliver the production solution, including automation solutions.", "Collaborate to the transition to core (T2C) to help enforce the support excellence standard.", "Practice Evolution.", "Engage with team to define, design and implement suitable automated processes solutions to optimise the day-to-day support activities.", "Generate automation ideas to help improve support effectiveness.", "Participates in the evaluation and recommendation of new tools and new solution technologies for existing and future business needs."]}, {"subtitle": "Responsibilities:", "body": ["Gather business requirements and convert requirements into User Stories.", "Provide details to the solution architecture for the reporting solutions.", "Provide, or verify, work estimates.", "Lead requirement gathering sessions with team.", "Lead design review session with key stakeholders and ensure compliance to standards and architecture guidelines.", "Produce design specifications, and if required detailed functional design specifications, that meet the business requirements and align with the solution architecture.", "If required collaborate with the SAP ECC application developer, designers and configurators on their configuration and functional designs.", " Address any potential design development issues with them.", "Produce test cases/scenarios and if required help prepare test data to test all functionality identified in the functional design.", " Where required conduct unit, functional and integration testing and log results.", "Diagnose and resolve configuration defects through root-cause analysis and impact analysis.", " Determine whether redesign is required for proper resolution.", " Change the design specifications when applicable.", "Participate in knowledge transfer to the support teams as per the knowledge transfer plan."]}, {"subtitle": "Working Conditions", "body": ["Pressure to meet changing priorities and deadlines.", "Available for first escalation.", "Respond to emergency situations, including some overtime."]}, {"subtitle": "Experience", "body": ["5+ years of knowledge and experience in creating functional design documents and specifications, concepts, techniques and tools used in the implementation, integration, configuration, support and management of production systems.", "5+ years of experience leading projects or initiatives.", "5+ years leading ERP transformation programs.", "Experience in a 24/7 support environment."]}, {"subtitle": "Education", "body": ["Bachelor in Computer science, Information Systems, or equivalent degree or work experience."]}, {"subtitle": "General Skills and Competencies", "body": ["Strong technical aptitude.", "Strong analytical and troubleshooting skills.", "Excellent time management, interpersonal and communication skills (verbal and written), with high proficiency in English.", "Able to communicate with all levels of the company.", "Ability to lead others in results achievement.", "Ability to coach and mentors others.", "Ability to multi-task in a constantly evolving environment.", "Availability outside of working hours for escalation during problem investigation/resolution.", "Excellent knowledge in Service NOW.", "Excellent knowledge of Microsoft SharePoint administration."]}, {"subtitle": "Technical Skills/Knowledge", "body": ["5+ years of experience in ABAP.", "Experience in SAP Basis background.", "Experience in understanding of SAP R/3 processes in (FI,MM,SD,PM,QM,HR).", "Experience in SAP S/4 Hana solutions.", "Experience in SAP Solution Manager Change and Release Management (ChaRM) and CTS+.", "Strong understanding of landscape, transport and release management processes and best practices.", "Strong analytical skills with an innovation or process improvement focused.", "Efficient time management skills and multi-tasking capabilities.", "Effective interpersonal communications."]}, {"subtitle": "Application Development", "body": ["Knowledge of JAVA and ABAP development environments.", "Experience producing configuration/design specifications.", "Experience producing test case scenarios."]}]