[{"title": "Systems Software Specialist"}, {"subtitle": "description", "body": ["Under the authority of the Director of Products & Development, the Systems Software Specialist will be responsible for developing and maintaining our simulation software.", " The software development team provides modeling and simulation application development for virtual and constructive systems integration support and in-service engineering support."]}, {"subtitle": "Responsibilities", "body": ["Develop various land, air and naval vehicle system simulation models.", "Perform unit and integration testing of simulation models.", "Create system testing documents.", "Resolve deficiencies.", "Perform hardware/software integration tasks.", "Install software loads in preparation for hardware/software testing.", "Resolve software issues raised by subject matter experts and customers."]}, {"subtitle": "Qualifications", "body": ["Bachelor's degree in Computer Science or Computer Engineering (or equivalent experience).", "A minimum of 2 years' of experience.", "Experience developing physics based simulation models (e.", "g.", " fluid dynamics, aerodynamics/ flight model, etc.", ") considered an asset.", "Strong computer science fundamentals in 3D, math, object-oriented design, algorithms, and data structures.", "Solid software engineering skills, including the ability to write maintainable and robust code using modern object oriented C++ standards and best practices.", "A thorough understanding of Windows operating systems.", "A thorough understanding of virtual environments.", "Autonomy, creativity and a good sense of initiative.", "Great communication skills and ability to work effectively on shared projects with testers, and other developers.", "Simulation or Game industry experience would be an asset: Knowledge of industry tools such as VBS3, Unity, Unreal, CryEngine or other 3D game engine.", "Knowledge of networks and networking concepts.", "Ability to analyze and troubleshoot distributed simulation problems and provide acceptable solutions or corrections.", "Experience with distributed and integrated simulation (HLA/DIS) would be considered an asset."]}, {"subtitle": "Work With Us", "body": ["Bluedrop Training & Simulation Inc.", " (BTS) operates within the defense and aerospace industry where it designs and develops highly specialized, high performance, tactical training for front line operators of equipment working in complex environments and high-risk situations.", " This includes, training systems needs analysis, custom courseware development, virtual simulation training devices, and ongoing training support for in service support.", " Typical customers include Tier one OEMs such as Boeing, Lockheed Martin and Sikorsky.", "This is an excellent opportunity for ambitious, career-oriented individuals who wish to be part of a large, dynamic and highly successful organization.", " We offer competitive compensation, bonus opportunities and benefits, as well as exceptional career growth potential.", " While we thank all candidates for their interest, only those candidates to be interviewed will be contacted."]}]