[{"title": "Systems/Applications Analyst"}, {"subtitle": "description", "body": ["Marwood Ltd.", " is a dynamic producer of value added forest products for residential, commercial and industrial construction industries.", " With operations in Fredericton, Halifax, Boston and more, we serve markets throughout North America and Europe.", " With each operation having unique characteristics, it makes for an interesting and diverse work experience.", "Marwood Ltd is currently looking to fill a Systems / Applications Analyst position.", " This position will be based out of our head office, located just outside of Fredericton, in Tracyville, NB.", "In this role you will get to work within each division of Marwood Ltd supporting and developing its continued growth.", " You will get to work on diverse and challenging projects that span the breadth of Marwood’s operations as well as develop and implement creative solutions that enables Marwood to perform at an optimal level.", " You will also be responsible for helping maintain the current technological solutions deployed across Marwood and working with various departments to ensure success."]}, {"subtitle": "Key Responsibilities:", "body": ["Developing new custom tailored solutions to support our continued growth as well as support all existing technological applications and solutions.", "Design, write, test, debug, and maintain software applications to meet technical and functional requirements.", "Support ERP system (SYSPRO).", "Help Desk support.", "Ability to provide step-by-step technical help, both written and verbal.", "Provide training and assistance for users, programmers and other staff.", "Prepare and maintain reports using application reporting tools.", "Perform other duties as required."]}, {"subtitle": "Requirements:", "body": ["Bachelor of Computer Science OR a Diploma of Information Technology (Programming) and relevant work experience OR an equivalent combination of education, training and experience may be considered.", "Experience in writing MS Access VBA code, developing and troubleshooting.", "Experience with Microsoft SQL Server.", "Report writing experience (Access, SSRS, Crystal or other).", "Ability to work independently and as a team player in fast paced dynamic software development/support environments.", "Strong analytical skills for problem solving.", "Experience working in a team environment."]}, {"subtitle": "The following training and experience would be considered an asset:", "body": ["Microsoft Certified Applications Developer or Microsoft Certified Database Administrator.", "Working knowledge of accounting/financial applications, preferably in an ERP environment."]}]