[{"title": "Tech Support Associate - Burlington"}, {"subtitle": "Urgently hiring", "body": ["Join the team at StorageVault Canada.", " We are driven to succeed!.", "As the largest and fastest-growing storage provider in Canada, our team is expanding and we are looking for an Information Technology Help desk Associate to be part of our team of professionals to design and execute the team’s feature road map while fostering a positive, goal-oriented culture.", "As an integral member of the Information Technology unit, this key individual will work closely with internal clients and colleagues to define, develop and deliver day-to-day IT Services focused on exceptional customer service along with contributing to standards development and implementation.", "Successful candidates will have an established track record of help desk service delivery, a solid knowledge of industry best-practices, admirable communication skills, and be driven to achieve results in a collaborative environment with all business units and levels in a fast-paced environment."]}, {"subtitle": "What you will do", "body": ["Be part of the solution.", "Provide a professional service to internal customers ensuring both delivery and quality objectives are met with a focus on service.", "Escalate service desk issues as required.", "Troubleshoot system, software, and networking problems, providing feedback on technical expertise and improvements, advice to clients.", "Implement emerging network technology best practices.", "Take ownership and accountability for assigned tasks.", "Foster a positive work environment.", "Ad hoc tasks."]}, {"subtitle": "Who you are:", "body": ["Self-driven and motivated with the ability to use own initiative.", "Excellent organisation, prioritization and administration skills with a focus on attention to detail.", "Working with desktop/server applications & operating systems are second nature.", "Customer experience is your primary point-of-view.", "Ability to explain technical subjects in a manner suitable to the audience involved.", "Flexible to work in a shift environment.", "Contact center experience an asset.", "Education in a field of computer science or information systems or equivalent experience.", "IT professional qualifications desirable (ITIL)."]}]