[{"title": "PV System Analyst"}, {"subtitle": "Role Summary:", "body": ["The PV System Analyst will support the Pharmacovigilance (PV) Systems Team in optimizing case processing and global adverse event database (GAED) functionality.", " The individual will support the Argus Safety system, work with the hosting vendor and ensure that requests for system issues, enhancements and other system changes are resolved in a timely manner."]}, {"subtitle": "Essential Responsibilities:", "body": ["Together with PV Systems team, responsible for the day-to-day oversight of the hosting vendor and managing SLAs to ensure that outstanding tickets are resolved in a timely manner.", "Manage and track the status of system change requests, enhancements and/or support efforts and assess their criticality, feasibility, and global and Japan impact on regulations and processes.", "Help in triaging and debugging the System issues by working collaboratively with Global/Japan Operations and Compliance teams.", "Contribute to testing of new system configurations.", "Support planning and implementation of safety system enhancements and upgrades.", "Gather and document user requirements for adhoc and custom reports.", "Perform adhoc queries of the database and work with vendor as needed to develop validated queries/reports.", "Maintain database user manual and safety system training materials.", "Respond to PV staff on Safety System functionality.", "Serve as resource person for inspections and audits."]}, {"subtitle": "Qualifications/Requirements:", "body": ["Minimum: BS degree, Life Sciences, Computer Science, Applied Informatics.", "Minimum of 3 years’ experience working within the Drug Safety/ Pharmacovigilance domain.", "At least 1 year of technical experience with Argus Safety database including Argus Japan (critical)."]}, {"subtitle": "Desired Characteristics:", "body": ["Experience with managing vendors desired.", "Knowledge of rules and regulations applicable to the Global Safety industry.", "Attention to detail, results-oriented and persistent with excellent organizational skills.", "Self-motivated and ability to work independently in a fast-paced environment, prioritize multiple tasks and ability to recognize time sensitivity.", "Ability to work independently in fast-paced environment with little supervision.", "Ability to adapt to constant change and influence positive change effectively.", "Team-oriented and responsive to customer needs.", "Ability to understand technical documentation and execute associated procedures.", "Any offer of employment is conditioned upon the successful completion of a background investigation ."]}]