[{"title": "Information Technology Apprenticeship Program (ITAP)"}, {"subtitle": "About the job", "body": ["The Canada Revenue Agency (CRA), is one of the Top 100 Employers in Canada!.", "When you join the CRA, you can expect:.", "career growth.", "flexible work arrangements.", "competitive salaries.", "balance between work and personal life.", "an attractive pension plan.", "dental and medical coverage.", "paid vacation leave and sick leave.", "The Information Technology Branch (ITB) within the CRA, needs to recruit an agile, tech-savvy and dedicated workforce and offers effective and meaningful training and career development opportunities to eligible apprentices, in order to successfully deliver on our business priorities.", "To do this, we use the ITAP - a structured program designed to facilitate the development and promotion of employees from the CS-01 to the CS02 level.", "The IT environment within the CRA is growing at a rapid rate and offers numerous opportunities for IT professionals to be part of very exciting enhancements in IT activities.", "We are looking for enthusiastic individuals who are up for a new challenge.", " Come join our team!.", "You are encouraged to submit your application as soon as possible as appointments made from this staffing process may take place during the posting period and while assessments are still ongoing.", " The closing date and time on this notice may change.", "To obtain a copy of the work description, please contact the person/email listed at the bottom of the notice."]}, {"subtitle": "Who can apply", "body": ["Persons living in Canada and Canadian citizens living abroad and eligible veterans and Canadian Forces members.", "Note: This process will be used to staff positions in various Canadian locations.", " As a result, if you are appointed from this process you may be expected to relocate to the location where the position is being staffed.", " If you are a candidate from the general public, you will have to pay for any expenses related to your participation in this staffing process, as well as any relocation costs if you are appointed.", "Qualified members and former members of the Canadian Forces who receive an offer of employment are not entitled to relocation costs from the CRA.", " They may, however, be entitled to a final relocation from the Department of National Defence.", "Virtual reporting may be possible, if operational requirements permit."]}, {"subtitle": "Essential staffing requirements:", "body": ["To be eligible, you must meet one of the following requirements.", "Stream 1 – A student enrolled in a degree or diploma program from a recognized postsecondary institution, in computer science, Information Technology (IT),or Information Management, who will have graduated by June 30, 2021.", "Note: You must attach proof of enrollment or unofficial transcript to your Application.", " Failure to do so will result in your application not being considered further.", "OR.", "Stream 2 – Meet CRA’s CS Education Standard (alternatives will not be accepted).", "Note: You must attach proof of education to your Application.", " Failure to do so will result in your application not being considered further.", "Any of the following documents may be used as proof of education:.", "Diploma or degree;.", "Official transcript indicating graduation status with a signature and/or school seal; or.", "Letter of attestation that includes:.", "Clear mention that the student will graduate with no conditions;.", "The graduation date; and.", "Signature of the Registrar (or an official member of the institution, for example, the Academic Chair).", "Canadian equivalency for foreign degrees."]}, {"subtitle": "Essential", "body": ["The essential staffing requirements indicated below will be assessed during the process and may be used to identify candidates for positions.", " Additional asset staffing requirements may also be assessed during the staffing process and may be used to identify candidates for positions.", " You will be notified in advance of any asset requirements to be evaluated.", "Cognitive Abilities and Behavioural Competencies.", "Ability to communicate effectively orally.", "Dependability.", "Performance validation.", "Second Language Evaluation (for bilingual positions)."]}, {"subtitle": "Conditions of Employment", "body": ["Security: Reliability Status (Some positions could require Secret level).", "Willingness to work overtime.", "Willingness to travel.", "Willingness to relocate."]}, {"subtitle": "Want to know more?", "body": ["We encourage you to read Important information on staffing at the CRA to find out more about staffing processes and how to apply.", "The CRA is committed to building a skilled, diverse workforce reflective of Canadian society.", " To find out more, consult Employment equity, diversity and inclusion at the CRA.", " We encourage you to complete the Employment Equity (EE) Staffing questionnaire as part of your application if you wish to be considered for staffing actions using the EE staffing requirement in this process.", " Your questionnaire response will be retained on file for the duration of the staffing process.", " If you do not complete the questionnaire, you will not be considered for any staffing actions using the EE staffing requirement in this process.", " If you decide to modify your response or fill out this questionnaire at a later date, please notify the contact listed at the bottom of this notice of job opportunity.", "CRA employees support the economic and social well-being of Canadians, and build public trust.", " We have high expectations, and our employees are held to the standards of conduct outlined in our Code of integrity and professional conduct and Directive on conflict of interest, gifts and hospitality, and post-employment.", "Information regarding the status of your application will be communicated via the candidate profile on the CRA Careers site.", " We strongly encourage you to verify the email address attached to your profile and to check your messages regularly for any updates.", "This staffing process may be used to staff positions within various federal public service organizations."]}]