[{"title": "ISL 24R - Technical Analyst"}, {"subtitle": "description", "body": ["An excellent opportunity to join this dynamic team and apply your skills.", "As a member of the Technology and Business Transformation Branch in the Ministry of Advanced Education, Skills & Training this position supports the operations of the ministry’s web and application properties.", " This features software management and operational infrastructure maintenance of internal and external facing online solutions.", " This position will analyze, design, develop, and implement online applications consistent with the technical directions and business strategies of the ministry and government.", " We are looking for a candidate with some server administration experience and good communication skills who is keen to learn.", " Is that you? We’d love to have you on the team.", " The Ministry of Advanced Education and Skills Training is a flexible place to work and we are taking staff safety during the COVID-19 pandemic very seriously.", " The majority of staff on this team are working remotely with full support.", "The capital of British Columbia, Victoria is a beautiful city, with beautiful beaches and harbours, and a variety of provincial parks to explore.", " Located on Vancouver Island, Victoria offers a bustling downtown scene and has a wide range of restaurants and entertainment venues to choose from.", "The BC Public Service is an award winning employer and offers employees competitive benefits, amazing learning opportunities and a chance to engage in rewarding work with exciting career development opportunities.", " For more information, please see What We Offer.", "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens.", " Consider joining our team and being part of an innovative, inclusive and rewarding workplace.", "For complete details about this opportunity, including accountabilities, please refer to the attached job profile.", " For specific position related enquiries, please contact Cheryl.", "Weiss@gov.", "bc.", "ca.", " DO NOT SEND YOUR APPLICATION TO THIS EMAIL ADDRESS.", " For more information about how to complete your job application, add/edit your resume and for more useful tips when applying for jobs, please refer to the Your Job Application page on the MyHR website.", " If you are still experiencing technical difficulty applying for a competition, please send an e-mail to BCPSA.", "Hiring.", "Centre@gov.", "bc.", "ca, before the stated closing time, and we will respond as soon as possible to assist you."]}, {"subtitle": "Job Requirements", "body": ["In order to be considered for this position, your application must clearly demonstrate how you meet the education and experience as outlined below:.", "Degree, diploma, certification or equivalent in the computer science field.", "Experience leading design and implementation of dynamic websites or custom applications.", "Demonstrated experience in investigating and implementing complex IT integration challenges.", "Demonstrated experience troubleshooting, testing, implementing software and hardware solutions.", "Demonstrated experience with a variety of web or application development methodologies and emerging technologies.", "Applicants selected to move forward in the hiring process may be assessed on the Knowledge, Skills, Abilities and Competencies as outlined in the attached Job Profile located in the Additional Information section at the bottom of the posting."]}]