[{"title": "IT Support Associate - Midnights"}, {"subtitle": "description", "body": ["Speedy Transport is an LTL carrier specializing in Canada to USA transportation and logistics for Canada, USA, Ontario, Quebec and North America.", " Founded in 1941 as a local, same-day parcel pick-up and delivery service, Speedy Transport has grown to be one of central Canada’s premier carriers.", "We are seeking an energetic and outgoing individual for the position of IT Support Associate out of our Windsor Terminal.", " This individual will be responsible to provide IT Support for our customs team during the midnight hours."]}, {"subtitle": "Responsibilities", "body": ["Resolve technical issues related to network interruptions and software failures.", "Actively update, maintain and monitor all aspects of computer networks.", "Act as the initial point of contact for all computer and system related concerns from partners or other employees.", "Assist management in creating training materials pertaining to computer troubleshooting and usage.", "Attend meetings with stakeholders to analyze, troubleshoot and diagnose hardware and software problems."]}, {"subtitle": "Qualifications for Technical Support", "body": ["A bachelor's degree in computer science or related technology field is preferred, but not required.", "Industry-specific certification in relevant computer languages or software may be required.", "1-3 years of relevant experience in a customer focused position involving technical knowledge of a company' s products and services.", "Professional written and interpersonal skills are essential when communicating with customers and clients.", "Ability to prioritize and manage several milestones and projects efficiently.", "Extensive experience working with different operating systems including Windows and Linux.", "Comfortable working in and assisting others through company help desk software, such as Zendesk in addition to other remote access desktop programs.", "Time-management skills and the ability to establish reasonable and attainable deadlines for resolution."]}]