[{"title": "IT Support Engineer I"}, {"subtitle": "Basic qualifications", "body": ["High School or equivalent diploma.", "2+ years hands-on IT Support experience.", "2+ years of experience supporting in one or more of the following operating; Microsoft Windows 10 or later, Macintosh OS 10.", "7 or later, Linux, Unix.", "2+ years or experience with networking concepts such as DNS, DHCP, SSL, OSI Model, and TCP/IP.", "2+ years of experience in PC repair, troubleshooting, deployment, and asset lifecycle.", "Are you passionate about helping people solve IT problems? Love being a part of an exciting and innovative environment? Join Amazon Global IT Support! We’re looking for people who strive to “Work Hard.", " Have Fun.", " Make History.", "”.", "Amazon, is seeking bright, adaptable, and productive candidates to work at our corporate location in Winnipeg, MB.", " IT Support Engineers work with Amazon teams to provide and support the IT equipment and services they need.", " We treat Amazon employees as our customers and provide timely, accurate, and professional support.", " A successful IT Support Engineer excels in a fast-paced, team environment and possesses excellent communication skills.", " They have a high degree of technical aptitude over a large scope of IT software, hardware, and networking disciplines."]}, {"subtitle": "Key Responsibilities:", "body": ["Provide Windows/Mac/Linux OS deployment and support.", "Provide user hardware/software/peripheral support.", "Support remote chat.", "Troubleshoot and support LAN.", "Conduct systems administration.", "Perform hardware procurement and asset management.", "Create and maintain documentation.", "Mentor and handle escalations from junior technicians.", "Perform on call responsibilities as required for high severity local issues.", "Lift or carry equipment top computers up to 25 lbs, as needed.", "Conduct on call rotation responsibilities as required for high severity local issues."]}, {"subtitle": "Preferred qualifications", "body": ["Bachelor's degree in Computer science or IT related field.", "Industry training such as Microsoft MCSE, MCITP.", "Experience with Cisco IOS (CLI) or Cisco certification.", "Experience with scripting, programming, or SQL.", "Experience with project management.", "Experience with Data Cabling / Computer Facilities maintenance.", "Experience with Network Infrastructure, including Switches, Routers, Firewalls and Backup facilities.", "Experience with Support facilities including Power distribution, UPS, HVAC specific to Network and server room set up.", "Experience with server administration (Windows or Linux).", "Proven ability to work successfully with limited supervision.", "Experience in JIT Inventory management & logistics.", "Vendor Management / Relations."]}]