[{"title": "Cybersecurity Architect"}, {"subtitle": "Who are we?", "body": ["Founded in 1924, Irving Oil is a family-owned company with operations throughout Eastern Canada, New England and Ireland with a focus on providing exceptional service and high-quality products to our customers.", " Every day, we strive to put our good energy in action to bring families together, support the environment and local wildlife, and to create learning opportunities that empower the next generation."]}, {"subtitle": "Here's what you can expect from us:", "body": ["When you're a part of our team, you'll see how we bring good energy to our business and our employees.", " Together, we will support our corporate strategy, high standards and the communities where we live and work.", " Our collaborative approach, commitment to diversity and inclusion along with our safety-first culture helps reinforce our internal brand position where People Matter.", " That's why we're dedicated to the development of our employees, so that they can reach their career goals."]}, {"subtitle": "What you can expect in a typical day:", "body": ["As the Cybersecurity Architect, you will use your extensive technical knowledge to play an integral role in cybersecurity risk management, cybersecurity strategy and architecture, and leverage your expertise, business acumen, and relationship skills to improve and evolve our cybersecurity risk program.", " You will build relationships with people at various levels to communicate technical language to non-technical stakeholders.", " As the SME for cybersecurity risk management, your experience in developing strategic cybersecurity systems plans and standards at an enterprise level will mitigate cybersecurity risks, particularly for mission critical systems."]}, {"subtitle": "What you’ll need to succeed:", "body": ["Experience in delivering value by reducing cybersecurity risk across an enterprise in IT and OT systems.", "Experience in demonstrating strong technical cybersecurity expertise and risk assessment proficiency.", "Extensive experience in performing cybersecurity risk assessments to ensure our adoption, use, and disposal of digital technology meets our required risk posture and compliance obligations in IT and OT environments.", "Experience in identifying cybersecurity architecture and design gaps in the adoption, use, and disposal of digital technology, recommending changes or enhancements.", "Experience in the development and the promotion of enterprise cybersecurity architecture practices, policies and standards.", "Experience in ensuring compliant architectures and designs are in alignment with regulatory and internal requirements.", "Strong oral and written communication skills.", "Ability to set realistic deadlines that are always met."]}, {"subtitle": "Professional skills:", "body": ["Ability to build relationships and be a trusted advisor.", "Ability to align and articulate the business value of the security controls embedded in business solutions, enterprise systems, and security solutions.", "Experience in performing security risk assessments involving cross functional teams in complex IT and OT environments.", "Proven experience building credibility and collaborating with senior business leaders to assess organizational cybersecurity challenges, institute prioritization and deliver results.", "Technically strong in core cyber security and risk management functions such as: governance, compliance, threat intelligence, data protection, encryption, vulnerability management.", "Very strong leadership and communication skills are imperative.", "Ability to communicate technical information to non-technical people in an easily understandable way.", "Able to collaborate effectively with cross-functional teams and get buy-in from key stakeholders.", "Knowledgeable about applicable cybersecurity data privacy practices, laws and regulatory requirements across all of Irving Oil’s areas of operations.", "Proficient in building and maintaining documented cybersecurity standards, architectures, roadmaps, blueprints and patterns.", "An analytical and proactive mindset.", "Enjoy thriving in high pressure environments."]}, {"subtitle": "Education and experience:", "body": ["Minimum 10 years of experience in cyber security risk assessment and management.", "Post-secondary education in Computer Science, Information Technology, Information Systems, , Cybersecurity Risk management, Networking, related fields, or equivalent experience.", "Experience with SIEM, Network Security, Remote Access, , and other similar areas: military or global enterprise cybersecurity risk assessment experience an asset.", "Preferred Information Security professional designations such as CRISC, ISSAP, CISSP and SABSA.", "Certifications in ITIL (Information Technology Infrastructure Library).", "Experience with Project Management methodologies, concepts, and tools; PMP (Project Management Professional) designation an asset."]}]