[{"title": "IT User Support Specialist"}, {"subtitle": "The role:", "body": ["Act as a first responder – by phone or electronically – with brokers with regard to all problems and questions related to the computer systems that we host.", "Track tickets in the call centre management tool with the different support teams and external vendors.", "Keep the documentation related to the supported software up to date.", "Configure the main agency software applications (BMS).", "Have basic knowledge of accounting to support agency software that include a financial module (an asset)."]}, {"subtitle": "What you have:", "body": ["Diploma of collegial studies (DCS) or ACS in computer science.", "2 to 3 years of experience working in a call centre.", "Excellent customer service and communication skills with an ability to adapt your style to different situations or contexts.", "Excellent diagnostic and resolution skills allowing you to effectively identify defects and apply appropriate solutions.", "Ability to efficiently compile and analyze data to make sound recommendations.", "Customer oriented and at least one year of experience working with customers, preferably in a general technical support position.", "Ability to work independently and with minimal supervision.", "Must be fluent in French and English, both orally and in writing.", "Knowledge of accounting (an asset).", "Knowledge of Office365 (an asset).", "Basic ITIL training (an asset).", "Sense of urgency and resourcefulness."]}, {"subtitle": "Here are a few reasons why others have joined our team:", "body": ["An award-winning, inspiring workplace that supports its people and recognizes great work.", "Stimulating, challenging projects and development opportunities to help you grow your skills and career.", "Flexibility in how and where you work.", "A comprehensive financial rewards program that recognizes your success.", "An extensive, flexible benefits package.", "An industry leading Employee Share Purchase Plan where we match 50% of net shares purchased.", "A casual ‘dress for your day’ culture that encourages you to be yourself.", "A $350 annual wellness account that promotes an active lifestyle."]}, {"subtitle": "We are an Equal Opportunity Employer", "body": ["At Intact, our value of Respect is founded on seeing diversity as a strength, being inclusive and fostering collaboration.", " We value diversity and strive to create an inclusive, accessible workplace where all individuals feel valued, respected and heard.", "If we can provide a specific adjustment to make the recruitment process more accessible for you, please advise the Talent Acquisition partner who reaches out about the job opportunity and they will work with you to meet your needs."]}, {"subtitle": "Background Checks", "body": ["As an employer and publicly traded financial services company, the best interests of our customers, employees and shareholders are important to us.", " We want Intact to be a great place to work! This means that internal and external candidates will be asked to consent to background checks so we can learn more about you.", " Please note that for positions with access to financial data or funds, your credit must be in good standing."]}, {"subtitle": "Internal Candidates", "body": ["For internal candidates, you can apply for a posted position if you have been in your current position for at least 12 months and are performing at a satisfactory level.", " Please note we may have identified other internal candidates through our Employee Development Program, and that the selection process may also be opened to external applicants."]}, {"subtitle": "Eligibility to Work in Canada", "body": ["It’s important that you are legally eligible to work in Canada at the time an offer of employment is made.", " You may be requested to provide proof of eligibility at that time."]}]