[{"title": "Cyber Security Analyst - Remote"}, {"subtitle": "Job Description", "body": ["Responsible for administering anti-virus client/server reports and ensuing latest levels are applied.", "Ensuring 2FA/MFA (2 factor or multifactor authentication ) policies are enforced and current.", "SSL and Digital Certificate Management (LDAP for cisco phones, public-facing web servers, RDP servers ).", "Auditing and reporting on all external and internal web services that they are secure with SSL and scanning tools (ensuring ongoing ciphers & TLS recommended standards followed).", "Monitor all operations and infrastructure through establishing and monitoring alerts and logs to keep an eye on our company's digital security footprint (reporting of activity done under non-personally, generic admin accounts, etc.", ").", "Reviewing ADAudit logs outlining and acting upon unusual admin activity.", "Work with 3rd party to provide year external/internal threat assessment and recommendations.", "Work with the development group to ensure best practices are in place for web applications (cors, reverse proxy, SQL injection, etc.", "), and sensitive data (credit card, health care data, personally identifiable information).", "Communicate the benefits of Cyber diligence to ensure cybersecurity stays on the organization radar and champion all related efforts going forward.", "Ensure our company has a well-defined and documented plan of action to put into place in the event of a security incident update in the company’s ORMS (Organizational Resilience Management System)."]}, {"subtitle": "Qualifications", "body": ["Post Secondary Education preferably in Computer Science or Information Security.", "3 years’ experience with Cyber Security Management tools and projects supporting Infrastructure, Cloud Applications, on-premise applications, ( BCP and DR plans.", "3 years’ experience documenting procedures and creating technical Specs for internal technology team and staff.", "CISSP (Certified Information Systems Security Professional), CISM (Certified Information Security Manager), GSEC (GIAC Security Essentials) and other security certifications.", "Vital regulatory and compliance knowledge (CCPA, GDPR).", "Experience in a variety of security technology and architecture, such as MFA/2FA, VPN, DLP, privileged access management, network security, data security, cryptography and software-defined networks.", "Advanced Microsoft Excel, Microsoft Word, Microsoft Project and Visio required.", "Excellent communication skills, both oral and written.", "Acute attention to detail with excellent documentation skills."]}, {"subtitle": "Additional Information", "body": ["Competitive wages.", "Benefits – including short term and long term disability.", "Profit sharing.", "Scholarship program."]}]