[{"title": "Security Analyst"}, {"subtitle": "Security Analyst", "body": ["Are you passionate about learning and intellectually curious? Do you thrive in a fast paced, innovative work environment where team members hold themselves and others accountable? Are you energized by trying new things, have an agile mindset and enjoy making an impact? Is working for a purpose driven organization important to you? If the answers to these questions are a resounding YES , then read on!.", "Skillsoft is the global leader in corporate learning.", " We help businesses solve their biggest challenge - attracting, motivating and retaining world class talent.", " Our team is recognized for cutting edge digital learning and human capital management solutions.", " Trusted by the world's leading organizations, including 65% of the Fortune 500, we train more professionals than any other company in the world.", " Our 100,000+ courses, videos and books are accessed over 130 million times every month, in 160 countries and 29 languages.", " At Skillsoft, we believe that knowledge is the fuel for innovation and innovation is the fuel for business growth.", "We are all about \"Making Work Matter.", "\" With over 2000 employees around the world, we are always looking for amazing talent!."]}, {"subtitle": "Overview:", "body": ["Skillsoft is currently seeking an experienced and motivated Security Analyst to assist with ensuring a comprehensive, proactive and complete security positioning for customized eLearning solutions in a SaaS cloud environment."]}, {"subtitle": "Highlights:", "body": ["Ensure security for complex software solutions for Fortune 1000 customers.", "Review and coordinate changes to security policies, standards, and processes in a continuous improvement model.", "Enforce system and environment security standards.", "Effect mitigation responses to elevated threat-level conditions.", "Manage resolution of security events in collaboration with a cross-functional, cross-departmental response team.", "Create and maintain security documentation for Skillsoft operating environments.", "Facilitate third-party and customer penetration tests and/or security assessments.", "Remain abreast of security developments and trends.", "Respond to security incidents.", "Maintain security related tools."]}, {"subtitle": "Skills & Qualifications:", "body": ["At least 1-2 years of experience in a related discipline.", "Post-secondary education in computer science or a related field or an equivalent combination of training and experience.", "Experience administering/operating network and host-based intrusion detection systems, and vulnerability assessment tools.", "Understanding of web application security issues.", "Expert-level proficiency with Windows operating systems.", "Experience administering Linux systems.", "Experience in the support of enterprise hosted systems is strongly desired.", "Experience working with an enterprise SIEM system is desirable.", "CISSP certification considered an asset."]}, {"subtitle": "Success Qualities:", "body": ["Adaptable and Agile.", " Responds quickly to the changing needs of the business and is resilient in the face of setbacks or adversity.", "Confident & Audacious Achiever.", " Champions breakthrough initiatives and holds him/herself and others accountable for delivering.", " Enjoys working hard; is action-oriented and full of energy for the things he/she sees as challenging; not fearful of acting without over-analysis.", "Entrepreneurial Spirit with Learner's Mindset.", " Is uncomfortable with simply maintaining \"status quo\" and is intellectually curious and demanding of excellence and continuous improvement.", "Committed to our Collective Purpose.", " Leverages cross functional collaboration to solve complex business issues and drive greater results.", "Authentic & Customer Centric.", " Never compromises integrity to achieve results while constantly being mindful of creating a positive customer experience both internally and externally.", " Adheres to an uncompromising set of core values and beliefs during both good and bad times; practices what he/she preaches.", " Acts with the highest standards of conduct and is seen as a direct, truthful individual."]}]