[{"title": "Manager, End User Service Desk (EUSD)"}, {"subtitle": "As our Manager, EUSD you will be repsonsible for:", "body": ["Building and managing a highly productive, motivated, and engaged technical support team primarily focused on delivering services associated with our Service Desk and Microsoft O365 offerings.", "Participating in the Sale and Delivery of new Service Desk clients by ensuring a seamless on-boarding process and transition into operation fully aligned to our Service Desk offering.", "Performing regular analysis and reporting on tickets and Service Requests and team performance; tracking SLA’s and ticket progress/aging and taking action as required.", "Tracking and overseeing completion and delivery of client MAC and reporting deliverables on a monthly basis.", "Owning root cause analysis activities associated with service failures and major incidents.", "Providing leadership around the hiring, training & day to day management of the team.", "Providing hands-on coaching to team members focused on continuous improvement and delivering a great client service experience.", "Guiding and supporting the personal and professional development of each team member through ‘in-the-moment’ mentoring and regular 1:1 meetings.", "Building and developing the behaviors supporting our core values, mission and vision.", "Ensuring department policies as well as work processes and procedures are adhered to by team members.", "Collaborating with other KTSC Managers to coordinate and schedule daily activities of staff as well as review key performance metrics and action plans.", "Acting as a point of escalation, including after hours when assigned, for customer support issues ensuring action plans are in place and senior management informed.", "Assisting in preparing the team for delivery of new service offerings.", "Building and executing technical training plans aligned with overall services strategy.", "Providing a broad range of analytical and/or process support, research, and execution on projects and special initiatives.", "Reviewing and providing reporting and operational analytics as input for senior team members and leadership.", "Contributing to overall deliverables and strategies of the team on a variety of metrics.", " May also work directly or indirectly with clients."]}, {"subtitle": "As our ideal candidate, you’ll have:", "body": ["Post-Secondary Degree/Diploma with focus in Computer Science or IT Management.", "Up to 7 years of experience in IT service management.", "ITIL Foundations Certification or higher is an asset but not required.", "Experience presenting to senior level executives.", "Understanding of managed services business and delivery models.", "Excellent written and verbal communication, interpersonal, and presentation skills.", "Proven client service skills and demonstrated passion for delivering superior client experience.", "Demonstrated ability to motivate, coach, and lead others.", "High attention to detail.", "Possess sense of urgency, adaptability, flexibility, and drive to achieve.", "Strong time management and organization skills.", "Conflict management and negotiation skills experience.", "Service Desk and Microsoft O365 skills are a definite asset.", "Project management skills and experience are an asset."]}, {"subtitle": "How Do We Hire Great People?", "body": ["We believe in matching the right people for the right role.", " Once you’ve applied for a position, our team of Talent Advisors will review your resume and application against all open roles at Softchoice.", " We also keep in mind any future or upcoming roles you may be a fit for.", " As part of our selection, onboarding and development process, we utilize tools to help us better match candidates with our roles.", "Applying for a role at Softchoice is not complete until you have completed both the formal online application and the Predictive Index tool (PI).", " Completing the PI tool will take no more than 10 minutes of your time.", "If we see a match with your skills and our open roles, we will reach out to you to schedule time to talk so that we can learn more about you and you can learn about us.", " Only those candidates selected for further consideration will be contacted directly.", " However, we will retain your application on file and would be pleased to contact you if further opportunities arise."]}, {"subtitle": "Need more convincing this is the right next step in your career? Here are the reasons why folks love working here!", "body": ["Softchoice has been recognized as a Best Workplace in Canada by the Great Place to Work Institute for 15 consecutive years.", "Certified as a Great Place to Work in the United States.", "Meaningful work that drives professional development.", "Ability to enter and grow within the technology industry.", "Being part of a winning, high performance team.", "Every employee gets two paid volunteer days per year.", "We serve large and mid-sized clients from a variety of industries.", "We’ve raised over $2 Million through our staff-run charity Softchoice Cares.", "1 in 5 employees have invested in an ownership position in Softchoice."]}, {"subtitle": "About Softchoice:", "body": ["Softchoice is one of the largest IT solutions and Managed Services providers in North America! We are an influential, growth-oriented organization determined to enable our people, our clients, our partners and the communities we serve to realize their potential.", " Our unique culture fosters a friendly, open-minded workplace where employees are encouraged to bring their whole selves to work.", " As a member of a dynamic, high-performing team, each Softchoice employee is hungry to learn, valued for their contribution, and approaches each day excited to make an impact.", "We would like to thank you personally for applying to Softchoice.", "Please note that we will review your application and only those candidates selected for further consideration will be contacted directly.", " However, we will retain your application on file and would be pleased to contact you if further opportunities arise.", " Again, thank you for your interest in a career at Softchoice!.", "Note: Completion of a satisfactory criminal record check, education verification and reference checks are required prior to employment."]}, {"subtitle": "Accommodation", "body": ["Softchoice is proud to provide employment accommodation during the recruitment process.", " Should you require any accommodations, please let us know in your application or reach out to asktalentacquisition@softchoice.", "com and we will work with you to meet your accessibility needs."]}]