[{"title": "Support Systems Specialist 25213"}, {"subtitle": "POSITION PURPOSE", "body": ["Reporting to the Program Manager, Technology Support Services, is responsible for implementation, maintaining and overall day-to-day performance of various water/wastewater, waste management and forestry related systems and technologies; assessing technology capabilities of systems, business needs, system design, development and implementation; working in consultation with internal stakeholders relative to data integrity, security and integration ensuring the goals, objectives and business and regulatory compliance needs of the Branch and Region are met; assisting in development and implementation activities to support the existing Branch support systems and implementing new projects and processes in co-ordination with Branch staff."]}, {"subtitle": "MAJOR RESPONSIBILITIES", "body": ["• Monitors system performance of Water/Wastewater software Systems, Waste Management and Forestry software Systems including data management systems, data integrity, cybersecurity, and systems integration in compliance with the Sustainable Water and Sewage Systems Act, in accordance with assigned program work.", "• Mobile data collection, data integrity, cybersecurity, and systems integration in compliance with government regulations, in accordance with the Department’s assigned program work.", "• Addresses issues and concerns related to the Water/Wastewater software systems by providing operational technical support on a day-to-day basis, including problem identification, investigation, and resolution for end users; consults and escalates issues to ITS, as required.", "• Researches market and business trends, new and emerging technologies, software, and hardware components related to water and wastewater, waste management and forestry systems; makes recommendations on alternatives to ITS and management.", "• Gathers data relative to design and application workflow; recommends system prototypes for user consultation, and contributes to the design, development, testing, modification, documentation, and implementation of systems.", "• Develops training material and facilitates training sessions with end users and other stakeholders.", "• Liaises with internal staff, providing software systems expertise and support to ensure consistent and effective systems performance; shares information regarding initiatives and other best practices with Branch and Departmental staff.", "• Liaises with external contractors, vendors, and suppliers on general troubleshooting, updates, maintenance and support contracts, as appropriate and in consultation with ITS.", "• Maintains current expertise by reviewing technical literature, attending seminars, conferences and training, as required.", "• Assists management in the preparation of reports and input to business planning activities as required."]}, {"subtitle": "QUALIFICATIONS", "body": ["• Successful completion of a College Diploma in Information Technology, Computer Sciences or approved equivalent combination of education and experience.", "• Minimum five (5) years demonstrated experience providing project implementation analysis and support in data management systems, data integrity and security as it relates to water/wastewater, waste management and forestry systems.", "• Experience and demonstrated ability on functional and technical levels of Real Time Data Acquisition Systems and other technology systems and in the use of relational databases.", "• Knowledge and demonstrated ability in corporate core competencies including customer focus, communication, collaboration and personal ownership."]}]