[{"title": "Computer Systems Technology Instructor"}, {"subtitle": "Posting Status", "body": ["Open.", "A degree in Computer Science or a closely related degree with four years’ recent, relevant experience in two or more of the following areas: programming, database management, project management, system administration or N-tier website development.", "OR.", "A diploma in Computer Science and at least five years’ recent, relevant experience in at two or more of the following areas: programming, database management, project management, system administration or N-tier website development.", "2.", " Effective communications skills.", "3.", " Effective interpersonal skills.", "4.", " Effective instructional ability.", "5.", " Demonstrates valuing diversity."]}, {"subtitle": "Job Duties", "body": ["1.", " Select, design, update and construct training aids/materials.", "2.", " Prepare and deliver lessons, assignments, lectures and demonstrations.", "3.", " Evaluate students through the use of exams, assignments and observations and record student progress.", "4.", " Supervise students in classroom, shop, labs and during tours.", "5.", " Counsel students and prospective students on matters pertaining to the program and job opportunities.", "6.", " Assist in/arrange for equipment maintenance/repair within the program and order supplies.", "7.", " Attend whenever possible, staff meetings, trade seminars, workshops, etc.", " to keep current with industry and educational requirements.", "8.", " Practice good interpersonal skills and a willingness to work in a “team” environment.", "9.", " Communicate in a clear and concise manner both orally and in written form."]}, {"subtitle": "Duties", "body": ["Required Qualifications, Skills and Abilities (QSA).", "1.", " A degree in Computer Science or a closely related degree with two years’ recent, relevant experience in a minimum of two of the following: programming, database management, project management, system administration or N-tier website development.", "OR.", "A diploma in Computer Science and at least five years’ recent, relevant experience in a minimum of two of the following: programming, database management, project management, system administration or N-tier website development.", "2.", " Effective communications skills.", "3.", " Effective interpersonal skills.", "4.", " Effective instructional ability.", "5.", " Demonstrates valuing diversity.", "6.", " Demonstrated competence and recent experience in the use of the internet, e-mail, MS Office Suite software and the ability to learn and adapt to changing technology.", "7.", " Ability to work as a team member in an ever-changing environment."]}]