[{"title": "Computer repair representative (T) BTS/BST"}, {"subtitle": "WHY CHOOSE BELL?", "body": ["Bell Technical Solutions is a wholly owned subsidiary of Bell Canada that specializes in the installation of Bell services such as Home Phone, Internet and TV.", " Bell Technical Solutions operates in the residential and business sectors throughout Québec and Ontario.", " Having more than 6,000 employees, Bell Technical Solutions has experienced strong growth since its founding in 1996.", " Bell Technical Solutions continues to distinguish itself from the competition through the excellence of its highly qualified workforce and the high calibre of its services.", "When you choose Bell Technical Solutions, you choose a company that focuses on creating jobs and offering real opportunities for professional development and advancement.", " Join our team of professionals to achieve your professional aspirations.", " A better career awaits you!."]}, {"subtitle": "RESPONSIBILITIES", "body": ["Configuration, repair and support of computer components.", "Receiving, shipping and inventory management.", "Sorting and primary diagnosis of defective equipment.", "Refurbishment and deployment of computer equipment.", "Processing of support tickets.", "Phone assistance to users.", "Preparation and analysis of reports.", "Customer service.", "Workload planning.", "Writing of documents.", "Contract and warranty management.", "Interaction with technicians, cable companies, customers, managers and service providers.", "All other related tasks."]}, {"subtitle": "REQUIREMENTS", "body": ["DEC in computer science, electronics or related field.", "Excellent knowledge of computer environments and equipment.", "Knowledge of Windows and Android operating systems.", "Software knowledge; SCCM, Samsung Odin, Microsoft AD, Sophos Mobile, Soti Mobi Control and Track-it."]}, {"subtitle": "SKILLS", "body": ["Knowledge of SAP one (asset).", "Autonomy, versatility and initiative spirit.", "Excellent communication skills, both verbal and written.", "Ability to work in a team.", "Good analytical skills.", "Excellent time management.", "Ability to learn."]}, {"subtitle": "WORKING CONDITIONS", "body": ["The selected candidate will work in an office environment; *under the circumstances, work from home until further notice*.", "Monday to Friday, 8:00 a.", "m.", " to 5:00 p.", "m.", "; be prepared to work beyond regular hours on occasion according to business needs."]}]