[{"title": "Customer Technical Support Engineer"}, {"subtitle": "The Opportunity", "body": ["As a technical support engineer, you will provide post-sales support to Customers and Sales Engineers regionally and globally (when required).", " Supporting the customer is done through diagnosis and troubleshooting software and hardware problems, and also providing assistance with the product applications and/or use cases.", " Communicate with customers by listening and understanding the reported problem, and able to clearly explain basic technical information to the customers over the phone and email.", " The candidate is responsible for following defined processes, getting engaged within the team environment and learning from the team.", " Ability to identify when help is required in a timely manner.", " Management of defect entry, tracking, and escalation.", " Part of an on-call rotational schedule."]}, {"subtitle": "The Job", "body": ["Ability to communicate with customers - listen and understand the problem, clearly explain basic technical information.", "Ask customers targeted questions to quickly understand the root of the problem.", "Diagnose and troubleshoot technical issues.", "Track issues through to resolution, within agreed time limits.", "Properly escalate unresolved issues to the appropriate next level / internal teams.", "Provide prompt and accurate feedback to customers.", "Refer to internal database or external resources to provide accurate technical solutions.", "Ensure all issues are properly logged – follow case management process.", "Prioritize and manage several open issues at one time.", "Follow up with customers to ensure their systems are fully functional after troubleshooting, and a work-around or solution has been provided.", "Document technical knowledge in the form of knowledge base articles and/or submit documentation opportunities.", "Communicate with Sales Team to ensure timely updates for any critical issue or inform on any opportunities at a customer.", "Work closely with Senior Technical Support Engineer and Engineering team to assist with documentation.", "Perform activities (reproduce the issue when required)."]}, {"subtitle": "What Skills You Bring", "body": ["Minimum of 5 years' experience in a technical role.", "Bachelor degree in a relevant field, like Computer Science, IT or Software Engineering.", " Microsoft, Cisco, Linux or similar certification or a diploma from a technical institute.", "Education may be substituted for proven work experience as a Technical Support Engineer in a similar field.", "Knowledge of Windows, Load Balancing, Firewalls and Virtual Machines.", "Unix OS experience (BSD/Linux/Solaris).", "Understanding of networks (CCNA level knowledge).", "High level understanding of technology infrastructure, security concepts and platforms.", "Strong understanding of networking (specifically IP related technologies).", "Good understanding of virtualization & cloud concepts.", "Knowledge of web services.", "Hands-on experience with the installation, configuration, and/or operation of network equipment such as Cisco, Juniper or other network hardware manufacturers – a valuable asset.", "Programming and/or scripting, SQL databases, network traffic monitoring, or firewall technologies – especially in a Telecom, ISP, or Cable Internet environment – a valuable asset.", "Experience in a technical product lab setting or operational network environment – a valuable asset.", "Ability to configure and troubleshoot problems - logical thought process.", "Good problem solving investigative and multi-tasking skills.", "Ability to communicate with customers presenting technical information either verbally or in written format.", "Focus to detail and can follow defined processes/procedures.", "Able to identify when assistance is required.", "Organization and prioritization abilities.", "Good computer skills in MS Office.", "Ideal candidate will have served as a developer in prior roles and have a deep understanding of modern, highly scalable architectures leveraging the latest technologies including NET/C#, Restful APIs, micro-services, cloud computing etc."]}, {"subtitle": "About Sandvine", "body": ["Networks are evolving, and operators need to keep up.", " At Sandvine, we’re working with innovative customers who are looking to embrace change and constantly improve.", " By combining analytics, machine learning, and automation, we help hundreds of network operators around the world make their networks run simpler and smarter – all while exceeding their expectations.", "As a Sandviner, you will take on new challenges, learn from industry leaders, and contribute to creative solutions as part of a growing team that is transforming the way the world runs networks."]}, {"subtitle": "What Can You Expect From Us", "body": ["Competitive compensation plan.", "Flexible working hours – in some roles work from home.", "Employee development including training programs and mentorship.", "Career development and advancement opportunities."]}]