[{"title": "IT Analyst"}, {"subtitle": "Job Purpose:", "body": ["Reporting to the IT Manager, the Junior IT Analyst is responsible for assisting with technology needs in the facility.", " The IT Analyst will be responsible for performing software installations, setting up personal computers along with the point of sale systems.", " The IT Analyst will work under the direction of the IT Manager to support the day to day operations of Ripley’s Aquarium of Canada.", "Please remember that due to the nature of our business, we work when others play in an attraction that is open 365 days of the year! You will be expected to be regularly available to work any shift during, before or after the hours of operation."]}, {"subtitle": "Critical Accountabilities:", "body": ["Seeking an individual with a well-rounded set of Information Technology skills.", "Duties will include supporting client PC’s, printers, Point of Sale (POS) computers, and assigned help desk tickets.", "The applicant should be familiar with all Microsoft Office products.", "Familiar with standard concepts, practices, and procedures.", "Manage and prioritize multiple tasks.", "Participation in the on call support rotation will be required.", "In addition, other job duties that may be assigned."]}, {"subtitle": "Special Skills and Requirements:", "body": ["Hands on computer experience.", "Knowledge of PC hardware.", "Knowledge of Windows 10 operating system.", "Knowledge of POS equipment a plus.", "Must be a detail oriented person.", "Understanding of configuration changes and their up/downstream impacts.", "Analytical and problem solving skills.", "Attention to detail, data integrity and accuracy.", "Excellent oral and written communication skills; and interpersonal skills.", "Self-starter, and ability to work under general direction and the ability to follow directions when given.", "Bachelor's degree in technology area preferred (i.", "e.", " Computer Science, Engineering, or other technical field)."]}]