[{"title": "IT Support Technician"}, {"subtitle": "description", "body": ["Neelands is a family owned, private Canadian company that has been in the refrigeration and HVAC business since 1958.", " We have a long history of providing comprehensive refrigeration and HVAC design, installation, and service offerings to Supermarkets as well as Commercial and Industrial markets across North America.", " We are a leader in advanced refrigeration technologies and state of the art products, offering turnkey solutions for new construction, retrofits for existing facilities, system controls, HVAC services, and sustainable energy services.", "Neelands is searching for an IT Support Technician in our Burlington, Ontario office.", " Working closely with employees onsite and remotely, the IT Support Technician will be a key point of contact locally in all IT support-related areas.", "Reporting to the IT Operations Engineer, the chosen individual will have troubleshooting experience with computers, laptops, printers, hardware, software, phone systems, servers, and IT products & services."]}, {"subtitle": "Responsibilities:", "body": ["Serve as a first point of contact in providing level 1 onsite technical support to users through basic troubleshooting.", "Repair, maintain, upgrade, install, and deploy hardware & software systems, products, services, and upgrades.", "Perform administration, maintenance, and troubleshooting of IT infrastructure (firewalls, switches, Windows 10 computers, Windows 2012/2019 Servers, networked printers, IP phones, Android/iPhones).", "Perform other duties as required."]}, {"subtitle": "Qualifications:", "body": ["· Post-secondary education in Computer Science, or related field.", "· 2-5 years’ hands-on troubleshooting experience in a fast-paced environment.", "· Strong computer and technical skills.", "· Strong customer service, time management, organizational, interpersonal, and troubleshooting skills.", "· Ability to work independently and in a team setting.", "· Highly organized with the ability to multi-task.", "· Forward thinker, creative, and innovative.", "Job Types: Full-time, Permanent."]}]