[{"title": "IT Helpdesk Technician"}, {"subtitle": "description", "body": ["Audcomp is the region's largest and oldest IT solutions provider.", " We are a leading IT provider in Managed Services, Cloud Services, Professional Services, Network Services, Consulting, Asset Management, Preventative Maintenance, IT Products & Solutions, and more.", " Audcomp' s clients include Universities, Municipalities, Medical, Industrial, Commercial, Public Sector, and many others.", " Audcomp provides IT solutions to customers in Ontario and across Canada.", " Established in 1986, Audcomp has continued to diversify what we offer to ensure that we stay relevant in today's every changing IT industry so that our customers are always provided the right IT solutions."]}, {"subtitle": "Responsibilities and Duties", "body": ["We are looking for a qualified Remote Service IT Technician to remotely monitor and maintain client servers, computer systems and networks infrastructure.", " This is an inside position working from our Ancaster offices.", "A successful Remote Service IT Technician must have a thorough knowledge of computer software and a variety of internet applications, networks and operating systems.", " The ideal candidate will also have great troubleshooting abilities and attention to detail.", " The goal is to build and maintain updated and efficient computer systems and networks to optimize the role of technology on business sustainability.", " You will be working in tandem with our team of Field Technicians and the client's Account Representative.", "If you love technology, computers and networks - this is your time to shine! We take care of our technicians and promote based on performance and customer satisfaction.", " Our environment is full of technology enthusiasts just like you!."]}, {"subtitle": "Duties and Responsibilities", "body": ["· Proactively monitor client networks, servers, workstations and network infrastructure.", "· Remotely maintain servers, computers and necessary peripheral devices, including printers, scanners, etc.", "· Remotely manage, troubleshoot and configure switches, access points, routers, firewalls and other network infrastructure.", "· Install and configure appropriate software and configure according to specifications.", "· Develop and maintain local and remote networks in ways that optimize performance.", "· Ensure security and privacy of networks and computer systems.", "· Provide orientation and guidance to users on how to operate new software and computer equipment.", "· Organize and schedule upgrades and maintenance without deterring others from completing their work.", "· Perform troubleshooting to diagnose and resolve problems.", "· Maintain records/logs of maintenance, repairs and fixes.", "· Identify computer or network equipment for replacement, upgrade or decommissioning.", "· Maintain managed services infrastructure, monitoring tools and systems.", "Provide reporting for client sites and make recommendations to help better their IT environment."]}, {"subtitle": "Required Education, Skills and Qualifications", "body": ["· Proven experience as a Remote Services IT Technician or relevant position.", "· Experience with design, installation and configuration of Windows Server 2008 through Server 2016, Active Directory, Exchange Server 2010-2016.", "· Experience with Office 365 and Azure cloud services.", "· Virtualization, using both VMware and Hyper-V is desired.", "· Excellent diagnostic and problem-solving skills.", "· Excellent communication skills, both verbal and written.", "· Outstanding organizational and time-management skills.", "· In depth understanding of diverse computer systems and networks.", "· Good knowledge of internet security and data privacy principles.", "· Degree in Computer Science, engineering or relevant field.", "· Certifications will be an advantage (e.", "g.", " CompTIA A+, Microsoft Certified IT Professional, VMware, Cisco, HP, WatchGuard, others."]}, {"subtitle": "Employee Attributes:", "body": ["· Excellent customer service skills.", "· Superior time management & organizational skills.", "· Ability to work both independently and in a team environment.", "· Effective relationship management skills.", "· Ability to think on their feet and outside the box.", "· Strong consulting and documentation skills.", "· Ability to work in a constantly changing & fast-paced environment.", "· After-hours flexibility for jobs required at client sites or remote work.", "· Must have a valid driver’s license and vehicle."]}, {"subtitle": "You will benefit from our;", "body": ["· Open and engaging work environment with rewards for those who excel.", "· Unlimited opportunities for growth.", "· Continual training and professional development on the latest innovations in IT solutions.", "· Work with state-of- the-art, leading-edge technologies.", "· Great culture, positive team environment and cross-learning opportunities.", "· Long-term position in a growing company.", "· Competitive compensation package, including benefits."]}]