[{"title": "QC - 2021 IT Internship Program, Technical Specialist"}, {"subtitle": "description", "body": ["At Bell, we do more than build world-class networks, develop innovative services and create original multiplatform media content – we’re revolutionizing how Canadians communicate.", "If you’re ready to bring game-changing ideas to life and join a community that values bold ideas, professional growth and employee wellness, we want you on the Bell team.", "The Bell IT team uses emerging technologies, Agile and DevOps to design and build innovative solutions that enable Bell’s communications services for businesses and consumers.", " We’re looking for creative problem-solvers who are curious, collaborative and ready to be on the leading edge of technological transformation."]}, {"subtitle": "Team & Role Description:", "body": ["We are offering this exciting Specialist Technology opportunity to a highly motivated, creative, and disciplined student that possesses an exceptional positive attitude.", " This role will require you to work closely with team members such as software architects, network architects, product owners, scrum masters, and developers.", " The agile Specialist Technology will be primarily responsible for developing solutions as part of an agile team, and a key contributor to software design, integration and deployment."]}, {"subtitle": "Responsibilities:", "body": ["Work with Software Vendors to ensure that solutions meet business requirements and the architectural vision.", "Guide project teams in system architecture, design, development, troubleshooting and selection of tools and technology to delivery project successfully.", "Monitor and vet major architectural decisions, changes, and open issues (e.", "g.", " data placement, tool/technology product selection, interfaces, new data stores, infrastructure issues).", "Work with Enterprise and Application Architecture teams to drive alignment around more pragmatic vs.", " prescriptive solutions.", "Provide consulting and direction during Project Initiation phase and support Front Door assessments."]}, {"subtitle": "Essential Qualifications:", "body": ["Completing a Bachelor or Master’s degree in Information Technology, Computer Science, Software or Computer Engineering.", " Available at minimum for a May until September work term.", "Knowledge of operator systems (Unix/Linux/Windows) and Java/J2EE Application servers (Weblogic, WebSphere, JBoss, etc.", ").", "Familiarity with programming languages is highly recommended.", "Good knowledge of software architecture patterns & practices.", "Dynamic collaborator with multiple project team member experience (vendors, project managers, analysts, architecture, business sponsors, etc.", "Bilingualism is an asset (English and French)."]}, {"subtitle": "Leadership Competencies:", "body": ["Transformational agent – agile and ability to mobilize resources and execute on critical initiatives needed to transform our business.", "Great communicator – ability to communicate effectively at all levels of the organization.", "Critical thinker – demonstrated ability to tackle complex problems effectively.", "Avid learner – continuous learner of all things technical and process.", "Focus driven – ability to manage stress and pressure in a collaborative environment."]}, {"subtitle": "You’re Interested! Now What?", "body": ["Apply through Bell’s careers page.", "You must submit a cover letter, resume, and most recent transcripts (unofficial accepted) to be considered.", "Do not apply to the same job posting in multiple locations.", "Focus your efforts and apply to a maximum of 3 Bell postings that match your skills and interests.", "Bell Canada has a diverse workforce and is an equal opportunity employer."]}]