[{"title": "Tech Support Engineer"}, {"subtitle": "Overview of the position:", "body": ["If you have solid organizational skills, enjoy working in a fast paced, collaborative environment and have a passion for customer service and technology then we would love to hear from you.", "As a Technical Support Engineer you are responsible for providing remote systems support and maintenance for mission-critical Radiology imaging and workflow systems deployed at customer facilities around the world.", "A training and mentorship program will be provided on all the IWS suite of products in order to obtain specialized knowledge and professional judgment to investigate and analyze issues to help in problem solving and resolution to root cause.", "As a company we offer many opportunities for our employees to grow their careers.", " Change Healthcare offers a competitive wage based on your skills, experience and qualifications and a comprehensive benefits package which includes RRSP matching, Stock Purchase Plan and yearly Education funding."]}, {"subtitle": "What will be my duties and responsibilities in this job?", "body": ["You provide world-class customer experience through great customer service on every call.", "You resolve customer requests initiated through multiple support channels including: telephone and online support request submissions.", "You will troubleshoot issues on hospital systems which utilize some of the following technologies: proprietary Change Healthcare software, Local & Wide Area Networks, Windows Servers and workstations, Enterprise-class hardware & storage systems, and Oracle databases.", "You will have the support of internal teams within Support and other departments as required to deliver on customer requests.", "You will perform scheduled preventative maintenance and systems administration functions at customer facilities.", "You help diagnose hardware malfunctions and provide hardware support to customers.", " This includes liaising with external hardware vendors (HP, DELL, IBM) for servicing and replacement of defective parts.", "You possess critical thinking and problem solving skills with the ability to develop in-depth product knowledge through a commitment to continuous learning and personal development."]}, {"subtitle": "What are the requirements needed for the position?", "body": ["A Bachelor's Degree in Computer Science/Engineering, Computer Technology Diploma, MCSE or equivalent industry experience.", "Entry level experience diagnosing and troubleshooting software and/or on computer systems.", "Understanding of Networking fundamentals, Windows Operating System, Storage technologies, Server and workstation hardware.", "Troubleshooting skills and the ability to analyze complex hardware and software problems using standardized procedures.", "Ability to recommend solutions in a complex technical environment."]}, {"subtitle": "What other skills/experience would be helpful to have?", "body": ["Experience in a software technical support or customer service environment is preferred.", "Excellent communication skills (written and verbal).", "Strong customer service skills and ability to interact effectively with varying audiences.", "Highly developed organization skills and an ability to multitask in a fast-paced environment.", "Experience handling proprietary software."]}]