[{"title": "IT Applications and Server Support Analyst in Kanata, Ontario"}, {"subtitle": "description", "body": ["VirtaMove requires a very technical IT Applications and Server Support Analyst to help with the post-sales delivery of VirtaMove’s Window Server application migration solution.", " The IT Applications and Server Support Analyst will provide third tier triage application migration support.", " The candidate should have very strong IT troubleshooting skills and have a broad range of IT experience to draw upon."]}, {"subtitle": "Responsibilities:", "body": ["Provide support to Field Engineering team; perform migrations for customers, as needed.", "Performing migrations using MI Suite including assessment, migration, and post migration trouble-shooting.", "Understanding and communicating customer requirements.", "Support Field team by handling escalated helpdesk tickets.", " Investigate and troubleshoot systems to move migrations to successful completion.", "Occasional travel may be required."]}, {"subtitle": "Experience:", "body": ["Install new / rebuild existing servers and configure hardware, peripherals, services, settings, directories, storage.", "Server infrastructure maintenance.", "Onboarding equipment and resources for staff.", "Security systems support and administration.", "Post-Secondary Degree or Diploma in computer science, related field or combined education and experience.", "A minimum of 5+ years of relevant experience as a System Administrator, Network Administrator or similar.", "Strong knowledge of Windows application deployments, including operating systems (Windows 2000, 2003, 2008, 2012, 2016), networking, storage, databases, and runtime environments such as Web servers, .", "Net, Java, etc.", "OS configuration skills and the ability to determine an application’s footprint.", "Excellent troubleshooting, debugging and diagnostic skills.", "Ability to understand application logs.", "Procmon (Process Monitor) experience would be considered a very strong asset.", "Knowledge of virtualization software such as VMWare / AWS cloud services / Google compute.", "Knowledge of system security and data backup/recovery.", "Familiarity with server migration process, security and hardening of servers.", "Ability to create scripts in Powershell, Python, Perl or other language.", "Strong Networking knowledge.", "A wide range of IT skills.", "Strong communications and interpersonal skills.", "Ability to plan and manage multiple projects.", "Strong time management skills."]}]