[{"title": "Software Engineer Coop/Intern"}, {"subtitle": "The Opportunity", "body": ["Software Engineers at Sandvine are smart, passionate developers able to solve and implement complex problems with the most robust high quality solutions on the planet.", " If you want to work on the latest advances in active network intelligence, with engineers who thrive in a collaborative, global organization, and have the skills and technical chops to get stuff done, you may be ready to join the Sandvine Team.", "You will be part of a team where you will work directly with customers, understanding the challenges they have and deliver solution iteratively.", " It's a startup attitude where you go through the cycle of \"build-measure-learn\".", " You will design, develop, test, and maintain a variety of software.", " You will be exposed to a wide variety of technologies and methodologies.", " If you are looking for a very challenging and rewarding work experience, then we would like to hear from you."]}, {"subtitle": "The Job", "body": ["Shape the future of networks with innovative products and solutions.", "Develop software on Sandvine's leading-edge platforms collaborating with our solution architects and other technical leaders.", "Implement high quality, high performance code.", "Debugging and troubleshooting problems in test and in production."]}, {"subtitle": "What Skills You Bring", "body": ["Working towards your BE or ME (or equivalent degree) degree in Engineering or Computer Science.", "Excellent programming skills in one or more of (C/C++, Java, Go or similar languages).", "Scripting Skills (Python, Ruby, or, Bash, etc).", "Debugging and troubleshooting problems in test and in production.", "Experience with open protocol standards such as Diameter and/or REST interfaces.", "Experience using git/github for version control.", "Knowledge with Linux system configuration, OpenStack, Amazon AWS or other cloud computing infrastructure and service orchestration.", "Knowledge with Virtual Machines, Network Functions Virtualization, and Software Defined Networking."]}, {"subtitle": "About Sandvine", "body": ["Networks are evolving, and operators need to keep up.", " At Sandvine, we’re working with innovative customers who are looking to embrace change and constantly improve.", " By combining analytics, machine learning, and automation, we help hundreds of network operators around the world make their networks run simpler and smarter – all while exceeding their expectations.", "As a Sandviner, you will take on new challenges, learn from industry leaders, and contribute to creative solutions as part of a growing team that is transforming the way the world runs networks."]}]