[{"title": "IM/IT Technicians - Multiple Streams"}, {"subtitle": "Important messages", "body": ["We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process.", " If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation.", " All information received in relation to accommodation will be kept confidential.", "Assessment accommodation.", "When you apply to this selection process, you are not applying for a specific job, but to an inventory for future vacancies.", " As positions become available, applicants who meet the qualifications may be contacted for further assessment.", "___________.", "Looking for new opportunities in the field of Computer Systems? Look no further! We're seeking Help Desk Technicians & System Administrators ready to join our dynamic team.", "Here is what you can expect throughout the selection process:.", "PHASE 1: Throw your hat in the ring.", "Complete the quick online application to put your name forward for further consideration.", " After the closing date we'll review your application and resume to see if you have what it takes.", " You should hear from us soon if you're proceeding to phase 2.", "PHASE 2: Go ahead, brag a little.", "If you reach this phase, you'll be invited to provide more detail on your experiences and qualifications.", " Don't worry, we'll give you ample time to tell us all about yourself.", "PHASE 3: Meet & Greet.", "We're impressed! You've successfully demonstrated the key competencies we've assessed so far.", " Our management team is excited to meet you & discuss the opportunity further.", "PHASE 4: Congratulations!.", "You've met the requirements and an offer could be on the table.", " We'll let you know where you stand and when and if you can expect an offer of employment to be a member of our team.", "Have a look at the job qualifications below.", " Sound like you? Scroll up and click \"Apply online\"."]}, {"subtitle": "Work environment", "body": ["The busiest fighter base in Canada.", " 4 Wing Cold Lake provides general purpose, multi-role, combat capable forces in support of domestic and international roles of Canada's Air Force.", "As a civilian employee, you will be an essential part of the Defence Team.", " The department fosters a work environment where employees have opportunities to grow, to learn, to progress in their careers and have job satisfaction over the long-term.", "The work location is located 300km north-east of Edmonton, AB.", " For more information on this remote community please consult the following sites:."]}, {"subtitle": "Intent of the process", "body": ["Qualified candidates may be considered for similar positions on an indeterminate or term basis, including casual employment and with various security requirements.", "In order to be considered, your application must clearly explain how you meet the following (essential qualifications).", "Successful completion of two years of an acceptable post-secondary educational program in computer science, information technology, information management or another specialty relevant to the position to be staffed.", "Notes:.", "1.", " Indeterminate period incumbents of positions in the CS group on May 10, 1999, who do not possess the education prescribed above, are deemed to meet the minimum education standards based on their education, training and/or experience.", " They must be accepted as having met the minimum education standard whenever this standard is called for when staffing positions in the CS group.", "2.", " It is the recognized educational institution (e.", "g.", " community college, CÉGEP or university) that determines if the courses taken by a candidate correspond to two years of a post-secondary program at the institution.", "3.", " At the manager's discretion, an acceptable combination of education, training and/or experience may serve as an alternative to the minimum post-secondary education stated above.", " Whenever the minimum education is met using this alternative, it is met for the specific position only and must be re-assessed for other positions for which this alternative has been specified by the manager.", "Degree equivalency.", "Both Streams:.", "3.", " Experience installing and supporting Windows Operating Systems (Windows 7 and/or Windows 10)."]}, {"subtitle": "The following will be applied / assessed at a later date (essential for the job)", "body": ["English essential.", "Information on language requirements.", "Stream 1: Desktop Support & Help Desk Technician.", "1.", " Experience providing end user support for IT infrastructure components.", "2.", " Experience diagnosing and resolving technical problems in a Microsoft area network environment.", "Stream 2: System Administrator.", "1.", " Experience providing support to network modifications.", "2.", " Experience performing third line maintenance.", "___________.", "Oral Communication.", "Written Communication.", "Working effectively with others.", "Thinking things through.", "Showing initiative and being action oriented.", "Demonstrating integrity and respect."]}, {"subtitle": "The following may be applied / assessed at a later date (may be needed for the job)", "body": ["Graduation with a degree from a recognized post-secondary educational program in computer science, information technology, information management or another specialty relevant to the position to be staffed.", "Degree equivalency.", "Successful completion of one or more occupational certifications in the field of Information Technology or related to the position being staffed, such as: A+, Microsoft, or other.", "Experience working with Government of Canada computer systems.", "Experience providing advice and guidance.", "Experience in project management.", "Experience in programming languages such as: Python, Power shell, C+.", "Experience using SCCM (System Centre Configuration Manager).", "Some positions may require one or more of the following (as applicable to the position being staffed):.", "Willing and able to work overtime as pre-authorized.", "Willing and able to attend employer directed training.", "Willing and able to maintain a DND 404.", "Willing and able to lift up to 20kg in accordance with safe lifting practices."]}, {"subtitle": "Conditions of employment", "body": ["Secret security clearance.", "Possession of a valid unrestricted provincial driver’s license."]}, {"subtitle": "Other information", "body": ["The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve.", " We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply.", "Information on employment equity.", "All job applications must be submitted on-line.", " To submit an application, please select the button “Apply Online”.", " Persons with disabilities preventing them from applying on-line are asked to contact 1-800-645-5605.", "For this selection process, our intention is to communicate with you by e-mail.", " You must include a valid e-mail address in your application.", "You must meet all of the essential qualifications noted in the Statement of Merit Criteria to be appointed to a position.", " A candidate may be appointed to a position even though he/she does not meet any or all of the asset qualifications or operational requirements.", " However, meeting these criteria is desirable and may be a deciding factor in choosing the person to be appointed.", "A random and/or top down selection of candidates may be used in the determination of those to be given further consideration in the assessment process.", "Successful candidate(s) must meet and maintain the Conditions of Employment throughout their employment."]}, {"subtitle": "Preference", "body": ["Preference will be given to veterans and to Canadian citizens, in that order, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first.", "Information on the preference to veterans."]}]