[{"title": "Microsoft 365 Business Technical Advisor I"}, {"subtitle": "Here's what we do and why we do it", "body": ["Simply put, we will work together to simplify businesses' IT with cloud technology so they can focus on what really matters, making people’s lives better.", " Discover how we do that here: www.", "sherweb.", "com/about/."]}, {"subtitle": "Here's how you will contribute to the success of the company", "body": ["Member of the M365 Support department, reporting to a support lead and working out in one of our modern offices, you will provide high-quality technical support by offering the best customer service in the industry to our clients in more than 100 countries worldwide.", " You will be responsible for the overall customer experience and take care of technical issues related to our Microsoft products and services, notably Office 365."]}, {"subtitle": "Here's what your day-to-day will look like in this role", "body": ["Assist and provide technical support by phone, email or chat;.", "Analyze and resolve technical issues related to our Microsoft products and services, notably Office 365;.", "Lead customers through service configurations;.", "Provide a very high customer service level;.", "Deliver and follow up on problem resolutions and customer satisfaction;.", "Proactively and comprehensively document customer issues in ticketing systems;.", "Carry out all other related tasks per the job’s evolution and departmental needs."]}, {"subtitle": "Here's what you need to have and master to get the job", "body": ["DES or DEP, with a strong interest in IT;.", "AEC or DEC in computer science (an asset);.", "Experience in customer service;.", "Excellent English skills, both spoken and written, are essential;.", "Knowledge of Office 365 or Microsoft 365;.", "Basic knowledge of Windows applications;.", "Ability to vulgarize technical concepts;.", "Fast-learning skills."]}, {"subtitle": "If you have these skills, you will fit right in with us", "body": ["You have excellent communication skills;.", "You are result-oriented;.", "You provide quality customer service;.", "You are organized, resourceful and autonomous;.", "You like to analyze and are good at solving problems;.", "You have strong potential for professional and leadership development."]}, {"subtitle": "Here's what you can expect from us", "body": ["Shortcutting your journey to your aspirations is possible when you surround yourself early on with knowledgeable and genuine people.", " We will put you in charge of important responsibilities from the beginning so that you can build your professional reputation.", " We will also help you quickly identify your strengths to build a strong foundation for your potential.", " So, if you have a head full of ideas and a soul full of hopes, here the floor is yours."]}, {"subtitle": "This is our team philosophy", "body": ["Humans were built to help each other.", " What unites our team is the sense of purpose we get from helping one another and our customers.", " That's who we are, not just what we do.", " If you share this philosophy, you might just be one of us.", " Send us your resume to tell us your story.", "#."]}]