[{"title": "Operational Technology - Summer Interns"}, {"subtitle": "description", "body": ["Summer 2021 Internship Opportunity.", "At CN, everyday brings new and exciting challenges.", " You can expect an interesting environment where you’re part of making sure our business is running optimally and safely―helping keep the economy on track.", " We welcome students who share their ideas, perspectives and understanding of new technologies, with our teams.", " In return, we provide the opportunity to work on exciting projects with experienced collaborators who are happy to share their knowledge, all within a mutually-agreed to framework.", " You will be able to thrive in our close-knit, safety-focused culture working together as ONE TEAM.", " The opportunities we offer are meaningful because the work we do matters.", " Join us!."]}, {"subtitle": "Make an exciting career move. Join a North American Leader in Transportation and Logistics", "body": ["CN is deploying some of the largest technology programs in Canada and we want to partner with creative and bright individuals who bring diverse opinions and points of view.", " We will provide you with the tools and opportunities to steer your path from student to experienced professional through a challenging four month-long paid work experience, where you can integrate your studies.", " CN’s summer internship program will give you hands-on experience helping deliver successful project outcomes while working in dynamic teams.", " No photocopying or filing here.", " Apply today!."]}, {"subtitle": "Get Your Career Moving", "body": ["Usher in the next evolution in transportation, logistics and supply chain excellence.", " We are building the digital railroad of the future with digital networks, GIS-geo spatial innovation, and advanced train operations.", " Join us and be a part of the technical teams responsible for continuous safety improvements and delivering ever-greater service to our customers and the communities we serve."]}, {"subtitle": "Team Summary", "body": ["You will be part of the Operational Technology team which is accountable to lead CN’s operational technology strategy and identify, select and implement OT reusable platforms and solutions within CN’s operations to build a digitally connected railway delivering key business outcomes.", " Leverage data collection and analytics leading to a safer and more reliable network."]}, {"subtitle": "Education Requirement:", "body": ["Working towards a degree in computer science, information systems or a related field.", "About CN.", "As a leading North American transportation and logistics company, CN is a true backbone of the economy.", " With a team of approximately 25,000 railroaders, our focus is on moving both our company and the economy forward.", " We transport US$200 billion worth of goods annually for a wide range of business sectors from resource to manufactured products to consumer goods, across a 20,000-mile network spanning Canada and mid-America.", " CN is the only Canadian company listed in the Transportation and Transportation Infrastructure sector of the Dow Jones Sustainability World Index (DJSI).", " Launched in 1999, the DJSI World represents the gold standard for corporate sustainability.", " At CN, we work as ONE TEAM, focused on safety, sustainability and our customers, providing operational and supply chain excellence to deliver results."]}]