[{"title": "Software Engineer"}, {"subtitle": "description", "body": ["HB Studios is Atlantic Canada's largest and most successful independent video game developer.", " We partner with the biggest names in the industry and are currently developing games across all current and upcoming gaming platforms.", "We have an opportunity for a Software Engineer to join our team of developers, creators, and fans, who are passionate about the art and process involved in video game development.", " As a Software Engineer, you will be responsible for designing and implementing code and script as needed for a project while ensuring high quality work is delivered on time."]}, {"subtitle": "Main Duties and Responsibilities", "body": ["Work closely with colleagues across all disciplines on the project team.", "Ensure that the technical Lead is aware of the progress of assigned work.", "Communicate issues that could disrupt agreed upon schedules with the Technical Lead.", "Implement code and script to the required coding standards.", "Ensure that components are designed and reviewed prior to implementation.", "Achieve in-game performance targets as required by Production.", "Create and maintain positive working relationships with all team members."]}, {"subtitle": "Essential Skills, Knowledge and Experience", "body": ["Bachelor of Science in Computer Science or equivalent experience.", "Passion for video games.", "Practical experience programming in C++ and/or C#.", "Experience with game engines (Unity, Unreal).", "Experience with graphics / rendering.", "Fundamental math skills (matrices, vectors, algebra, etc.", ").", "Ability to work effectively in a collaborative team environment.", "Ability to work with a high degree of self-direction when necessary.", "Excellent organizational, communication and interpersonal skills.", "Self-motivated, creative, outside-the-box thinker.", "Willingness to learn new tools, engines, and languages."]}, {"subtitle": "Desirable Skills, Knowledge and Experience", "body": ["Interest in specific game programming disciplines (AI, rendering, user interface, audio).", "Experience with a variety of programming languages (C#, Lua, JavaScript, SQL).", "Experience with 3D graphics programming (Shaders, DirectX, OpenGL).", "Experience working on video games.", "Experience with Windows programming.", "Advanced knowledge in math and physics."]}]