{
    "id": "0013",
    "name": "Senior managers - financial, communications and other business services",
    "lead statement": "Senior managers in this unit group are usually appointed by a board of directors, to which they report. They work either alone or in conjunction with the board of directors to develop and establish objectives for the company, and to develop or approve policies and programs. They plan, organize, direct, control and evaluate, through middle managers, the operations of their organization in relation to established objectives. They work in establishments throughout the telecommunications, finance, insurance, real estate, and data processing, hosting and related services industries as well as other business service industries or they may own and operate their own business.",
    "example titles": [
        "advertising agency president",
        "assistant executive director – financial, communications and other business services",
        "bank credit vice-president",
        "bank president",
        "chairman/woman – financial, communications and other business services",
        "chairperson – financial, communications and other business services",
        "chief executive officer (CEO) – financial, communications and other business services",
        "chief executive officer (CEO) – telephone company",
        "chief financial officer (CFO) – advertising agency",
        "chief financial officer (CFO) – financial, communications and other business services",
        "chief operating officer – engineering firm",
        "chief operating officer – financial, communications and other business services",
        "chief privacy officer – financial, communications and other business services",
        "computing services company president",
        "controller – financial, communications and other business services",
        "corporate banking vice-president",
        "corporate controller – financial, communications and other business services",
        "corporate controller – mortgage brokerage firm",
        "credit union executive director",
        "credit union general manager",
        "deputy chief executive officer – financial, communications and other business services",
        "deputy chief executive officer – life insurance company",
        "domestic banking operations vice-president",
        "employment agency general manager",
        "engineering firm president",
        "engineering research general manager",
        "engineering vice-president – financial, communications and other business services",
        "executive director – financial, communications and other business services",
        "executive vice-president – financial, communications and other business services",
        "executive vice-president – real estate agency",
        "finance and administration vice-president – financial, communications and other business services",
        "finance vice-president – financial, communications and other business services",
        "finance vice-president – holding company",
        "general manager – financial, communications and other business services",
        "general manager – real estate management company",
        "human resources and organizational development vice-president – financial, communications and other business services",
        "human resources vice-president – bank",
        "human resources vice-president – financial, communications and other business services",
        "information systems vice-president – financial, communications and other business services",
        "insurance company general manager",
        "international banking operations vice-president",
        "marketing vice-president – clerical staff services",
        "marketing vice-president – financial, communications and other business services",
        "operations vice-president – financial, communications and other business services",
        "operations vice-president – satellite communication services",
        "personal banking vice-president",
        "personnel vice-president – bank",
        "personnel vice-president – financial, communications and other business services",
        "planning vice-president – financial, communications and other business services",
        "president – financial, communications and other business services",
        "president and chief executive officer – financial, communications and other business services",
        "protective services executive director",
        "real estate management company executive director",
        "regional vice-president – financial, communications and other business services",
        "senior vice-president and chief economist",
        "support services vice-president – financial, communications and other business services",
        "telecommunications general manager",
        "treasury vice-president – banking institution",
        "trust company general manager",
        "trust company regional vice-president",
        "vice-president – financial, communications and other business services"
    ],
    "main duties": [
        "Determine the company's mission and strategic direction as conveyed through policies and concrete objectives which are met through the effective management of human, financial and material resources",
        "Authorize and organize the establishment of major departments and associated senior staff positions",
        "Allocate material, human and financial resources to implement organizational policies and programs; establish financial and administrative controls; formulate and approve promotional campaigns; and approve overall human resources planning",
        "Select middle managers, directors or other executive staff; delegate the necessary authority to them and create optimum working conditions",
        "Represent the organization, or delegate representatives to act on behalf of the organization, in negotiations or other official functions.",
        "Senior managers in this unit group may specialize in areas such as finance, marketing or human resources or in a particular service area."
    ],
    "employment requirements": [
        "A university degree in business administration, commerce, computer science or other discipline related to the service provided is usually required.",
        "Several years of experience as a middle manager in financial, communications or other business services are usually required.",
        "Specialization in a particular functional area or service is possible through specific university training in that area or through previous experience.",
        "Senior managers in finance usually require a professional accounting designation."
    ],
    "additional information": [
        "There is mobility among senior management occupations."
    ],
    "exclusions": []
}