{
    "id": "0132",
    "name": "Postal and courier services managers",
    "lead statement": "Postal and courier services managers plan, organize, direct, control and evaluate the activities and operations in postal facilities and in establishments that provide courier services. They are employed by Canada Post Corporation and by courier companies.",
    "example titles": [
        "area manager – postal service",
        "collection and delivery operations manager – postal service",
        "commercial development manager – postal and courier services",
        "courier service manager",
        "delivery service manager – postal and courier services",
        "district post office director",
        "field service manager – postal and courier services",
        "mail operations manager",
        "mail processing plant manager",
        "mail processing plant superintendent",
        "messenger service manager",
        "parcel processing plant manager",
        "plant manager – postal and courier services",
        "plant operations manager – postal service",
        "plant superintendent – postal and courier services",
        "post office manager",
        "postal area manager",
        "postal station superintendent",
        "postal zone facilities manager",
        "postal zone manager",
        "production control manager – postal service",
        "regional services manager – postal and courier services"
    ],
    "main duties": [
        "Plan, organize, direct, control and evaluate the activities and operations of postal facilities and courier service companies, or of operational divisions within Canada Post and courier service companies",
        "Co-ordinate the duties of supervisors and other staff",
        "Manage the accurate and expedient movement of mail and parcels through postal and parcel sorting facilities",
        "Review effectiveness of assigned operations and implement changes to postal and courier operations",
        "Prepare and submit budget estimates and administer the expenditures of postal and courier facilities",
        "Interview, hire and provide training for staff."
    ],
    "employment requirements": [
        "A university degree or college diploma is usually required.",
        "Several years of supervisory or operational experience within a postal or courier facility are usually required."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Postmasters (in 1214 Supervisors, mail and message distribution occupations",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1214&ver=16"
        }
    ]
}