{
    "id": "0432",
    "name": "Fire chiefs and senior firefighting officers",
    "lead statement": "Fire chiefs and senior firefighting officers plan, organize, direct, control and evaluate firefighting operations and fire prevention activities in fire departments. Fire chiefs and senior firefighting officers are employed by municipal and federal governments and by industrial establishments with firefighting services.",
    "example titles": [
        "airport fire department chief",
        "deputy fire chief",
        "district fire chief",
        "division chief – fire department",
        "fire chief",
        "fire department assistant deputy chief",
        "fire department assistant manager",
        "fire department chief",
        "fire department division chief",
        "fire department duty officer",
        "firefighters executive officer",
        "industrial fire chief",
        "refinery fire chief",
        "sawmill fire chief",
        "senior firefighting officer"
    ],
    "main duties": [
        "Develop, implement and evaluate policies and procedures for the operation of a municipal fire department, a district fire region or an industrial firefighting service",
        "Plan, direct and co-ordinate firefighting strategies for fire departments",
        "Evaluate the type of fire, the extent of damage to buildings and the danger to nearby establishments",
        "Direct activities at the scene of a fire",
        "Determine damage estimates and investigate the potential causes of a fire after extinguished",
        "Develop and oversee the implementation of security and fire prevention campaigns",
        "Represent the fire department in communications with government, the media and the public",
        "Direct the training of personnel in firefighting methods",
        "Co-ordinate and monitor budget and departmental resources."
    ],
    "employment requirements": [
        "Completion of secondary school is required.",
        "Completion of a college program in fire protection technology, fire science or a related field is usually required.",
        "Completion of a provincial or municipal firefighters training course is required.",
        "A minimum of ten years of experience as a firefighter is usually required before becoming eligible for a senior officer position."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Firefighters (4312)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4312&ver=16"
        }
    ]
}