{
    "id": "0714",
    "name": "Facility operation and maintenance managers",
    "lead statement": "Facility operation managers plan, organize, direct, control and evaluate the operations of commercial, transportation and recreational facilities and the included real estate. Facility operation managers are employed by a wide range of establishments, such as airports, harbours, canals, shopping centres, convention centres, warehouses and recreational facilities. Maintenance managers plan, organize, direct, control and evaluate the maintenance department within commercial, industrial, institutional, recreational and other facilities. Maintenance managers are employed by a wide range of establishments, such as office buildings, shopping centres, airports, harbours, warehouses, grain terminals, universities, schools and sports facilities, and by the maintenance and mechanical engineering departments of manufacturing and other industrial establishments.",
    "example titles": [
        "airport manager",
        "airport services manager",
        "airport terminal manager",
        "arena manager",
        "assistant shopping centre manager",
        "assistant shopping mall manager",
        "assistant warehouse manager",
        "athletic facility manager",
        "building maintenance head",
        "building maintenance manager",
        "building operations manager",
        "building services head",
        "building services manager",
        "campus maintenance manager",
        "canal director",
        "canal superintendent",
        "cemetery manager",
        "conference centre manager",
        "convention centre manager",
        "country grain elevator facility manager",
        "director of maintenance",
        "distribution centre manager",
        "electrical superintendent",
        "facilities maintenance head",
        "facility maintenance manager",
        "facility management director",
        "facility operations manager",
        "fitness facility manager",
        "grain terminal elevator manager",
        "harbour master",
        "industrial maintenance manager",
        "maintenance and service manager",
        "maintenance and service superintendent",
        "maintenance co-ordinator",
        "maintenance director",
        "maintenance manager",
        "maintenance operations manager",
        "maintenance operations superintendent",
        "maintenance planner",
        "maintenance services manager",
        "maintenance superintendent",
        "maintenance support services chief",
        "marina manager",
        "marina operator",
        "mechanical services superintendent",
        "plant maintenance manager",
        "plant maintenance superintendent",
        "port director",
        "property manager",
        "recreation facility manager",
        "school maintenance manager",
        "shopping centre maintenance manager",
        "shopping centre manager",
        "shopping mall maintenance manager",
        "shopping mall manager",
        "sports facility manager",
        "stadium manager",
        "tennis court manager",
        "tobacco warehouse manager",
        "university maintenance manager",
        "warehouse and distribution centre manager",
        "warehouse manager",
        "warehouse superintendent",
        "warehousing manager"
    ],
    "main duties": [
        "Plan, organize, direct, control and evaluate the operations of commercial, transportation and recreational facilities and the included real estate",
        "Oversee the leasing of space in the facility and the included real estate and the development of marketing strategies ",
        "Plan, organize and direct administrative services such as signage, cleaning, maintenance, parking, safety inspections, security and snow removal",
        "Plan, organize, direct, control and evaluate construction projects to modify commercial, transportation and recreational facilities and real estate",
        "Oversee the installation, maintenance and repair of real estate infrastructures including machinery, equipment and electrical and mechanical systems",
        "Plan and manage the facility's operations budget",
        "Prepare or oversee the preparation of reports and statistics related to areas of responsibility",
        "Hire and oversee training and supervision of staff.",
        "Direct the maintenance and repair of an establishment's machinery, equipment and electrical and mechanical systems",
        "Develop and implement schedules and procedures for safety inspections and preventive maintenance programs",
        "Co-ordinate cleaning, snow removal and landscaping operations",
        "Administer contracts for the provision of supplies and services",
        "Plan and manage a facility's maintenance budget",
        "Hire and oversee training and supervision of staff."
    ],
    "employment requirements": [
        "Facility operation managers require completion of a college or university program in business administration or in a discipline related to facility operation and maintenance \r\n or an equivalent combination of technical training and experience in administration or maintenance.",
        "Maintenance managers require completion of a college or university program in electrical or mechanical engineering or in another discipline related to building maintenance \r\n or an equivalent combination of technical training and experience in building maintenance.",
        "Several years of supervisory experience in facility operations or maintenance are usually required."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Building superintendents (in 6733 Janitors, caretakers and building superintendents",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6733&ver=16"
        },
        {
            "name": "Contractors and supervisors, mechanic trades (7301)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7301&ver=16"
        },
        {
            "name": "Production operations managers (in 0911 Manufacturing managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0911&ver=16"
        },
        {
            "name": "Property administrators (1224)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1224&ver=16"
        },
        {
            "name": "Transportation operations and freight traffic managers (in 0731 Managers in transportation",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0731&ver=16"
        }
    ]
}