{
    "id": "1112",
    "name": "Financial and investment analysts",
    "lead statement": "Financial and investment analysts collect and analyze financial information such as economic forecasts, trading volumes and the movement of capital, financial backgrounds of companies, historical performances and future trends of stocks, bonds and other investment instruments to provide financial and investment or financing advice for their company or their company's clients. Their studies and evaluations cover areas such as takeover bids, private placements, mergers or acquisitions. Financial analysts are employed by a wide range of establishments throughout the private and public sector, such as banks, brokerage houses, insurance companies, investment companies, manufacturing firms, trust companies, utility companies and underwriting firms. Investment analysts are employed primarily by brokerage houses and fund management companies.",
    "example titles": [
        "assistant financial analyst",
        "bond analyst",
        "chartered financial analyst",
        "corporate investment adviser",
        "cost financial analyst",
        "finance and commercial affairs analyst",
        "financial analysis consultant",
        "financial analyst",
        "financial services economic analyst",
        "financial services research associate",
        "fiscal projections consultant",
        "investment analyst",
        "investment consultant",
        "junior financial analyst",
        "money market analyst",
        "mutual fund analyst",
        "portfolio manager",
        "regional financial analyst",
        "securities analyst",
        "securities research analyst",
        "senior financial analyst",
        "senior investment officer",
        "senior planning and return analyst",
        "senior planning and yield analyst"
    ],
    "main duties": [
        "Evaluate financial risks, prepare financial forecasts, financing scenarios and other documents concerning capital management, and write reports and recommendations",
        "Plan short- and long-term cash flows and assess financial performance",
        "Analyze investment projects",
        "Advise on and participate in the financial aspects of contracts and calls for tender",
        "Follow up on financing projects with financial backers",
        "Develop, implement and use tools for managing and analyzing financial portfolio",
        "Prepare a regular risk profile for debt portfolios",
        "Assist in preparing operating and investment budgets.",
        "Collect financial and investment information about companies, stocks, bonds and other investments using daily stock and bond reports, economic forecasts, trading volumes, financial periodicals, securities manuals, company financial statements and other financial reports and publications",
        "Examine and analyze financial and investment information collected, including profiles of companies, stock and bond prices, yields and future trends and other investment information",
        "Provide investment advice and recommendations to clients, senior company officials, pension fund managers, securities agents and associates",
        "Prepare company, industry and economic outlooks, analytical reports, briefing notes and correspondence."
    ],
    "employment requirements": [
        "A bachelor's degree in commerce, business administration or economics \r\n and on-the-job training and industry courses and programs are usually required.",
        "A master's degree in business administration (MBA) (concentration in finance) or in finance may be required.",
        "The Chartered Financial Analyst (CFA) designation, available through a program conducted by the Institute of Chartered Financial Analysts in the United States, may be required by some employers."
    ],
    "additional information": [
        "Progression to management positions, such as securities manager, is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Economic development officers (in 4163 Business development officers and marketing researchers and consultants",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4163&ver=16"
        },
        {
            "name": "Economists (in 4162 Economists and economic policy researchers and analysts",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4162&ver=16"
        },
        {
            "name": "Financial planners (in 1114 Other financial officers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1114&ver=16"
        },
        {
            "name": "Securities agents, investment dealers and brokers (1113)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1113&ver=16"
        }
    ]
}