{
    "id": "1113",
    "name": "Securities agents, investment dealers and brokers",
    "lead statement": "Securities agents and investment dealers buy and sell stocks, bonds, treasury bills, mutual funds and other securities for individual investors, pension fund managers, banks, trust companies, insurance firms and other establishments. Brokers buy and sell stocks, bonds, commodity futures, foreign currencies and other securities at stock exchanges on behalf of investment dealers. They are employed by investment companies, stock brokerage firms, stock and commodity exchanges and other establishments in the securities industry.",
    "example titles": [
        "annuity representative – investments",
        "arbitrager",
        "bond broker",
        "bond dealer",
        "bond trader",
        "broker",
        "commodity broker",
        "commodity trader",
        "discount broker",
        "equity trader",
        "financial broker",
        "floor trader – commodity exchange",
        "foreign exchange dealer",
        "foreign exchange trader",
        "futures trader",
        "grain broker",
        "grain broker – commodity trading",
        "grain trader",
        "independent floor trader",
        "investment broker",
        "investment dealer",
        "investment representative",
        "money market trader",
        "mutual fund broker",
        "mutual fund sales agent",
        "mutual fund sales representative",
        "options trader",
        "registered investment representative",
        "registered representatives supervisor",
        "securities agent",
        "securities representative",
        "securities sales agent",
        "securities salesman/woman",
        "securities trader",
        "stock exchange floor trader",
        "stockbroker",
        "stocks and bonds trader",
        "trust services salesman/woman"
    ],
    "main duties": [
        "Develop long-term relationships with their clients by preparing investment strategies to help them achieve their financial goals, offering advice and information on various investments to guide them in managing their portfolios",
        "Review financial periodicals, stock and bond reports, business publications and other material, and develop a network within the financial industry to gather relevant information and identify potential investments for clients",
        "Carry out investment orders by buying and selling stocks, bonds, treasury bills, mutual funds and other securities for individual investors, pension fund managers or companies such as banks, trust companies and insurance firms",
        "Monitor clients' investment portfolios and ensure that investment transactions are carried out according to industry regulations.",
        "Buy and sell stocks, bonds, commodity futures, foreign currencies and other securities at stock exchanges on behalf of investment dealers",
        "Develop trading strategies by reviewing investment information and monitoring market conditions from the exchange floor and through contact with trading departments of other investment firms, pension fund managers and investment company financial analysts",
        "Make bids and offers to buy and sell securities and complete details of sales on exchange trade tickets",
        "Prepare reviews of portfolios' positions."
    ],
    "employment requirements": [
        "A bachelor's or master's degree in economics, business or other discipline is usually required.",
        "Securities sales representatives and brokers require completion of industry investment and sales training programs and completion of the Canadian Securities course and the Registered Representative Manual Exam offered by the Canadian Securities Institute.",
        "Specialized courses are also available for securities sales representatives and brokers who want to trade in specific investment products such as securities options and futures contracts.",
        "Licensure by the provincial securities commission in the province of employment is required for securities agents, investment dealers and brokers."
    ],
    "additional information": [
        "Progression to related management positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Financial and investment analysts (1112)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1112&ver=16"
        },
        {
            "name": "Financial brokerage managers (in 0121 Insurance, real estate and financial brokerage managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0121&ver=16"
        },
        {
            "name": "Other financial officers (1114)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1114&ver=16"
        }
    ]
}