{
    "id": "1123",
    "name": "Professional occupations in advertising, marketing and public relations",
    "lead statement": "This unit group includes specialists in advertising, marketing and public relations who analyse, develop and implement communication and promotion strategies and information programs, analyse advertising needs and develop appropriate advertising and marketing plans, publicize activities and events, and maintain media relations on behalf of businesses, governments and other organizations, and for performers, athletes, writers and other talented individuals. They are employed by consulting firms, advertising agencies, corporations, associations, government, social agencies, museums, galleries, public interest groups, and cultural and other organizations, or they may be self-employed. Agents such as entertainment, literary and sports agents are included in this unit group.",
    "example titles": [
        "actor agent",
        "advertising account executive",
        "advertising account manager",
        "advertising and promotions co-ordinator",
        "advertising and promotions specialist",
        "advertising campaign organizer",
        "advertising consultant",
        "advertising specialist",
        "affiliated stations relations administrator",
        "art educator – museum",
        "artist agent",
        "artistic agent",
        "assistant brand manager – advertising",
        "assistant press secretary",
        "athlete agent",
        "athletes manager",
        "author's agent",
        "book publicist",
        "boxing promoter",
        "career agent",
        "casting agent",
        "casting agent for extras",
        "communication officer (except emergency services)",
        "communications adviser",
        "communications consultant",
        "communications expert",
        "communications specialist",
        "community information officer",
        "development officer – university",
        "entertainment agent",
        "event marketing specialist",
        "financing officer – fundraising",
        "fundraiser",
        "fundraising campaign consultant",
        "fundraising campaign organizer",
        "fundraising consultant",
        "fundraising organizer",
        "information consultant",
        "information co-ordinator",
        "information officer",
        "information service co-ordinator",
        "literary agent",
        "marketing consultant – advertising",
        "marketing co-ordinator",
        "marketing specialist – advertising",
        "media co-ordinator",
        "media events co-ordinator",
        "media relations co-ordinator",
        "media relations officer",
        "museum education officer",
        "museum educator",
        "musicians agent",
        "performers agent",
        "press agent",
        "press secretary",
        "product manager – marketing",
        "promotion strategies consultant",
        "public affairs officer",
        "public relations agent",
        "public relations consultant",
        "public relations co-ordinator",
        "public relations officer",
        "public relations practitioner",
        "public relations press agent",
        "public relations press secretary",
        "public relations representative",
        "public relations specialist",
        "publicist",
        "publicity agent",
        "publicity co-ordinator",
        "publicity information officer",
        "recreation association information officer",
        "sales and promotions co-ordinator",
        "singers agent",
        "social media community manager",
        "specialist – e-media advertising",
        "spokesperson",
        "sports agent",
        "stations-relations administrator",
        "student recruiter – post-secondary education",
        "talent agent",
        "talent representative",
        "theatrical agent",
        "theatrical business agent",
        "tourism information officer",
        "tourism information technician"
    ],
    "main duties": [
        "Assess characteristics of products or services to be promoted and advise on the advertising needs of an establishment",
        "Advise clients on advertising or sales promotion strategies",
        "Develop and implement advertising campaigns appropriate for print or electronic media",
        "Gather, research and prepare communications material for internal and external audiences",
        "Develop, implement and evaluate communications strategies and programs designed to inform clients, employees and the general public of initiatives and policies of businesses, governments and other organizations",
        "Conduct public opinion and attitude surveys to identify the interests and concerns of  key groups served by their organization",
        "Prepare or oversee preparation of reports, briefs, bibliographies, speeches, presentations, Web sites and press releases",
        "Develop and organize workshops, meetings, ceremonies and other events for publicity, fundraising and information purposes",
        "Prepare and deliver educational and publicity programs and informational materials to increase awareness of museums, galleries and other tourist attractions",
        "Initiate and maintain contact with the media",
        "Arrange interviews and news conferences",
        "Act as spokesperson for an organization and answer written and oral inquiries",
        "Co-ordinate special publicity events and promotions for internal and external audiences",
        "Assist in the preparation of brochures, reports, newsletters and other material",
        "Represent and act as an agent for talented individuals or individuals with specific occupational expertise",
        "Prepare or oversee preparation of sports, literary, performance or other contracts.",
        "Literary agents specialize in representing specific types of authors and writers. Performance agents specialize in representing singers, musicians, actors or other performers. Sports agents specialize in representing specific athletes or sports teams."
    ],
    "employment requirements": [
        "A university degree or college diploma in business marketing, public relations, communications, journalism, museology or a discipline related to a particular subject matter is usually required.",
        "Practitioners in public relations may require an APR (Accredited in Public Relations) designation."
    ],
    "additional information": [
        "Progression to managerial positions in public relations, communications and fundraising is possible with additional training and experience."
    ],
    "exclusions": [
        {
            "name": "Authors and writers (5121)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5121&ver=16"
        },
        {
            "name": "Conference and event planners (1226)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1226&ver=16"
        },
        {
            "name": "Marketing consultants (in 4163 Business development officers and marketing researchers and consultants",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4163&ver=16"
        },
        {
            "name": "Public relations managers (in 0124 Advertising, marketing and public relations managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0124&ver=16"
        }
    ]
}