{
    "id": "1226",
    "name": "Conference and event planners",
    "lead statement": "Conference and event planners plan, organize and co-ordinate conferences, conventions, meetings, seminars, exhibitions, trade shows, festivals and other events. They are employed by tourism associations, trade and professional associations, convention and conference centres, governments and by conference and event planning companies, or they may be self-employed.",
    "example titles": [
        "conference and meeting planner",
        "conference co-ordinator",
        "conference organizer",
        "conference planner",
        "conference services officer",
        "convention and special events planner",
        "convention co-ordinator",
        "convention planner",
        "convention planning services officer",
        "event co-ordinator",
        "event planner",
        "exhibition co-ordinator",
        "festival organizer",
        "meeting co-ordinator",
        "meeting planner",
        "social events co-ordinator",
        "special events co-ordinator",
        "special events organizer",
        "special events planner",
        "special events program planner",
        "trade show organizer",
        "trade show planner"
    ],
    "main duties": [
        "Meet with trade and professional associations and other groups to promote and discuss conference, convention and trade show services",
        "Meet with sponsors and organizing committees to plan scope and format of events, to establish and monitor budgets and to review administrative procedures and progress of events",
        "Co-ordinate services for events, such as accommodation and transportation for participants, conference and other facilities, catering, signage, displays, translation, special needs requirements, audio-visual equipment, printing and security",
        "Organize registration of participants, prepare programs and promotional material, and publicize events",
        "Plan entertainment and social gatherings for participants",
        "Hire, train and supervise support staff required for events",
        "Ensure compliance with required by-laws",
        "Negotiate contracts for services, approve suppliers' invoices, maintain financial records, review final billing submitted to clients for events and prepare reports."
    ],
    "employment requirements": [
        "A university degree or college diploma in business, tourism or hospitality administration is usually required.",
        "Several years of experience in hospitality or tourism administration or in public relations are usually required and may substitute for formal education requirements.",
        "Certification relating to special events, meetings or conference management may be required."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Administrative officers (1221)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1221&ver=16"
        },
        {
            "name": "Executive assistants (1222)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1222&ver=16"
        },
        {
            "name": "Professional occupations in advertising, marketing and public relations (1123)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1123&ver=16"
        },
        {
            "name": "Sales and account representatives - wholesale trade (non-technical) (6411)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6411&ver=16"
        }
    ]
}