{
    "id": "1313",
    "name": "Insurance underwriters",
    "lead statement": "Insurance underwriters review and evaluate insurance applications to determine insurance risks, insurance premiums and extent of insurance coverage according to company policies. Insurance underwriters are employed at head and branch offices of insurance companies.",
    "example titles": [
        "accident and sickness underwriter – insurance",
        "assistant underwriter – insurance",
        "automobile and home insurance consultant",
        "automobile underwriter – insurance",
        "boiler and machinery underwriter – insurance",
        "casualty insurance products analyst-designer",
        "casualty underwriter – insurance",
        "commercial underwriter – insurance",
        "farm underwriter – insurance",
        "fire underwriter – insurance",
        "group underwriter",
        "group underwriter – insurance",
        "head office underwriter – insurance",
        "home office underwriter – insurance",
        "insurance rating analyst",
        "insurance underwriter",
        "junior underwriter – insurance",
        "liability underwriter",
        "life underwriter",
        "marine and aircraft underwriter – insurance",
        "marine underwriter – insurance",
        "package underwriter – insurance",
        "personal lines underwriter",
        "property underwriter",
        "property underwriter – insurance",
        "public liability underwriter – insurance",
        "reinsurance underwriter – insurance",
        "senior underwriter – insurance",
        "surety underwriter – insurance",
        "underwriter – insurance"
    ],
    "main duties": [
        "Review individual and group applications for automobile, fire, health, liability, life, property, marine, aircraft and other insurance",
        "Evaluate new and renewal applications to determine insurance risks, insurance premiums, extent of insurance coverage and other conditions of the insurance contract using medical reports, rate tables and other documents and reference materials; adjust premiums, coverage or risk itself to make acceptance of new and renewal applications possible",
        "Approve sale of insurance policies and ensure compliance with government regulations",
        "Provide recommendations on individual or group insurance plan designs",
        "Provide underwriting advice and answer inquiries from clients and from insurance agents, consultants and other company personnel",
        "Prepare underwriting reports and update insurance forms when necessary."
    ],
    "employment requirements": [
        "Completion of secondary school and some general insurance experience \r\n or a bachelor's degree, college diploma or some post-secondary education is required.",
        "Several years of on-the-job training and completion of insurance industry underwriting courses and training programs are required."
    ],
    "additional information": [
        "Progression to management positions in the insurance industry is possible with experience.",
        "Completion of educational programs through the Insurance Institute of Canada or its provincial counterparts entitles insurance underwriters to professional recognition as a Chartered Insurance Professional (CIP) and, with additional university courses, as a Fellow, Chartered Insurance Professional (FCIP)."
    ],
    "exclusions": [
        {
            "name": "Insurance agents and brokers (6231)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6231&ver=16"
        },
        {
            "name": "Insurance managers (in 0121 Insurance, real estate and financial brokerage managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0121&ver=16"
        }
    ]
}