{
    "id": "1452",
    "name": "Correspondence, publication and regulatory clerks",
    "lead statement": "Clerks in this unit group write correspondence, proofread material for accuracy, compile material for publication, verify, record and process forms and documents, such as applications, licences, permits, contracts, registrations and requisitions, and perform other related clerical duties in accordance with established procedures, guidelines and schedules. They are employed by newspapers, periodicals, publishing firms and by establishments throughout the private and public sectors.",
    "example titles": [
        "administrative contract clerk",
        "advertising assistant",
        "advertising clerk",
        "advertising space measurer",
        "application clerk",
        "archives clerk",
        "authorization clerk",
        "brand recorder",
        "business documentalist",
        "by-law clerk",
        "catalogue compiler",
        "classified advertising clerk",
        "clipping marker",
        "compiler",
        "composing room proofreader",
        "construction permits clerk",
        "contract clerk",
        "copy holder",
        "copyright clerk",
        "correspondence clerk",
        "correspondence review clerk",
        "customs and excise clerk",
        "customs clerk",
        "directory clerk",
        "directory compiler",
        "documentalist",
        "documentation clerk",
        "editing clerk",
        "editorial assistant",
        "editorial clerk",
        "engineering clerk",
        "export documentation clerk",
        "exports clerk",
        "fingerprint clerk",
        "forms control clerk",
        "import clerk",
        "import documentation clerk",
        "land registry clerk",
        "licence clerk",
        "mailing list compiler",
        "manuscript proofreader",
        "motor vehicle bureau clerk",
        "newspaper circulation clerk",
        "passport clerk",
        "passport issuer",
        "permit clerk",
        "photograph examiner",
        "press clipper",
        "press reader",
        "proofreader",
        "proofreader copy-reader",
        "publication clerk",
        "publishing clerk",
        "reader",
        "registrar clerk",
        "registration clerk",
        "registry clerk",
        "tests clerk",
        "translation clerk"
    ],
    "main duties": [
        "Receive customers' orders for classified advertising, write and edit copy, calculate advertising costs and bill customers.",
        "Write business and government correspondence such as replies to requests for information and assistance, damage claims, credit and billing enquiries and service complaints.",
        "Assist in the preparation of periodicals, advertisements, catalogues, directories and other material for publication; proofread material; verify facts and conduct research.",
        "Read material prior to publication to detect and mark for correction any grammatical, typographical or compositional errors within tight deadlines.",
        "Read newspapers, magazines, press releases and other publications to locate and file articles of interest to staff and clients.",
        "Compile, verify, record and process applications, licences, permits, contracts, registrations, requisitions and other forms and documents in accordance with established procedures using processing systems; and authorize and issue licences, permits, registration papers, reimbursements and other material after requested documents have been processed and approved."
    ],
    "employment requirements": [
        "Completion of secondary school is required.",
        "Additional courses or a diploma in writing, journalism or a related field may be required.",
        "Previous clerical or administrative experience may be required."
    ],
    "additional information": [
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Professional occupations in advertising, marketing and public relations (1123)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1123&ver=16"
        },
        {
            "name": "Supervisors, library, correspondence and related information workers (1213)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1213&ver=16"
        }
    ]
}