{
    "id": "2113",
    "name": "Geoscientists and oceanographers",
    "lead statement": "Geoscientists include geologists, geochemists and geophysicists who conduct programs of exploration and research to extend knowledge of the structure, composition and processes of the earth, to locate, identify and extract hydrocarbon, mineral and groundwater resources and to assess and mitigate the effects of development and waste disposal projects on the environment. Oceanographers conduct programs of exploration and research on ocean processes and phenomena, biological, chemical and physical characteristics of oceans, interactions with atmospheric and geological environments and impacts of human activity on oceans and marine ecosystems. Geoscientists are employed by petroleum and mining companies, consulting geology, geophysics and engineering firms and by governments and educational institutions, or they may be self-employed. Oceanographers are employed by governments, educational institutions and private companies engaged in exploration of seafloor deposits and seafarming areas, or they may be self-employed.",
    "example titles": [
        "biological oceanographer",
        "biostratigrapher",
        "chemical oceanographer",
        "coal geologist",
        "consulting geologist",
        "consulting geophysicist",
        "development geologist",
        "environmental geologist",
        "exploration geologist",
        "exploration geophysicist",
        "fisheries oceanographer",
        "geochemist",
        "geodesist",
        "geological oceanographer",
        "geologist",
        "geomorphologist",
        "geophysicist",
        "glaciologist",
        "groundwater geologist",
        "hydrogeologist",
        "hydrographic surveyor – geology",
        "hydrologist",
        "ice specialist – oceanography",
        "marine geologist",
        "marine geophysicist",
        "micropaleontologist",
        "mine geologist",
        "mineralogist",
        "mining geologist",
        "oceanographer",
        "oil geologist",
        "paleobotanist",
        "paleoecologist",
        "paleontologist",
        "palynologist",
        "petrographer",
        "petroleum geologist",
        "petrologist",
        "petrophysicist",
        "photogeologist",
        "physical oceanographer",
        "placer geologist",
        "prospecting geologist",
        "quaternarist",
        "quaternary scientist",
        "quaternary specialist",
        "remote sensing geologist",
        "sedimentary geologist",
        "sedimentologist",
        "seismologist",
        "stratigrapher",
        "structural geologist",
        "volcanologist",
        "wellsite co-ordinator – geology"
    ],
    "main duties": [
        "Conduct theoretical and applied research to extend knowledge of surface and subsurface features of the earth, its history and the operation of physical, chemical and biological systems that control its evolution",
        "Plan, direct and participate in geological, geochemical and geophysical field studies, drilling and geological testing programs",
        "Plan and conduct seismic, geodetic, electromagnetic, magnetic, gravimetric, radiometric, radar and other remote sensing programs",
        "Plan, direct and participate in analyses of geological, geochemical and geophysical survey data, well logs and other test results, maps, notes and cross sections",
        "Develop models and applied software for the analysis and interpretation of data",
        "Plan and conduct analytical studies of core samples, drill cuttings and rock samples to identify chemical, mineral, hydrocarbon and biological composition and to assess depositional environments and geological age",
        "Assess the size, orientation and composition of mineral ore bodies and hydrocarbon deposits",
        "Identify deposits of construction materials and determine their characteristics and suitability for use as concrete aggregates, road fill or for other applications",
        "Conduct geological and geophysical studies for regional development and advise in areas such as site selection, waste management and restoration of contaminated sites",
        "Recommend the acquisition of lands, exploration and mapping programs and mine development",
        "Identify and advise on anticipated natural risks such as slope erosion, landslides, soil instability, subsidence, earthquakes and volcanic eruptions",
        "May supervise and co-ordinate well drilling, completion and work-overs and mining activities.",
        "Geologists may specialize in fields such as coal geology, environmental geology, geochronology, hydrogeology, mineral deposits or mining, petroleum geology, stratigraphy, tectonics, volcanology or in other fields.",
        "Geochemists may specialize in analytical geochemistry, hydrogeochemistry, mineral or petroleum geochemistry or in other fields.",
        "Geophysicists may specialize in areas, such as petroleum geology, earth physics, geodesy, geoelectromagnetism, seismology or in other fields.",
        "Conduct theoretical and applied oceanographic research programs and expeditions to extend knowledge of the physical, chemical and biological properties and functioning of oceans",
        "Plan, direct and participate in sampling and analysis of seawater, plankton, fish, sediments and rocks",
        "Study physical properties of oceans to develop models, charts and computer simulations of ocean conditions, such as tides, waves, currents and sediment transport",
        "Explore ocean floor and submarine geological structures, conduct seismic surveys and study formation of ocean basins and other structures to map ocean floor, coastal erosion, sediment accumulation and areas for offshore oil and gas exploration",
        "Plan and conduct investigations on ocean chemical properties and processes, ocean floor and marine atmosphere and undersea volcanoes to study impacts of environmental changes",
        "Study marine life and interaction with physical and chemical environments to assess impacts of pollutants on marine ecology and to develop ecologically-based methods of seafarming.",
        "Oceanographers may specialize in biological, chemical, geological or physical oceanography, or in other fields related to the study of oceans."
    ],
    "employment requirements": [
        "Geoscientists require a university degree in geology, geochemistry, geophysics or a related discipline.",
        "A master's or doctoral degree in geophysics, physics, mathematics or engineering may be required for employment as a geophysicist.",
        "Registration with a provincial or territorial association of professional engineers, geologists, geophysicists or geoscientists is usually required for employment and is mandatory to practice in all provinces and territories except Prince Edward Island and the Yukon.",
        "Geologists and geophysicists are eligible for registration following graduation from an accredited educational program and after several years of supervised work experience and, in some provinces, after passing a professional practice examination.",
        "Oceanographers require a university degree in science, mathematics, statistics or engineering and usually require a graduate degree in oceanography."
    ],
    "additional information": [
        "Mobility between specializations in this group is possible with experience.",
        "Progression to supervisory or higher level positions is possible with experience in this unit group.",
        "Advancement to management positions in mining, petroleum and other industries is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Architecture and science managers (0212)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0212&ver=16"
        },
        {
            "name": "Biologists and related scientists (2121)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2121&ver=16"
        },
        {
            "name": "Chemists (2112)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2112&ver=16"
        },
        {
            "name": "Geological engineers (2144)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2144&ver=16"
        },
        {
            "name": "Managers in natural resources production and fishing (0811)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0811&ver=16"
        },
        {
            "name": "Physicists and astronomers (2111)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2111&ver=16"
        }
    ]
}