{
    "id": "2153",
    "name": "Urban and land use planners",
    "lead statement": "Urban and land use planners develop plans and recommend policies for managing land use, physical facilities and associated services for urban and rural areas and remote regions. They are employed by all levels of government, land developers, engineering and other consulting companies, or may work as private consultants.",
    "example titles": [
        "city planner",
        "city planner – land use",
        "community and urban planner",
        "community planner",
        "community recreation planner",
        "environmental planner",
        "heritage planner – land use",
        "heritage work planner",
        "land use planner",
        "land use specialist",
        "long-range planner – land use",
        "mass transit services analyst",
        "municipal park planner",
        "municipal planner",
        "neighbourhood planner",
        "park planner",
        "planner",
        "planning analyst – land use",
        "recreation planner",
        "regional planner",
        "senior planner – land use",
        "site planner",
        "town planner",
        "transportation planner",
        "transportation route planning analyst",
        "urban and regional planner",
        "urban planner",
        "urban renovation planner",
        "zoning officer – land use"
    ],
    "main duties": [
        "Compile and analyze data on demographic, economic, legal, political, cultural, sociological, physical and other factors affecting land use",
        "Confer with municipal, provincial and federal authorities, civic leaders, social scientists, lawyers, land developers, the public and special interest groups to formulate and develop land use or community plans",
        "Prepare and recommend land development concepts and plans for zoning, subdivisions, transportation, public utilities, community facilities, parks, agricultural and other land uses",
        "Prepare plans for environmental protection, such as wildlife preserves, national and provincial parks, and protection of watersheds",
        "Present plans to civic, rural and regional authorities and hold public meetings to present plans, proposals or planning studies to the general public and special interest groups",
        "Review and evaluate proposals for land use and development plans and prepare recommendations",
        "Process application for land development permits and administer land use plans and zoning by-laws",
        "Formulate long-range objectives and policies relative to future land use and the protection of the environment",
        "Supervise and co-ordinate work of urban planning technicians and technologists."
    ],
    "employment requirements": [
        "A bachelor's degree in urban and regional planning, geography, architecture, engineering or a related discipline is required.",
        "A master's degree in one of these disciplines may be required.",
        "Membership in the Canadian Institute of Planners is usually required.",
        "Urban and land use planners are regulated in Nova Scotia, New Brunswick, Quebec, Alberta, the Northwest Territories and Nunavut, and membership in a provincial planning institute may be required in other provinces.",
        "Leadership in Energy and Environmental Design (LEED) certification is offered by the Canada Green Building Council and may be required by some employers."
    ],
    "additional information": [
        "Progression to management positions in planning is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Architects (2151)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2151&ver=16"
        },
        {
            "name": "Architecture and science managers (0212)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0212&ver=16"
        },
        {
            "name": "Engineering managers (0211)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0211&ver=16"
        },
        {
            "name": "Land surveyors (2154)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2154&ver=16"
        }
    ]
}