{
    "id": "2161",
    "name": "Mathematicians, statisticians and actuaries",
    "lead statement": "Mathematicians and statisticians research mathematical or statistical theories, and develop and apply mathematical or statistical techniques for solving problems in such fields as science, engineering, business and social science. Actuaries apply mathematics, statistics, probability and risk theory to assess potential financial impacts of future events. Mathematicians, statisticians and actuaries are employed by universities, governments, bank and trust companies, insurance companies, pension benefit consulting firms, professional associations, and science and engineering consulting firms.",
    "example titles": [
        "actuarial analyst",
        "actuarial assistant",
        "actuary",
        "analysis supervisor – statistics",
        "applied mathematician",
        "applied statistician",
        "associate actuary",
        "biological and agricultural science statistician",
        "biometrician",
        "biostatistician",
        "business and economics statistician",
        "casualty actuary",
        "chemistry statistician",
        "cipher expert",
        "consulting actuary",
        "consulting pension actuary",
        "cryptanalyst",
        "cryptoanalyst",
        "cryptographer",
        "demographer",
        "education statistician",
        "environmental epidemiologist",
        "epidemiologist (except physician and veterinarian)",
        "financial statistician",
        "industrial statistician",
        "insurance actuary",
        "life actuary",
        "mathematical statistician",
        "mathematician",
        "medical statistician",
        "operations research analyst",
        "operations researcher",
        "opinion polling statistician",
        "physical science and engineering statistician",
        "public health statistician",
        "research mathematician",
        "sales statistician",
        "senior actuarial analyst",
        "social science statistician",
        "statistical analysis supervisor",
        "statistical analyst",
        "statistical consultant",
        "statistical methodologist",
        "statistician",
        "survey statistician",
        "vital statistician"
    ],
    "main duties": [
        {
            "duty_name": "Mathematicians",
            "duty_description": [
                "Conduct research to extend mathematical knowledge in traditional areas of mathematics such as algebra, geometry, probability and logic",
                "Apply mathematical techniques to the solution of problems in scientific fields such as physical science, engineering, computer science or other fields such as operations research, business or management."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Statisticians",
            "duty_description": [
                "Conduct research into the mathematical basis of the science of statistics",
                "Develop statistical methodology and advise on the practical application of statistical methodology",
                "Apply statistical theory and methods to provide information in scientific and other fields such as biological and agricultural science, business and economics, physical sciences and engineering, and the social sciences."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Actuaries",
            "duty_description": [
                "Apply mathematical models to forecast and calculate the probable future costs of insurance and pension benefits",
                "Design life, health, and property insurance policies, and calculate premiums, contributions and benefits for insurance policies, and pension and superannuation plans",
                "May assist investment fund managers in portfolio asset allocation decisions and risk management. They also use these techniques to provide legal evidence on the value of future earnings."
            ],
            "duty_comment": null
        }
    ],
    "employment requirements": [
        "Mathematicians and statisticians usually require a graduate degree in mathematics or statistics.",
        "Actuaries usually require post-secondary education in actuarial science, mathematics, statistics, economics, commerce or business administration.",
        "Actuaries are conferred fellowships through the Canadian Institute of Actuaries upon successful completion of professional examinations \r\n and three years of work experience in the actuarial field as an actuarial assistant or in a related position."
    ],
    "additional information": [
        "With experience, actuaries may progress to managerial positions in consulting, insurance and finance. They may also be self-employed."
    ],
    "exclusions": [
        {
            "name": "Financial and investment analysts (1112)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1112&ver=16"
        },
        {
            "name": "Financial auditors and accountants (1111)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1111&ver=16"
        },
        {
            "name": "Financial managers (0111)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0111&ver=16"
        },
        {
            "name": "Insurance, real estate and financial brokerage managers (0121)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0121&ver=16"
        },
        {
            "name": "Other financial officers (1114)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1114&ver=16"
        },
        {
            "name": "Statistical officers and related research support occupations (1254)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1254&ver=16"
        }
    ]
}