{
    "id": "2233",
    "name": "Industrial engineering and manufacturing technologists and technicians",
    "lead statement": "Industrial engineering and manufacturing technologists and technicians may work independently or provide technical support and services in the development of production methods, facilities and systems, and the planning, estimating, measuring and scheduling of work. They are employed by manufacturing and insurance companies, government departments, and establishments in other industries.",
    "example titles": [
        "3D computer numerical control (CNC) programmer",
        "computer numerical control (CNC) Mastercam programmer",
        "computer numerical control (CNC) programmer",
        "computer numerically controlled (CNC) technologist",
        "computer numerically controlled coordinate measuring machine (CNC/CMM) programmer",
        "computer-aided design/computer-aided manufacturing, numerical control (CAD/CAM NC) programmer",
        "computer-assisted design/computer-assisted manufacturing (CAD/CAM) programmer",
        "fabric design technologist",
        "fire protection technician – manufacturing",
        "industrial engineering analyst",
        "industrial engineering technician",
        "industrial engineering technologist",
        "injection moulding technician",
        "inventory control technician",
        "loss prevention technologist – manufacturing",
        "manufacturing cost estimator",
        "manufacturing technician",
        "manufacturing technician – industrial engineering",
        "manufacturing technologist",
        "materials handling technician",
        "methods designer",
        "numerical control (NC) programmer",
        "numerically controlled machine tool programmer (except operators)",
        "numerically controlled tool programmer",
        "operations research technologist",
        "planning technician",
        "plant layout technician",
        "plastics manufacturing technician",
        "plastics moulding technician",
        "plastics technician",
        "production and quality control technologist",
        "production control technologist",
        "production planning technician",
        "production technologist – sawmill",
        "pulp and paper manufacturing technologist",
        "pulp and paper technician",
        "pulp and paper technologist",
        "quality assurance technologist",
        "quality control technician (except chemical)",
        "quality control technologist – industrial engineering",
        "quality control technologist (except chemical)",
        "scheduling technician – manufacturing",
        "textile technician",
        "textile technologist",
        "time study analyst",
        "time study technologist",
        "tool programming technologist"
    ],
    "main duties": [
        {
            "duty_name": "Industrial engineering and manufacturing technologists",
            "duty_description": [],
            "duty_comment": null
        },
        {
            "duty_name": "Industrial engineering and manufacturing technicians",
            "duty_description": [
                "Assist in the design of plant layouts",
                "Conduct work measurement or other studies",
                "Collect and compile operational or experimental data and assist in the development of estimates, schedules, specifications and reports",
                "Collect and analyze data and samples in support of quality assurance and industrial health and safety programs",
                "Develop manufacturing and processing procedures and variables, set machine or equipment controls, oversee production and inspect processes."
            ],
            "duty_comment": "Technologists and technicians in this unit group may specialize in the development of production processes, quality assurance programs, plans and schedules in a particular industrial area such as metal fabrication, plastics, pulp and paper, or textile manufacturing."
        }
    ],
    "employment requirements": [
        "Completion of a two- or three-year college program or equivalent in industrial engineering technology, pulp and paper technology, plastics technology, textile technology, manufacturing technology or a related discipline is usually required for industrial engineering or manufacturing technologists.",
        "Completion of a one- or two-year college program in industrial engineering technology or in a related discipline is usually required for industrial engineering or manufacturing technicians.",
        "Certification in industrial engineering or manufacturing technology or in a related field is available through provincial or territorial associations of engineering/applied science technologists and technicians and may be required for some positions.",
        "A period of supervised work experience, usually two years, is required before certification.",
        "A college diploma in manufacturing technology and/or trade certification and experience in machining and tooling or metalworking is required for CAD-CAM/CNC programmers.",
        "In Quebec, membership in the regulatory body is required to use the title \"Professional Technologist.\""
    ],
    "additional information": [
        "There is mobility to related fields such as technical sales.",
        "Progression to managerial positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Technical sales specialists - wholesale trade (6221)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6221&ver=16"
        },
        {
            "name": "Textile technologists/technicians working in support of chemical dyeing and finishing and quality control technologists/technicians in food or chemical industries or laboratories (in 2211 Chemical technologists and technicians",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2211&ver=16"
        }
    ]
}