{
    "id": "2244",
    "name": "Aircraft instrument, electrical and avionics mechanics, technicians and inspectors",
    "lead statement": "This unit group includes mechanics and technicians who install, adjust, repair and overhaul aircraft instrument, electrical or avionics systems on aircraft. This unit group also includes avionics inspectors who inspect instrument, electrical and avionics systems following assembly, modification, repair or overhaul. Workers in this unit group are employed by aircraft manufacturing, maintenance, repair and overhaul establishments and by airlines and other aircraft operators.",
    "example titles": [
        "aircraft and missile electrotechnician – avionics",
        "aircraft avionics technician",
        "aircraft electrical equipment inspector and tester",
        "aircraft electrical inspector",
        "aircraft electrical mechanic",
        "aircraft electrical system mechanic",
        "aircraft electrical technician",
        "aircraft electrician",
        "aircraft electronic components technician",
        "aircraft electronic equipment inspector and tester",
        "aircraft electronic equipment installer",
        "aircraft electronic system mechanic",
        "aircraft electronics inspector",
        "aircraft instrument inspector",
        "aircraft instrument mechanic",
        "aircraft instrument technician",
        "aircraft maintenance engineer (AME) – avionics",
        "apprentice avionics technician",
        "aviation electrical components technician",
        "aviation electronic components technician",
        "aviation instrument technician",
        "avionics and electronics calibration specialist",
        "avionics inspector",
        "avionics maintenance technician",
        "avionics mechanic",
        "avionics systems installer",
        "avionics technician",
        "certified avionics technician",
        "communications equipment repairer – avionics",
        "electrical accessories shop inspector – avionics",
        "electrical and electronics technician – avionics",
        "electronic accessories repair and overhaul mechanic – avionics",
        "electronics mechanic – avionics",
        "electrotechnician – avionics",
        "instrument inspector and tester – avionics",
        "instrument mechanic – avionics",
        "instrument overhaul and repair mechanic – avionics",
        "instrument overhaul technician – avionics",
        "instrument shop inspector – avionics",
        "instruments and accessories inspector – avionics",
        "missile electronics inspector",
        "missile electrotechnician – avionics",
        "precision instrument technician – avionics",
        "radio and electronic overhaul and repair mechanic – avionics",
        "radio and radar equipment inspector – avionics",
        "radio and radar equipment installer – avionics",
        "radio communication equipment repairer – avionics",
        "radio communication equipment repairman/woman – avionics",
        "rocket components mechanic – avionics",
        "shop inspector – avionics"
    ],
    "main duties": [
        "Repair and overhaul, install, calibrate and test aircraft instruments.",
        "Repair and overhaul, modify, install and test aircraft electrical systems and equipment.",
        "Troubleshoot, repair and overhaul, test, modify, install and inspect aircraft electronic systems and components including communications, navigation, and autoflight equipment.",
        "Inspect and test aircraft instrument, electrical and avionics systems and ensure that the installation, maintenance, repair and overhaul of these systems meet Transport Canada and company standards of performance and safety.",
        "Aircraft mechanics and technicians who work in repair and overhaul shops service and test electrical, electronic and instrument components.",
        "Avionics mechanics and technicians who work in maintenance hangars troubleshoot, repair, install and inspect aircraft systems and components."
    ],
    "employment requirements": [
        "Aircraft instrument and avionics mechanics and technicians require completion of a two- to three-year college program in avionics or electronics.",
        "Aircraft electrical mechanics and technicians require completion of a college program as an electrical or electronic technician.",
        "Four years of on-the-job or company apprenticeship training is required for all mechanics and technicians in this unit group.",
        "Avionics inspectors require completion of a two- to three-year college program in avionics or electronics \r\n and three to five years of experience as an avionics mechanic or technician.",
        "Avionics inspectors, mechanics and technicians who sign maintenance releases and certify airworthiness require an Aircraft Maintenance Engineer's (AME) licence (category E – avionics) issued by Transport Canada.",
        "Industry certification is available from the Canadian Council for Aviation & Aerospace (CCAA) for some occupations in this unit group.",
        "In Quebec, membership in the regulatory body for professional technologists is required to use the title \"Professional Technologist.\""
    ],
    "additional information": [
        "Avionics inspectors, maintenance technicians and mechanics may acquire further endorsements to their AME licence allowing them to inspect and certify a broader range of aircraft and avionics systems.",
        "An AME licence can be obtained by fulfilling the education and training requirements as stated above and passing Transport Canada AME examinations.",
        "Progression to supervisory positions within specific areas of expertise is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Aircraft assemblers and aircraft assembly inspectors (9521)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9521&ver=16"
        },
        {
            "name": "Aircraft mechanics and maintenance engineers who maintain and inspect aircraft structures, mechanical, hydraulic or propulsion systems (in 7315 Aircraft mechanics and aircraft inspectors",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7315&ver=16"
        },
        {
            "name": "Airworthiness inspectors (in 2262 Engineering inspectors and regulatory officers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2262&ver=16"
        },
        {
            "name": "Electrical mechanics (7333)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7333&ver=16"
        },
        {
            "name": "Industrial instrument technicians and mechanics (2243)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2243&ver=16"
        }
    ]
}