{
    "id": "3143",
    "name": "Occupational therapists",
    "lead statement": "Occupational therapists develop individual and group programs with people affected by illness, injury, developmental disorders, emotional or psychological problems and aging to maintain, restore or increase their ability to care for themselves and to engage in work, school or leisure. They also develop and implement health promotion programs with individuals, community groups and employers. They are employed in health care facilities, in schools, and by private and social services agencies, or they may be self-employed.",
    "example titles": [
        "case manager occupational therapist",
        "clinical occupational therapist",
        "clinical occupational therapy specialist",
        "community occupational therapist",
        "community practice occupational therapist",
        "home care occupational therapist",
        "occupational therapist (OT)",
        "occupational therapist vocational evaluator",
        "occupational therapy rehabilitation consultant",
        "research and development occupational therapist",
        "research occupational therapist",
        "vocational evaluator occupational therapist"
    ],
    "main duties": [
        "Analyse clients' capabilities and expectations related to life activities through observation, interviews and formal assessments",
        "Develop intervention programs to address clients' needs related to self-care, work and leisure activities",
        "Maintain clients' records",
        "Establish personalized care plans working as a member of an interdisciplinary team",
        "Consult and advise on health promotion programs to prevent disabilities and to maximize independent function in all activities of life",
        "May supervise support personnel and students and provide training.",
        "Occupational therapists may specialize in working with specific populations such as children or adults, or persons with distinct problems such as dementia, traumatic brain injury and chronic pain, or provide special interventions such as return-to-work programs."
    ],
    "employment requirements": [
        "A university degree in occupational therapy including supervised fieldwork is required.",
        "Completion of a national or provincial certification examination is required.",
        "Licensure with a regulatory body is required in all provinces and territories.",
        "Membership in the national association, Canadian Association of Occupational Therapists, is required in some provinces.",
        "Occupational therapists may obtain expertise in a particular area through additional training or experience."
    ],
    "additional information": [
        "Occupational therapists may progress to management or administrative positions through further training and experience."
    ],
    "exclusions": [
        {
            "name": "Directors of occupational therapy (in 0311 Managers in health care",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0311&ver=16"
        },
        {
            "name": "Orientation and mobility instructors (in 4215 Instructors of persons with disabilities",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4215&ver=16"
        }
    ]
}