{
    "id": "3213",
    "name": "Animal health technologists and veterinary technicians",
    "lead statement": "Animal health technologists and veterinary technicians provide technical support to veterinarians by caring for animals and assisting in the diagnosis and treatment of animal health disorders. They are employed in veterinary clinics, animal hospitals, animal shelters, humane societies, zoos, animal research laboratories, pharmaceutical companies and government. Animal health technologists and veterinary technicians who are supervisors are included in this unit group.",
    "example titles": [
        "animal care technician",
        "animal care technologist",
        "animal health technician",
        "animal health technician – agriculture",
        "animal health technologist",
        "animal health technologist supervisor",
        "animal operating room attendant",
        "laboratory animal technician",
        "laboratory animal technologist",
        "registered animal health technologist (RAHT)",
        "registered veterinary technician (RVT)",
        "veterinarian assistant",
        "veterinary laboratory technician",
        "veterinary technician",
        "veterinary technician supervisor",
        "veterinary technologist"
    ],
    "main duties": [
        "Provide nursing care and rehabilitation therapy for animals",
        "Handle, restrain and care for animals undergoing treatment and surgery",
        "Produce radiographs, collect and analyse samples and perform other laboratory tests to assist in diagnosis of animal health problems",
        "Assist veterinarian with animals before, during and following surgery by preparing surgical equipment, administering and monitoring anaesthetics and cleaning up after surgery",
        "Prepare and administer medications and vaccines under direction of a veterinarian",
        "Administer treatments as prescribed by a veterinarian",
        "Provide wound and bandage care",
        "Conduct specialized procedures such as animal identification and hoof trimming",
        "Educate and advise clients on animal health care including nutrition and home care",
        "Assist in laboratory research",
        "Perform routine animal dental procedures and assist veterinarians with animal dentistry",
        "May perform a variety of office management and clerical duties."
    ],
    "employment requirements": [
        "Completion of a two- or three-year animal health/veterinary technology college program is required.",
        "Successful completion of a national registration examination may be required in some employment settings.",
        "Registration with provincial animal health technologists' or veterinary technicians' associations is available, and is mandatory in some provinces."
    ],
    "additional information": [
        "With experience, animal health technologists and veterinary technicians may progress to supervisory positions."
    ],
    "exclusions": [
        {
            "name": "Pet groomers and animal care workers (6563)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6563&ver=16"
        }
    ]
}