{
    "id": "3216",
    "name": "Medical sonographers",
    "lead statement": "Medical sonographers operate ultrasound equipment to produce and record images of various parts of the body to aid physicians in monitoring pregnancies and in diagnosing cardiac, ophthalmic, vascular and other medical disorders. They are employed in clinics and hospitals. Medical sonographers who are supervisors or instructors are included in this unit group.",
    "example titles": [
        "adult echocardiographer",
        "cardiac sonographer",
        "cardiac ultrasound technician",
        "cardiac ultrasound technologist",
        "chief diagnostic medical sonographer",
        "diagnostic cardiac sonographer",
        "diagnostic echography technician",
        "diagnostic medical sonographer",
        "diagnostic medical sonography instructor",
        "diagnostic ultrasonography technician",
        "diagnostic ultrasound supervisor",
        "diagnostic ultrasound technician",
        "diagnostic ultrasound technologist – medical",
        "echocardiographer",
        "echocardiography technician",
        "echocardiography technologist",
        "echocardiography technologist sonographer",
        "echography technician",
        "echography technologist",
        "medical sonographer",
        "medical sonographers supervisor",
        "pediatric echocardiographer",
        "registered diagnostic cardiac sonographer",
        "registered diagnostic medical sonographer (RDMS)",
        "registered ultrasound technologist",
        "sonographer – medical",
        "sonography technologist",
        "student medical sonographer",
        "student sonographer – medical",
        "ultrasonographer – medical",
        "ultrasonography technician",
        "ultrasonography technologist",
        "ultrasound supervisor",
        "ultrasound technician",
        "ultrasound technologist",
        "vascular sonographer"
    ],
    "main duties": [
        "Operate ultrasound imaging equipment that transmits high frequency sound pulses through the body to produce images of those parts of the body requiring examination",
        "Monitor examination by viewing images on video screen, to evaluate quality and consistency of diagnostic images, and make adjustments to equipment, as required",
        "Record, store and process scanned images by using camera unit connected to ultrasound equipment",
        "Observe and care for patients throughout examinations to ensure patient safety and comfort",
        "Prepare examination reports for physicians to aid in the monitoring of pregnancies and the diagnosis of cardiac, abdominal, ophthalmic, vascular and other disorders",
        "Perform quality control checks on ultrasound equipment to ensure proper operation and perform minor repairs and adjustments as required",
        "May supervise and train students and other medical sonographers.",
        "Medical sonographers may specialize in abdominal, cardiac, cerebral, obstetrical and gynaecological, ophthalmic, intraluminal or peripheral vascular sonography. They may also specialize in adult or pediatric echocardiography or neurosonology."
    ],
    "employment requirements": [
        "Completion of a three- to four-year program in diagnostic medical sonography or ultrasound technology\r\n or completion of a two- to three-year program in a related allied health field and a one-year post-diploma program in diagnostic medical sonography from an accredited institution are required.",
        "Registration with Sonography Canada and/or the American Registry of Diagnostic Medical Sonographers is usually required by employers.",
        "Registration with l'Ordre des technologues en imagerie médicale, en radio-oncologie et en électrophysiologie médicale du Québec is required in Quebec."
    ],
    "additional information": [
        "Membership in the Canadian Society of Diagnostic Medical Sonographers is available but voluntary."
    ],
    "exclusions": [
        {
            "name": "Medical radiation technologists (3215)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=3&val1=3215&ver=16"
        }
    ]
}