{
    "id": "4152",
    "name": "Social workers",
    "lead statement": "Social workers help individuals, couples, families, groups, communities and organizations develop the skills and resources they need to enhance social functioning and provide counselling, therapy and referral to other supportive social services. Social workers also respond to other social needs and issues such as unemployment, racism and poverty. They are employed by hospitals, school boards, social service agencies, child welfare organizations, correctional facilities, community agencies, employee assistance programs and Aboriginal band councils, or they may work in private practice.",
    "example titles": [
        "addiction social worker",
        "case management consultant – social work",
        "case management social worker",
        "case work consultant – social work",
        "casework supervisor – social work",
        "caseworker – social work",
        "certified social worker",
        "child welfare social worker",
        "children's aid investigator",
        "co-ordinator of social work",
        "family social worker",
        "geriatric social worker",
        "group social worker",
        "human relations officer – social work",
        "intake worker – social services",
        "medical social worker",
        "psychiatric social worker",
        "registered social worker",
        "school social worker",
        "social casework consultant",
        "social work co-ordinator",
        "social work officer",
        "social work supervisor",
        "social worker",
        "social workers supervisor"
    ],
    "main duties": [
        "Interview clients individually, in families, or in groups, to assess their situation and problems and determine the types of services required",
        "Provide counsel and therapy to assist clients in developing skills to deal with and resolve their social and personal problems",
        "Plan programs of assistance for clients including referral to agencies that provide financial assistance, legal aid, housing, medical treatment and other services",
        "Investigate cases of child abuse or neglect and take authorized protective action when necessary",
        "Serve as members on interdisciplinary teams of professionals working with client groups",
        "Act as advocates for client groups in the community, lobby for solutions to problems directly affecting client groups and develop prevention and intervention programs to meet community needs",
        "Develop or advise on social policy legislation, conduct social research and assist in community development",
        "Provide mediation services and psychosocial assessments",
        "Evaluate the effectiveness of counselling and social programs",
        "May provide public education and consultation to professionals or groups regarding counselling services, issues and methods",
        "May supervise other social workers.",
        "Social workers may specialize in fields of practice such as child welfare, family services, corrections, gerontology or addictions."
    ],
    "employment requirements": [
        "A bachelor's degree in social work is required in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Quebec, Ontario, Manitoba, Saskatchewan, British Columbia, the Northwest Territories and Nunavut.",
        "In Alberta, a bachelor's degree or diploma in social work is required.",
        "Supervised practical experience is usually required.",
        "Successful completion of provincial written and oral examinations may be required.",
        "Registration with a provincial governing body is mandatory to practise as a social worker in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Quebec, Ontario, Alberta and British Columbia.",
        "Use of the titles \"Social Worker\" and \"Registered Social Worker\" is regulated in all provinces.",
        "Membership in a provincial association of social workers is usually required."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Educational counsellors (4033)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4033&ver=16"
        },
        {
            "name": "Family, marriage and other related counsellors (4153)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4153&ver=16"
        },
        {
            "name": "Managers in social, community and correctional services (0423)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0423&ver=16"
        },
        {
            "name": "Social and community service workers (4212)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4212&ver=16"
        }
    ]
}