{
    "id": "4214",
    "name": "Early childhood educators and assistants",
    "lead statement": "Early childhood educators plan, organize and implement programs for children between the ages of infancy and 12 years. Early childhood educator assistants provide care for infants and preschool- to school-age children under the guidance of early childhood educators. Early childhood educators and assistants lead children in activities to stimulate and develop their intellectual, physical and emotional growth and ensure their security and well-being. They are employed in child-care centres, day-care centres, kindergartens, agencies for exceptional children and other settings where early childhood education services are provided. Supervisors of early childhood educators and assistants are included in this unit group.",
    "example titles": [
        "baby-care worker",
        "baby-care worker assistant",
        "baby-care workers supervisor",
        "child care worker – daycare",
        "child care worker assistant",
        "daycare aide",
        "daycare attendant",
        "daycare co-ordinator",
        "daycare helper",
        "daycare supervisor",
        "daycare teacher",
        "daycare worker",
        "daycare worker assistant",
        "early childhood assistant",
        "early childhood education worker",
        "early childhood educator – junior kindergarten",
        "early childhood educator – kindergarten",
        "early childhood educator – preschool",
        "early childhood educator (ECE)",
        "early childhood educator (ECE) assistant",
        "early childhood educator assistant – junior kindergarten",
        "early childhood educator assistant – kindergarten",
        "early childhood program staff assistant",
        "early childhood program supervisor",
        "early childhood supervisor",
        "educator assistant – junior kindergarten",
        "infant daycare workers supervisor",
        "infants' daycare worker",
        "nursery school aide",
        "nursery school helper",
        "nursery school teacher",
        "preschool helper",
        "preschool supervisor"
    ],
    "main duties": [
        {
            "duty_name": "Early childhood educators",
            "duty_description": [
                "Develop and implement child-care programs that support and promote the physical, cognitive, emotional and social development of children",
                "Lead activities by telling or reading stories, teaching songs, taking children to local points of interest and providing opportunities to express creativity through the media of art, dramatic play, music and physical activity",
                "Plan and maintain an environment that protects the health, security and well-being of children",
                "Assess the abilities, interests and needs of children and discuss progress or problems with parents and other staff members",
                "Observe children for signs of potential learning or behavioural problems and prepare reports for parents, guardians or supervisor",
                "Guide and assist children in the development of proper eating, dressing and toilet habits",
                "Establish and maintain collaborative relationships with co-workers and community service providers working with children",
                "May plan and organize activities for school-age children in child-care programs before and after regular school hours",
                "May supervise and co-ordinate activities of other early childhood educators and early childhood educator assistants."
            ],
            "duty_comment": null
        },
        {
            "duty_name": "Early childhood educator assistants",
            "duty_description": [
                "Support early childhood educators in carrying out programs that promote the physical, cognitive, emotional and social development of children",
                "Engage children in activities by telling stories, teaching songs and preparing crafts",
                "Prepare snacks and arrange rooms or furniture for lunch and rest periods",
                "Assist with proper eating, dressing and toilet habits",
                "Submit written observations on children to early childhood educators or supervisors",
                "Maintain daycare equipment and assist in housekeeping and cooking duties",
                "Attend staff meetings to discuss progress and problems of children",
                "May assist early childhood educators or supervisors in keeping records."
            ],
            "duty_comment": null
        }
    ],
    "employment requirements": [
        "Completion of a two- to four-year college program in early childhood education \r\n or a bachelor's degree in child development is required.",
        "Licensing is required in Ontario and certification is required in British Columbia for early childhood educators. Licensing for early childhood educators is usually required in all other provinces and territories.",
        "Completion of secondary school is required.",
        "Experience in child care is required.",
        "Completion of an early childhood education assistant certificate program or post-secondary courses in early childhood education may be required.",
        "Licensing by a provincial or territorial association as an early childhood educator may be required."
    ],
    "additional information": [
        "Progression to senior positions, such as daycare supervisor, is possible with several years of experience or with experience and advanced ECE qualification levels."
    ],
    "exclusions": [
        {
            "name": "Child-care centre administrators (in 0423 Managers in social, community and correctional services",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0423&ver=16"
        },
        {
            "name": "Elementary and secondary school teacher assistants (4413)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4413&ver=16"
        },
        {
            "name": "Elementary school and kindergarten teachers (4032)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4032&ver=16"
        }
    ]
}