{
    "id": "5131",
    "name": "Producers, directors, choreographers and related occupations",
    "lead statement": "This unit group includes producers, directors, choreographers and others who oversee and control the technical and artistic aspects of film, television, video game, radio, dance and theatre productions. They are employed by film production companies, radio and television stations, video game companies, broadcast departments, advertising companies, sound recording studios, record production companies and dance companies. They may also be self-employed.",
    "example titles": [
        "art director – motion pictures, broadcasting and performing arts",
        "artistic director – motion picture",
        "assistant director",
        "assistant director – motion pictures, broadcasting and performing arts",
        "audiovisual (AV) producer",
        "broadcasting director",
        "broadcasting producer",
        "broadcasting sports director",
        "casting director",
        "choreographer",
        "cinematographer",
        "cyber-choreographer",
        "director – motion picture",
        "director – motion pictures, broadcasting and performing arts",
        "director of photography",
        "film director",
        "film editor",
        "film producer",
        "filmmaker",
        "floor director – performing arts",
        "motion picture director",
        "motion picture producer",
        "motion picture production director",
        "movie director",
        "movie producer",
        "multimedia audio producer",
        "performing arts artistic director",
        "producer – performing arts",
        "producer-director",
        "production designer – motion pictures, broadcasting and performing arts",
        "production director – motion picture",
        "program director – broadcasting",
        "radio director",
        "radio producer",
        "record producer",
        "recording director",
        "stage director – performing arts",
        "stage producer",
        "technical director – broadcasting",
        "technical director – motion pictures, broadcasting and performing arts",
        "technical producer",
        "technical producer – motion pictures, broadcasting and performing arts",
        "television director",
        "television director-producer",
        "television producer",
        "VFX project manager",
        "video director",
        "video game art director",
        "video game producer",
        "video games project manager",
        "video illustrator – multimedia work",
        "video maker",
        "video producer",
        "visual effects producer",
        "visual effects project manager",
        "visual effects technical director – motion pictures"
    ],
    "main duties": [
        "Plan, organize and control the various stages and scheduling involved in the production of presentations, motion pictures, television shows and radio programs; engage directors and other production personnel and supervise all technical personnel, and determine the treatment, scope and scheduling of production; maintain production archives, negotiate royalties, and may plan and control the budget pertaining to a particular production.",
        "Interpret scripts and direct the mise-en-scène; select and direct the actors, extras and technical crew; advise the cast and crew on the interpretation and delivery of the performance; direct rehearsals, filmings, broadcasts and performances; and confer with crew and specialists throughout production and post-production to achieve desired presentation.",
        "Create dances for film, theatre and television performances that convey stories, ideas and moods, and direct rehearsals for dancers to achieve desired interpretation.",
        "Plan, organize and direct the artistic aspects of motion pictures, video games, stage productions and television shows by overseeing the design of sets, costumes, furnishings and props to create portrayals of period and setting.",
        "Edit motion picture film and arrange film segments into sequences to achieve continuity and desired dramatic, comedic and thematic effects.",
        "Plan and co-ordinate the production of musical recordings, direct musicians and singers during rehearsals and recordings and manage technicians involved in duplicating, dubbing and mastering of recordings.",
        "Co-ordinate and direct the photography of motion pictures, supervise camera operators and other crews and determine lighting, lenses, camera angles, backgrounds and other elements to achieve desired visual effect."
    ],
    "employment requirements": [
        "A university degree or college diploma in the performing arts, broadcasting, journalism, business administration, theatre production or film studies \r\n and Experience in a technical or production occupation in motion pictures, broadcasting or theatre are usually required.",
        "A university degree or college diploma in dance, or a period of study at a school of dance \r\n and Extensive training with a dance company are usually required.",
        "A university degree or college diploma in music or the recording arts \r\n and Experience in a technical or production occupation in the recording arts are usually required.",
        "A university degree or college diploma in film studies or cinematography \r\n and Experience in camera operation or another technical occupation in video or motion picture production are usually required. "
    ],
    "additional information": null,
    "exclusions": null
}