{
    "id": "5222",
    "name": "Film and video camera operators",
    "lead statement": "Film and video camera operators operate motion picture and video cameras and related equipment to record news, live events, films, videos and television broadcasts. They are employed by television networks and stations, motion picture and video production companies and in-house communications facilities of large corporations.",
    "example titles": [
        "assistant camera operator",
        "camera operator",
        "dance videographer",
        "electronic field production (EFP) camera operator",
        "electronic news gathering (ENG) camera operator",
        "film camera operator",
        "film cameraman/woman",
        "motion picture camera operator",
        "news camera operator",
        "senior motion picture camera operator",
        "studio camera operator",
        "television camera operator",
        "television news camera operator",
        "video camera operator",
        "videographer"
    ],
    "main duties": [
        "Meet with director and senior members of camera crew to discuss assignment and determine filming sequences, camera movements and picture composition",
        "Select and set up camera equipment to be used and attach lens, filters and film magazine to camera",
        "Adjust focus, exposure, lighting and other camera settings",
        "Operate film or video camera to record news, live events, films, videos and television broadcasts",
        "Label and record contents of exposed film, and complete report sheets",
        "Test, maintain and store equipment."
    ],
    "employment requirements": [
        "Completion of a college or technical program in broadcasting, audio-visual technology or a related field \r\n and experience as an assistant camera operator are usually required.",
        "Creative and technical ability, as demonstrated by a portfolio of work and experience, may be required."
    ],
    "additional information": [
        "Progression to supervisory or director of photography positions is possible with additional training and experience."
    ],
    "exclusions": [
        {
            "name": "Audio and video recording technicians (5225)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5225&ver=16"
        },
        {
            "name": "AV (audiovisual) assistants (in 5227 Support occupations in motion pictures, broadcasting, photography and the performing arts",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5227&ver=16"
        },
        {
            "name": "Filmmakers and directors of photography (in 5131 Producers, directors, choreographers and related occupations",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5131&ver=16"
        },
        {
            "name": "Photographers (5221)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5221&ver=16"
        },
        {
            "name": "Video artists (in 5136 Painters, sculptors and other visual artists",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5136&ver=16"
        },
        {
            "name": "Video transmission operators (in 5224 Broadcast technicians",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5224&ver=16"
        }
    ]
}