{
    "id": "5226",
    "name": "Other technical and co-ordinating occupations in motion pictures, broadcasting and the performing arts",
    "lead statement": "This unit group includes a range of technical, co-ordinating and supervisory workers who co-ordinate and perform specific activities for television, radio and motion picture productions, news broadcasts, theatre and stage productions, and other live or recorded productions. They are employed by television and radio stations and networks, recording studios, motion picture and video production companies, concert promoters and theatre, stage and dance companies.",
    "example titles": [
        "animal wrangler – motion pictures, broadcasting and performing arts",
        "broadcasting co-ordinator",
        "chief lighting technician",
        "chief stage electrician",
        "costume maker",
        "costume supervisor",
        "costumer",
        "costumer – motion pictures, broadcasting and performing arts",
        "costumes co-ordinator",
        "costumier",
        "exterior set manager",
        "exterior shooting director",
        "extra wrangler – motion pictures, broadcasting and performing arts",
        "film location manager",
        "first grip",
        "floor director – broadcasting",
        "floor manager – broadcasting",
        "gaffer",
        "head grip",
        "head of wardrobe",
        "key dresser",
        "key grip",
        "light board operator",
        "lighting effects chief technician",
        "lighting technician",
        "location manager – motion pictures and broadcasting",
        "machinist-electrician",
        "make-up artist – motion pictures, broadcasting and performing arts",
        "make-up artist and hairdresser – performing arts",
        "make-up artist and wig maker",
        "motion picture facilities supervisor",
        "music program planner",
        "optical effects co-ordinator",
        "presentation co-ordinator – broadcasting",
        "production co-ordinator – motion pictures, broadcasting and performing arts",
        "production co-ordinator – radiobroadcasting",
        "production co-ordinator – video games",
        "production co-ordinator – visual effects",
        "production technician – motion pictures, broadcasting and performing arts",
        "program co-ordinator – broadcasting",
        "programming manager",
        "properties custodian – stage productions or motion pictures",
        "property master – broadcasting",
        "property master – motion pictures, broadcasting and performing arts",
        "radio music program planner",
        "radio program planner",
        "remote broadcasting co-ordinator",
        "rigging gaffer",
        "script supervisor",
        "set electrician",
        "settings shop foreman/woman",
        "special effects technician",
        "sports program co-ordinator – broadcasting",
        "stage assistant director",
        "stage electrician",
        "stage manager",
        "stage technician",
        "staging supervisor",
        "studio administrator",
        "studio electrician",
        "studio manager",
        "studio manager – broadcasting",
        "stunt co-ordinator",
        "telecasting technician",
        "theatre technician",
        "unit manager – motion pictures and broadcasting",
        "wardrobe co-ordinator",
        "wardrobe master/mistress",
        "wardrobe supervisor",
        "wig hairdresser – motion pictures, broadcasting and performing arts"
    ],
    "main duties": [
        "Co-ordinate the work of camera operators and other technical staff, and cue announcers, actors and performers during news broadcasts and television program tapings.",
        "Supervise grips, gaffers and stagehands who rig, place, move and dismantle lights, sets, backdrops, scenery and other stage equipment.",
        "Set up, operate and make repairs to lights and other electrical equipment in studios and on sets and stages.",
        "Design and co-ordinate special effects such as fires, explosions and crashes.",
        "Apply cosmetic and special effects make-up on actors and other performers.",
        "Study scripts to determine the necessary costumes and oversee the acquisition, fitting and maintenance of costumes.",
        "Assist in preparing the construction specifications for sets.",
        "Identify and list the necessary props and place them during rehearsals and performances."
    ],
    "employment requirements": [
        "For most occupations in this unit group, completion of a college or university program in broadcasting, theatre arts or a related field \r\n and several years of experience in a related support or assisting occupation in motion pictures, broadcasting or the performing arts are required.",
        "Floor managers require a portfolio of work.",
        "Make-up artists working in motion pictures, broadcasting and the performing arts may require a training program.",
        "Creative ability, as demonstrated by a portfolio of work, is required for make-up artists.",
        "For gaffers, lighting technicians, key grips and other stage technicians, completion of a college program or other specialized training program in technical production for theatre is required.",
        "Membership in a related union may be required."
    ],
    "additional information": [
        "There may be an overlap in duties among occupations in this unit group, depending on the size of the production or broadcasting studio."
    ],
    "exclusions": [
        {
            "name": "Audio and video recording technicians (5225)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5225&ver=16"
        },
        {
            "name": "Broadcast technicians (5224)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5224&ver=16"
        },
        {
            "name": "Film and video camera operators (5222)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5222&ver=16"
        },
        {
            "name": "Lighting designers (in 5243 Theatre, fashion, exhibit and other creative designers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5243&ver=16"
        },
        {
            "name": "Support occupations in motion pictures, broadcasting, photography and the performing arts (5227)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5227&ver=16"
        }
    ]
}