{
    "id": "6222",
    "name": "Retail and wholesale buyers",
    "lead statement": "Retail and wholesale buyers buy merchandise for resale by retail or wholesale establishments and are usually responsible for the merchandising operations of retail or wholesale establishments. Retail and wholesale buyers who are supervisors and those who are assistants are included in this unit group.",
    "example titles": [
        "appliance buyer",
        "assistant buyer",
        "beverage taster and buyer",
        "buyer – retail",
        "buyer – wholesale",
        "buyers supervisor",
        "cattle buyer",
        "chief buyer",
        "chief buyer – retail or wholesale",
        "clothing buyer",
        "food buyer",
        "fruit buyer",
        "fur buyer",
        "hardware buyer",
        "hog buyer",
        "livestock buyer",
        "log buyer",
        "lumber buyer",
        "meat buyer",
        "merchandiser",
        "perishable food buyer",
        "pharmaceuticals buyer",
        "produce buyer",
        "retail buyer",
        "retail merchandiser",
        "salvage buyer",
        "scrap buyer",
        "senior buyer – retail or wholesale",
        "specialty food buyer",
        "timber buyer",
        "tobacco buyer",
        "wholesale buyer"
    ],
    "main duties": [
        "Purchase merchandise for resale by retail or wholesale establishments",
        "Review requirements of establishment and determine quantity and type of merchandise to purchase",
        "Study market reports, trade periodicals and sales promotion materials and visit trade shows, showrooms, factories and product design events",
        "Select the merchandise which best fits the establishment's requirements",
        "Interview suppliers and negotiate prices, discounts, credit terms and transportation arrangements",
        "Oversee distribution of merchandise to outlets and maintain adequate stock levels",
        "Establish and maintain contact with suppliers",
        "May supervise the work of other retail buyers.",
        "Retail and wholesale buyers may specialize in a particular merchandise line."
    ],
    "employment requirements": [
        "Completion of secondary school is required.",
        "A university degree or college diploma in business, marketing or a related program is usually required.",
        "Previous work experience in retail or wholesale establishments is usually required.",
        "Supervisors and senior buyers require experience in the occupation supervised or in a particular merchandise line."
    ],
    "additional information": [
        "Retail and wholesale buyers may specialize through experience or product-related training courses.",
        "Progression to management positions in retail trade, sales, marketing or advertising is possible with additional training or experience."
    ],
    "exclusions": [
        {
            "name": "Purchasing agents and officers (1225)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1225&ver=16"
        }
    ]
}