{
    "id": "6235",
    "name": "Financial sales representatives",
    "lead statement": "Financial sales representatives sell basic deposit, investment and loan products and services to individuals and businesses. They work in banks, credit unions, trust companies and similar financial institutions.",
    "example titles": [
        "banking accounts officer",
        "commercial banking accounts officer",
        "consumer credit officer",
        "consumer loans officer",
        "credit analyst",
        "credit investigation officer",
        "credit investigator",
        "credit officer",
        "debt counsellor",
        "financial sales and service officer",
        "financial sales and service supervisor",
        "financial services officer",
        "financial services representative",
        "lending services officer",
        "lending services trainee",
        "loan inspector",
        "loan officer",
        "loans adviser",
        "loans agent",
        "loans analyst",
        "loans counsellor",
        "loans supervisor",
        "merchant services specialist – financial",
        "mortgage consultant",
        "mortgage loans consultant",
        "mortgage loans officer",
        "mortgage officer",
        "personal banker",
        "personal banking accounts officer",
        "personal banking representative",
        "personal financial services associate",
        "personal financial services officer",
        "personal loans officer",
        "sales associate – personal banking",
        "sales officer – financial",
        "senior loans officer",
        "student loans officer"
    ],
    "main duties": [
        "Open new personal and non-personal accounts, and provide access to automated banking machine, telephone banking and online banking services",
        "Interview applicants for personal, mortgage, student and business loans",
        "Promote the sale of deposit, investment, credit and loan products and services",
        "Assist clients by proposing solutions to address financial objectives such as business expansion, debt management, investment and other financial goals",
        "Research and evaluate loan applicant's financial status, references, credit and ability to repay the loan",
        "Complete credit and loan documentation",
        "Submit credit and loan applications to branch or credit manager with recommendations for approval or rejection; or approve or reject applications within authorized limits ensuring that credit standards of the institution are respected",
        "Prepare statements on delinquent accounts and forward irreconcilable accounts for collector action",
        "Review and update credit and loan files",
        "Act as joint custodian for cash and securities."
    ],
    "employment requirements": [
        "Completion of secondary school and extensive general banking experience is usually required.",
        "A bachelor's degree or college diploma related to commerce or economics may be required.",
        "A mutual funds licence is usually required.",
        "Registration with the securities regulatory authority in the province or territory of employment is usually required.",
        "Completion of a loan or credit training program, ranging from six to twelve months, is usually required.",
        "Various training programs and courses are offered by the Institute of Canadian Bankers and may be required by employers.",
        "Financial services officers who sell regulated financial products and investments are required to be licensed by the appropriate governing body."
    ],
    "additional information": [
        "Progression to higher levels of financial planning and wealth management is possible with experience.",
        "Progression to credit and loan management positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Credit and loan managers (in 0122 Banking, credit and other investment managers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0122&ver=16"
        },
        {
            "name": "Customer services representatives - financial institutions (6551)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6551&ver=16"
        },
        {
            "name": "Banking, insurance and other financial clerks (1434)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1434&ver=16"
        },
        {
            "name": "Other financial officers (1114)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=1&val1=1114&ver=16"
        }
    ]
}