{
    "id": "6311",
    "name": "Food service supervisors",
    "lead statement": "Food service supervisors supervise, direct and co-ordinate the activities of workers who prepare, portion and serve food. They are employed by hospitals and other health care establishments and by cafeterias, catering companies and other food service establishments.",
    "example titles": [
        "cafeteria supervisor",
        "canteen supervisor",
        "catering supervisor",
        "food assembly supervisor",
        "food concession supervisor",
        "food service supervisor",
        "hospital food service supervisor",
        "kitchen manager",
        "railway dining car food service supervisor",
        "shift manager – fast food restaurant",
        "swing manager – fast food restaurant",
        "unit supervisor – food services"
    ],
    "main duties": [
        "Supervise, co-ordinate and schedule the activities of staff who prepare, portion and serve food",
        "Estimate and order ingredients and supplies required for meal preparation",
        "Prepare food order summaries for chef according to requests from dieticians, patients in hospitals or other customers",
        "Establish work schedules and procedures",
        "Maintain records of stock, repairs, sales and wastage",
        "Train staff in job duties, and sanitation and safety procedures",
        "Supervise and check assembly of regular and special diet trays and delivery of food trolleys to hospital patients",
        "Ensure that food and service meet quality control standards",
        "May participate in the selection of food service staff and assist in the development of policies, procedures and budgets",
        "May plan cafeteria menus and determine related food and labour costs."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a community college program in food service administration, hotel and restaurant management or related discipline \r\n or several years of experience in food preparation or service are required."
    ],
    "additional information": null,
    "exclusions": [
        {
            "name": "Banquet captains (in 6513 Food and beverage servers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6513&ver=16"
        },
        {
            "name": "Maîtres d'hôtel and hosts/hostesses (6511)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=6&val1=6511&ver=16"
        },
        {
            "name": "Mobile canteen service supervisor (in 7305 Supervisors, motor transport and other ground transit operators",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7305&ver=16"
        },
        {
            "name": "Restaurant and food service managers (0631)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=0&val1=0631&ver=16"
        }
    ]
}