{
    "id": "7231",
    "name": "Machinists and machining and tooling inspectors",
    "lead statement": "Machinists set up and operate a variety of machine tools to cut or grind metal, plastic or other materials to make or modify parts or products with precise dimensions. Machining and tooling inspectors inspect machined parts and tooling in order to maintain quality control standards. They are employed by machinery, equipment, motor vehicle, automotive parts, aircraft and other metal products manufacturing companies and by machine shops.",
    "example titles": [
        "aircraft engine parts machinist",
        "aircraft machinist",
        "apprentice automotive machinist",
        "apprentice machinist",
        "auto parts machine shop inspector",
        "automotive machinist",
        "aviation machinist",
        "ballistic laboratory machinist",
        "bench machinist",
        "computer numerical control (CNC) machinist",
        "computer-assisted machinist",
        "diesel engine machinist",
        "differential gear testing machinist",
        "dimensional inspector – machine shop",
        "electrical machinist",
        "experimental machinist",
        "firearms machining inspector",
        "firearms model maker machinist",
        "gear inspector-machinist",
        "gear tester-machinist",
        "general machinist",
        "journeyman/woman machinist",
        "machine shop charge hand",
        "machine shop inspector",
        "machined parts inspector",
        "machining and tooling inspector",
        "machining inspector",
        "machinist",
        "machinist apprentice",
        "maintenance machinist",
        "master machinist",
        "model maker machinist",
        "motion picture equipment machinist",
        "mould and core machinist",
        "mouldmaking machinist",
        "numerically controlled (NC) machinist",
        "precision machinist",
        "printing press machinist",
        "propeller inspector – machining",
        "prototype machinist",
        "set-up machinist",
        "tool and die inspector",
        "tool and gauge inspector",
        "tooling inspector",
        "toolroom inspector",
        "toolroom machinist",
        "turbine blade machinist"
    ],
    "main duties": [
        "Read and interpret engineering drawings, blueprints, charts and tables or study sample parts to determine machining operation to be performed, and plan best sequence of operations",
        "Compute dimensions and tolerances and measure and lay out work pieces",
        "Set up, operate and maintain a variety of machine tools including computer numerically controlled (CNC) tools to perform precision, non-repetitive machining operations such as sawing, turning, milling, boring, planing, drilling, precision grinding and other operations",
        "Fit and assemble machined metal parts and subassemblies using hand and power tools",
        "Verify dimensions of products for accuracy and conformance to specifications using precision measuring instruments",
        "May set up and program machine tools for use by machining tool operators.",
        "Verify dimensions of machined parts or tooling using micrometers, verniers, callipers, height gauges, optical comparators, co-ordinate measuring machines (CMM) or other specialized measuring instruments",
        "Maintain, repair and calibrate precision measuring instruments such as dial indicators, fixed gauges, height gauges and other measuring devices",
        "Report deviations from specifications and tolerances to supervisor",
        "Complete and maintain inspection reports."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a four-year apprenticeship program \r\n or a combination of over four years of work experience and industry courses in machining may be required for trade certification.",
        "Trade certification for machinists is available, but voluntary, in all provinces and territories.",
        "Trade certification for tool and gauge inspectors is available, but voluntary, in Ontario.",
        "Trade certification for machinists (CNC) is available, but voluntary, in New Brunswick, Quebec and Manitoba.",
        "Several years of experience as a machinist, tool and die maker or machining tool operator may be required for machining and tooling inspectors.",
        "Red Seal endorsement is also available to qualified machinists upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "Familiarity with exotic and composite materials may be required for machinists in aviation and other advanced manufacturing sectors.",
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "CAD-CAM programmers (in 2233 Industrial engineering and manufacturing technologists and technicians",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2233&ver=16"
        },
        {
            "name": "Contractors and supervisors, machining, metal forming, shaping and erecting trades and related occupations (7201)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7201&ver=16"
        },
        {
            "name": "Machining tool operators (9417)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9417&ver=16"
        },
        {
            "name": "Tool and die makers (7232)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7232&ver=16"
        }
    ]
}