{
    "id": "7241",
    "name": "Electricians (except industrial and power system)",
    "lead statement": "Electricians in this unit group lay out, assemble, install, test, troubleshoot and repair electrical wiring, fixtures, control devices and related equipment in buildings and other structures. They are employed by electrical contractors and maintenance departments of buildings and other establishments, or they may be self-employed.",
    "example titles": [
        "apprentice construction electrician",
        "apprentice electrician",
        "building construction electrician",
        "building electrician",
        "construction and maintenance electrician",
        "construction electrician",
        "construction electrician apprentice",
        "domestic and rural electrician",
        "electrical fixtures installer",
        "electrical wiring installer – construction",
        "electrician",
        "electrician – troubleshooter",
        "institution electrician",
        "journeyman/woman construction electrician",
        "residential construction wirer",
        "residential wireman/woman",
        "wiring electrician"
    ],
    "main duties": [
        "Read and interpret drawings, circuit diagrams and electrical code specifications to determine wiring layouts for new or existing installations",
        "Pull wire through conduits and through holes in walls and floors",
        "Install brackets and hangers to support electrical equipment",
        "Install, replace and repair lighting fixtures and electrical control and distribution equipment, such as switches, relays and circuit breaker panels",
        "Splice, join and connect wire to fixtures and components to form circuits",
        "Test continuity of circuits using test equipment to ensure compatibility and safety of system, following installation, replacement or repair",
        "Troubleshoot and isolate faults in electrical and electronic systems and remove and replace faulty components",
        "Connect electrical power to audio and visual communication equipment, signalling devices and heating and cooling systems",
        "Conduct preventive maintenance programs and keep maintenance records."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a four- to five-year apprenticeship program is usually required.",
        "Trade certification for construction electricians is compulsory in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Quebec, Ontario, Manitoba, Saskatchewan and Alberta and available, but voluntary, in British Columbia, the Yukon, the Northwest Territories and Nunavut.",
        "Trade certification for electricians (domestic and rural) is compulsory in Newfoundland and Labrador and Ontario.",
        "Trade certification for electrical control (machine) builders is available, but voluntary, in Ontario.",
        "Red Seal endorsement is also available to qualified construction electricians upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Electrical mechanics (7333)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7333&ver=16"
        },
        {
            "name": "Industrial electricians (7242)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7242&ver=16"
        },
        {
            "name": "Power system electricians (7243)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7243&ver=16"
        },
        {
            "name": "Supervisors of electricians (in 7202 Contractors and supervisors, electrical trades and telecommunications occupations",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7202&ver=16"
        }
    ]
}