{
    "id": "7284",
    "name": "Plasterers, drywall installers and finishers and lathers",
    "lead statement": "Plasterers apply finish, and maintain and restore plaster or similar materials, on interior and exterior walls, ceilings and building partitions to produce plain or decorative surfaces. Drywall installers and finishers install and finish drywall sheets and various types of ceiling systems. Lathers install support framework for ceiling systems, interior and exterior walls and building partitions. They are employed by construction companies and by plastering, drywalling and lathing contractors, or they may be self-employed.",
    "example titles": [
        "acoustic tile and drywall installer",
        "acoustic tile installer",
        "acoustical ceiling installer",
        "apprentice drywall applicator",
        "apprentice plasterer",
        "ceiling installer",
        "ceiling system installer",
        "drywall and acoustic mechanic",
        "drywall and ceiling system installer",
        "drywall and lather applicator",
        "drywall applicator",
        "drywall finisher",
        "drywall finisher apprentice",
        "drywall hanger",
        "drywall installer",
        "drywall installer and finisher",
        "drywall installer and finisher apprentice",
        "drywall installer lead hand",
        "drywall installer team leader",
        "drywall interior systems installer",
        "drywall mechanic",
        "drywall nailer",
        "drywall nailing person",
        "drywall taper",
        "exterior plasterer",
        "finish plasterer",
        "fireproofing applicator",
        "fireproofing plasterer",
        "gyproc applicator",
        "gypsum lather",
        "gypsum plasterboard applicator",
        "interior drywall installer",
        "interior drywall systems installer",
        "journeyman/woman drywall installer",
        "journeyman/woman lather",
        "journeyman/woman plasterer",
        "lather",
        "lather (interior systems mechanic)",
        "lather applicator",
        "lather apprentice",
        "metal lather",
        "moulding plasterer",
        "ornamental plasterer",
        "plasterer",
        "plasterer apprentice",
        "plasterer-decorator",
        "sheetrock applicator",
        "stucco lather",
        "stucco plasterer",
        "wall and ceiling installer",
        "wallboard installer",
        "wallboard taper",
        "wire lather",
        "wood lather"
    ],
    "main duties": [
        "Clean and prepare surfaces",
        "Mix plaster ingredients in trough to desired consistency",
        "Apply, level and smooth coats of plaster using trowels, floats, brushes and spraying equipment",
        "Trowel or spray coats of stucco over exteriors of buildings to form weatherproof surfaces",
        "Finish corners and angles and create decorative designs in finish coat, if required",
        "Cure freshly plastered surfaces",
        "Mould and install ornamental plaster panels, cornices and trim",
        "Spray acoustic materials or texture finish over walls and ceilings.",
        "Measure, cut and fit drywall sheets for installation on walls and ceilings",
        "Position and secure sheets to metal or wooden studs or joists",
        "Cut and install metal corner beads to protect exterior corners",
        "Fill joints, nail indentations, holes and cracks with joint compound using trowel and broad knife",
        "Tape over joints using taping machine and embed tape in compound",
        "Smooth out excess compound and allow coat to dry",
        "Apply successive coats of compound and sand seams and joints",
        "Fabricate and install suspended metal ceiling grids and place in panels to form acoustical and coffered ceilings.",
        "Prepare wall and ceiling layouts",
        "Install metal stud framing and furring for interior drywall or plaster walls and ceilings, using hand and power tools",
        "Attach metal or gypsum lath to studs or furring using nails, screws, clips or wire ties",
        "Cut openings in lath for heating and ventilation piping, ducts and electrical outlets",
        "Install corner beads and wire mesh around beams to which plaster is to be applied",
        "May install acoustic tile, hangers for suspended ceilings and metal studs for composition wallboard or lath."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a three- or four-year apprenticeship program in plastering, drywalling or lathing \r\n or a combination of over three years of work experience and some high school, college or industry courses in plastering, drywalling or lathing is usually required.",
        "Plasterer trade certification is compulsory in Quebec and available, but voluntary, in Ontario, Saskatchewan and British Columbia.",
        "Drywall installer and finisher trade certification is available, but voluntary, in British Columbia.",
        "Trade certification for lathers (interior systems mechanics) is compulsory in Quebec and available, but voluntary, in all other provinces and the Yukon.",
        "Red Seal endorsement is also available to qualified lathers (interior systems mechanic) upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Supervisors of trade workers in this unit group (in 7205 Contractors and supervisors, other construction trades, installers, repairers and servicers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7205&ver=16"
        }
    ]
}