{
    "id": "7291",
    "name": "Roofers and shinglers",
    "lead statement": "Roofers install, repair or replace flat roofs as well as shingles, shakes or other roofing tiles on sloped roofs. Shinglers install and replace shingles, tiles and similar coverings on sloped roofs. They are employed by roofing and general contractors, or they may be self-employed.",
    "example titles": [
        "apprentice roofer",
        "apprentice shingle roofer",
        "asphalt and gravel roofer",
        "asphalt roofer",
        "asphalt shingle roofer",
        "asphalt shingler",
        "built-up flat roofer",
        "built-up roofer",
        "cedar shakes shingler",
        "cedar shingler",
        "composition roofer",
        "flat roofer",
        "gravel roofer",
        "journeyman/woman roofer",
        "metal roofer",
        "residential building shingler",
        "residential steep roofer",
        "roof tiler",
        "roofer",
        "roofer and waterproofer",
        "roofer trainee",
        "roofing mechanic",
        "shingle roofer",
        "shingler",
        "shingler trainee",
        "single-ply roofer",
        "tar and gravel roofer",
        "tar roofer",
        "tile roofer",
        "waterproofer and roofer",
        "wood shingle roofer",
        "wood shingler"
    ],
    "main duties": [
        "Install, repair or replace built-up roofing systems using materials such as asphalt saturated felts and hot asphalt and gravel",
        "Install, repair or replace single-ply roofing system using waterproof sheet materials such as modified plastics, elastomeric or other asphaltic compositions",
        "Install, repair or replace shingles, shakes and other roofing tiles on sloped roofs of buildings",
        "Install sheet metal flashings",
        "Apply waterproof coatings to concrete or other masonry surfaces below or above ground level",
        "Install and repair metal roofs using hand and power tools",
        "Set up scaffolding to provide safe access to roofs",
        "May estimate materials required and quote costs.",
        "Install or replace asphalt shingles, wood shingles and shakes and masonry or baked clay roofing tiles on sloped roofs of buildings",
        "Set up scaffolding to provide safe access to roofs."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "For roofers, completion of a two- to three-year apprenticeship program \r\n or over three years of work experience in the trade are usually required to be eligible for trade certification.",
        "Roofing trade certification is compulsory in Quebec and available, but voluntary, in all other provinces and the territories.",
        "Trade certification for residential steep roofers is available, but voluntary, in British Columbia.",
        "Red Seal endorsement is also available to qualified roofers upon successful completion of the interprovincial Red Seal examination.",
        "Shinglers require one to two years of on-the-job training."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Supervisors of roofers and shinglers (in 7205 Contractors and supervisors, other construction trades, installers, repairers and servicers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7205&ver=16"
        }
    ]
}