{
    "id": "7293",
    "name": "Insulators",
    "lead statement": "Insulators apply insulation materials to plumbing, air-handling, heating, cooling and refrigeration systems, piping equipment and pressure vessels, and walls, floors and ceilings of buildings and other structures, to prevent or reduce the passage of heat, cold, sound or fire. They are employed by construction companies and insulation contractors, or they may be self-employed.",
    "example titles": [
        "apprentice insulator",
        "asbestos insulator",
        "boat and ship insulator",
        "boiler and pipe insulator",
        "boiler insulator",
        "building insulator",
        "cork insulation installer",
        "fibreglass insulation installer",
        "fire protection insulator",
        "firestopping insulator",
        "foamed insulation applicator",
        "heat and frost insulator",
        "insulation applicator",
        "insulation installer",
        "insulation mechanic",
        "insulator",
        "insulator apprentice",
        "journeyman/woman insulator",
        "pipe insulator",
        "plastic insulation applicator",
        "refrigeration and air conditioning equipment insulator",
        "residential insulation installer",
        "sound insulator",
        "soundproof material installer"
    ],
    "main duties": [
        "Read and interpret drawings and specifications to determine insulation requirements and select type of insulation required",
        "Measure and cut insulating material to required dimensions using hand and power tools",
        "Apply and secure insulation using spraying, blowing, pasting, strapping, taping and other application and installation methods",
        "Fit insulation around obstructions and between studs and joists",
        "Install vapour barriers",
        "Apply waterproofing cement over insulating materials to finish surfaces",
        "Remove asbestos or urea-formaldehyde insulation from buildings when required."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a three- to four-year apprenticeship program \r\n or a combination of over four years of work experience in the trade and some high school, college or industry courses in insulating is usually required to be eligible for trade certification.",
        "Trade certification for insulators (heat and frost) is compulsory in Quebec and available, but voluntary, in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Manitoba, Saskatchewan, Alberta, British Columbia, the Yukon, the Northwest Territories and Nunavut.",
        "Red Seal endorsement is also available to qualified insulators (heat and frost) upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Supervisors of insulators (in 7205 Contractors and supervisors, other construction trades, installers, repairers and servicers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7205&ver=16"
        }
    ]
}