{
    "id": "7294",
    "name": "Painters and decorators (except interior decorators)",
    "lead statement": "Painters and decorators apply paint, wallpaper and other finishes to interior and exterior surfaces of buildings and other structures. They are employed by construction companies, painting contractors and building maintenance contractors, or they may be self-employed.",
    "example titles": [
        "apprentice industrial painter and decorator",
        "apprentice painter and decorator",
        "bridge painter",
        "building painter",
        "commercial building painter",
        "commercial construction painter",
        "construction painter",
        "house painter",
        "industrial construction painter",
        "industrial maintenance painter",
        "journeyman/woman painter and decorator",
        "maintenance painter",
        "painter",
        "painter and decorator",
        "painter and decorator apprentice",
        "painter and paperhanger",
        "painter-decorator",
        "paperhanger",
        "plant maintenance painter",
        "residential construction painter",
        "residential painter",
        "roof painter",
        "rough painter – construction",
        "specialized painter and decorator"
    ],
    "main duties": [
        "Read specifications to determine quantities of materials required",
        "Prepare and clean surfaces using methods such as scraping, sanding, sandblasting, hydro-blasting and steam-cleaning; remove old wallpaper and loose paint; repair cracks and holes in walls; and sandpaper and apply sealer",
        "Mix and thin paint to obtain desired colour and texture",
        "Apply paint or other materials, such as stains, lacquer, enamel, oil, varnish,  fibreglass, metal coating or fire retardant using brushes, rollers or spray equipment",
        "Measure, cut and apply wallpaper or fabric to walls",
        "Assemble and erect scaffolding and swing stages",
        "May advise customer on selection of colour schemes and choice of wall coverings",
        "May provide cost estimates to clients."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a three- to four-year apprenticeship program \r\n or over three years of work experience in the trade is usually required to be eligible for trade certification.",
        "Trade certification for painters and decorators is compulsory in Quebec and available, but voluntary, in all other provinces and the territories.",
        "Red Seal endorsement is also available to qualified painters and decorators upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Automotive painters (in 7322 Motor vehicle body repairers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7322&ver=16"
        },
        {
            "name": "Industrial painters, coaters and metal finishing process operators (9536)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9536&ver=16"
        },
        {
            "name": "Interior decorators (in 5242 Interior designers and interior decorators",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5242&ver=16"
        },
        {
            "name": "Painters, sculptors and other visual artists (5136)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=5&val1=5136&ver=16"
        },
        {
            "name": "Supervisors of painters and decorators (in 7205 Contractors and supervisors, other construction trades, installers, repairers and servicers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7205&ver=16"
        }
    ]
}