{
    "id": "7295",
    "name": "Floor covering installers",
    "lead statement": "Floor covering installers install carpet, wood, linoleum, vinyl and other resilient floor coverings in residential, commercial, industrial and institutional buildings. They are employed by construction companies, floor-covering contractors and carpet outlets, or they may be self-employed.",
    "example titles": [
        "apprentice floor covering installer",
        "broadloom installer",
        "carpet installer",
        "carpet layer",
        "composition floor layer",
        "floor covering installer",
        "floor covering installer apprentice",
        "floor covering mechanic",
        "floor layer",
        "floor sheeting layer",
        "floor tile layer",
        "hardwood floor covering installer",
        "hardwood floor layer",
        "journeyman/woman floor covering installer",
        "journeyman/woman floor mechanic",
        "linoleum floor covering installer",
        "linoleum floor covering layer",
        "linoleum floor installer",
        "linoleum floor layer",
        "parquet floor layer",
        "residential floor and wall covering installer",
        "residential wall and floor covering installer",
        "resilient floor installer",
        "resilient floor layer",
        "rug installer",
        "rug layer",
        "vinyl floor installer",
        "vinyl floor layer",
        "vinyl tile layer",
        "wood floor covering layer",
        "wood floor installer"
    ],
    "main duties": [
        "Inspect, measure and mark surfaces to be covered",
        "Measure, cut and fasten underlay and underpadding",
        "Measure, cut and install carpeting using hand or machine stitcher, seaming iron, bonding tape or other bonding materials",
        "Stretch carpeting using knee-kicker or power stretcher and secure carpeting to floor or other surfaces using staple gun or other devices",
        "Measure, cut and install resilient floor covering using adhesive, rollers and other hand tools",
        "Install hardwood floors, such as strip floors, block floors or plank floors, using glue, staples, nails or other means",
        "Inspect and repair damaged floor coverings",
        "May estimate material and labour costs."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a two- to three-year apprenticeship program \r\n or over four years of work experience in the trade and some courses in floor covering installation are usually required to be eligible for trade certification.",
        "Trade certification for floor covering installers is compulsory in Quebec and available, but voluntary, in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Ontario, Manitoba, Alberta, British Columbia, the Yukon, the Northwest Territories and Nunavut.",
        "Red Seal endorsement is also available to qualified floor covering installers upon successful completion of the interprovincial Red Seal examination."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Supervisors of floor covering installers (in 7205 Contractors and supervisors, other construction trades, installers, repairers and servicers",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7205&ver=16"
        }
    ]
}