{
    "id": "7384",
    "name": "Other trades and related occupations, n.e.c.",
    "lead statement": "This unit group includes tradespersons and related skilled workers, not elsewhere classified, who repair, service, install, calibrate or fabricate a variety of products. This unit group includes commercial divers. They are employed by a wide range of establishments, or they may be self-employed.",
    "example titles": [
        "aircraft mock-up maker",
        "aircraft model maker",
        "aircraft patternmaker",
        "anvilsmith",
        "apprentice marine repair technician",
        "apprentice recreation vehicle mechanic",
        "apprentice saw repairer",
        "blacksmith",
        "blacksmith – agriculture",
        "blacksmith – manufacturing",
        "bomb-disposal expert",
        "circular saw filer",
        "clearance diver",
        "commercial diver",
        "commercial free-diver",
        "commercial scuba diver",
        "commercial skin diver",
        "deep-sea diver",
        "die setter",
        "diver",
        "diving contractor",
        "diving supervisor",
        "explosive ordnance detector",
        "farm blacksmith",
        "farrier",
        "forest products saw filer",
        "glass calibrator",
        "gun repairer",
        "gunsmith",
        "hammersmith",
        "hard-hat diver",
        "horseshoer",
        "linesman/woman – shipbuilding",
        "lock expert",
        "lock fitter",
        "lock repairer",
        "lock repairman/woman",
        "lock setter",
        "locksmith",
        "locksmithing expert",
        "loftsman/woman – aircraft manufacturing",
        "loftsman/woman – shipbuilding",
        "marine repair technician",
        "model and mock-up maker",
        "model and mock-up maker – aeronautics",
        "model and mould maker – concrete products",
        "model maker",
        "motor vehicle model maker",
        "offshore diver",
        "patternmaker – aeronautics",
        "plaster mould maker – aircraft",
        "plaster pattern maker",
        "plaster pattern maker – aircraft",
        "reclamation diver",
        "recreation vehicle apprentice mechanic",
        "recreation vehicle mechanic",
        "recreation vehicle repairer",
        "recreation vehicle service technician",
        "recreation vehicle technician",
        "remote operated vehicle (ROV) operator",
        "restoration steeplejack",
        "rope access technician (RAT)",
        "safe and vault installer-servicer",
        "safe and vault repairer",
        "safe and vault servicer",
        "safe and vault technician",
        "safe expert",
        "safe maker",
        "salvage diver",
        "saw doctor",
        "saw filer",
        "saw fitter",
        "saw fitter-filer",
        "saw maker",
        "saw repairer",
        "saw repairman/woman",
        "sawmill saw fitter",
        "sawsmith",
        "scale calibrator",
        "scientific instrument calibrator",
        "search and rescue diver",
        "ship model maker",
        "small arms repairer",
        "small-aircraft model maker",
        "smokestack repairer",
        "steeplejack",
        "stonework patternmaker",
        "template maker",
        "template maker – aeronautics",
        "template maker – shipbuilding",
        "time lock expert",
        "toolsmith",
        "underwater contractor",
        "underwater worker",
        "vault repairer",
        "vault servicer",
        "working model maker – aircraft"
    ],
    "main duties": [
        "Fabricate guns and repair and modify firearms according to blueprints or customers' specifications.",
        "Repair, install and adjust locks, make keys and change lock combinations.",
        "Repair or replace electrical wiring, plumbing, propane gas lines, appliances, windows, doors, cabinets and structural frames in recreational vehicles.",
        "Install, repair and maintain safes and vaults in banks and other establishments.",
        "Repair, set and sharpen band saws, chain saws, circular saws and other types of saw blades according to specifications.",
        "Select dies for forging according to work order and specifications; position align and bolt dies to ram and anvil of power presses and hammers.",
        "Perform underwater activities related to construction, inspection, search, salvage, repair and photography."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Completion of a two- to four-year apprenticeship program in a relevant trade, such as locksmith, recreation vehicle technician or saw fitter\r\n or college, high school or industry courses combined with several years of related work experience \r\n or several years of on-the-job training are required.",
        "Trade certification for locksmiths is available, but voluntary, in Nova Scotia, New Brunswick, Saskatchewan, Alberta, British Columbia, the Northwest Territories and Nunavut.",
        "Trade certification for recreation vehicle service technicians is compulsory in Alberta and available, but voluntary, in Newfoundland and Labrador, Nova Scotia, Prince Edward Island, New Brunswick, Quebec, Ontario, Manitoba, British Columbia and the Yukon.",
        "Sawfiler/fitter and sawfitter trade certification is available, but voluntary, in Quebec, British Columbia and the Yukon.",
        "Provincial trade certification or licensing may be required for other occupations in this unit group.",
        "Red Seal endorsement is also available to qualified recreation vehicle service technicians upon successful completion of the interprovincial Red Seal examination.",
        "Commercial divers must meet the requirements of CSA Standard Z275.4-02, Competency Standard for Diving Operations.",
        "Commercial divers require an Occupational Diver Certificate of Competency issued by the Diver Certification Board of Canada (DCBC) or qualification earned through a formal education program, training courses in diving or a combination of education and practical experience.",
        "Commercial divers require certification of competency and a diving medical examination from an approved hyperbaric physician.",
        "Commercial divers may require military or police diving experience.",
        "Commercial divers usually require a provincial blaster's licence for the setting and detonation of explosives."
    ],
    "additional information": [
        "The Red Seal endorsement allows for interprovincial mobility.",
        "There is little or no mobility among occupations in this unit group.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Motorcycle, all-terrain vehicle and other related mechanics (7334)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7334&ver=16"
        },
        {
            "name": "Other small engine and small equipment repairers (7335)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7335&ver=16"
        },
        {
            "name": "Police divers (in 4311 Police officers (except commissioned)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=4&val1=4311&ver=16"
        },
        {
            "name": "Welders and related machine operators (7237)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7237&ver=16"
        }
    ]
}