{
    "id": "7512",
    "name": "Bus drivers, subway operators and other transit operators",
    "lead statement": "This unit group includes workers who drive buses and operate streetcars, subway trains and light rail transit vehicles to transport passengers on established routes. Bus drivers are employed by urban transit systems, school boards or transportation authorities and private transportation companies. Streetcar, subway and light rail transit operators are employed by urban transit systems.",
    "example titles": [
        "articulated bus operator",
        "bus driver",
        "bus driver – special needs passengers",
        "bus operator",
        "bus operator – accessible services",
        "charter bus driver",
        "intercity bus driver",
        "light rail transit operator",
        "long distance bus driver",
        "motor coach driver",
        "public passenger transit driver",
        "school bus driver",
        "school bus driver – special needs passengers",
        "shuttle bus driver",
        "shuttle driver – auto dealership",
        "shuttle driver – car rental company",
        "shuttle operator",
        "sightseeing bus driver",
        "sightseeing tour driver",
        "streetcar conductor",
        "streetcar operator",
        "subway train operator",
        "tour bus operator",
        "transit operator – transportation",
        "trolley bus operator",
        "trolley coach driver",
        "urban transit operator"
    ],
    "main duties": [
        "Drive buses or streetcars to transport passengers along established routes to local destinations",
        "Drive buses to transport passengers and goods to intercity or long distance destinations",
        "Drive sightseeing tour buses to transport passengers locally or over long distances",
        "Drive buses equipped for wheelchair accessibility, and aid passengers in boarding",
        "Provide passengers with information on fares, schedules and stops",
        "Collect fares, issue and validate transfers, check bus passes and record transactions",
        "Conduct pre-trip and post-trip inspections of vehicle",
        "Communicate with passengers, dispatchers or other drivers using two-way radio systems",
        "Report delays, mechanical problems and accidents",
        "May provide information on points of interest during sightseeing tours",
        "May load and unload passengers' luggage and express freight.",
        "Drive school buses to transport children between school and home or on excursions",
        "Ensure children's safety when boarding and leaving buses and crossing street while bus is stopped",
        "Maintain control of student activities during travel to prevent distractions or behaviours that could compromise safety",
        "May transport adults outside of school hours on chartered trips.",
        "Operate subway or rail transit vehicles as part of two-person crew",
        "Observe signals at crossings and arrival and departure points",
        "Operate controls to open and close transit vehicle doors",
        "Report delays, malfunctions and accidents to control unit",
        "Ensure passenger safety and welfare in emergencies, and direct passengers during evacuation procedures."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Up to three months of on-the-job training, including classroom instruction, is usually provided for all occupations in this unit group.",
        "A minimum of one year of safe driving experience is required.",
        "Bus drivers require a Class B, C, E or F driver's licence in Ontario, and a Class 2 driver's licence is required in all other provinces and the territories.",
        "An air brakes endorsement and first aid certificate may be required.",
        "Experience as a public transit bus driver is usually required for subway and light rail transit operators."
    ],
    "additional information": [
        "Progression to transit supervisory positions, inspector or training instructor positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Supervisors and inspectors of bus drivers, subway operators and other transit operators (in 7305 Supervisors, motor transport and other ground transit operators",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7305&ver=16"
        }
    ]
}