{
    "id": "9241",
    "name": "Power engineers and power systems operators",
    "lead statement": "Power engineers operate and maintain reactors, turbines, boilers, generators, stationary engines and auxiliary equipment to generate electrical power and to provide heat, light, refrigeration and other utility services for commercial, institutional and industrial plants and facilities. Power systems operators monitor and operate switchboards and related equipment in electrical control centres to control the distribution of electrical power in transmission networks. They are employed by power generation plants, electrical power utilities, manufacturing plants, hospitals, universities and government and commercial establishments.",
    "example titles": [
        "air compressor operator",
        "air conditioning system operator",
        "apprentice power dispatcher",
        "apprentice power dispatcher – electrical power systems",
        "apprentice power engineer",
        "apprentice stationary engineer",
        "area dispatch chief operator",
        "area dispatch chief operator – electrical power systems",
        "area load centre dispatcher",
        "automated substation operator – electrical power systems",
        "auxiliary equipment operator",
        "auxiliary plant operator",
        "biomass plant technician",
        "boiler operator",
        "boilerhouse operator",
        "building systems operator",
        "building systems technician",
        "central control room operator – electrical power systems",
        "central-office power control room operator – electrical power systems",
        "control room operator – electrical power systems",
        "control room operator trainee – electrical power systems",
        "conversion substation operator – electrical power systems",
        "cooling system operator",
        "diesel generating station operator – electrical power systems",
        "diesel plant operator – electrical power systems",
        "diesel station operator",
        "distribution control operator",
        "distribution control operator – electrical power systems",
        "distribution system dispatcher apprentice – electrical power systems",
        "distribution system operator",
        "electrical power systems operator",
        "electrical station operator",
        "electrical station operator – electrical power systems",
        "electrical station power distribution inspector",
        "energy from waste plant operator",
        "energy recovery incinerator plant operator",
        "feeder switchboard apprentice operator – electrical power systems",
        "feeder switchboard operator – electrical power systems",
        "fifth-class stationary engineer",
        "first-class power engineer",
        "first-class stationary engineer",
        "fourth-class power engineer",
        "fourth-class stationary engineer",
        "furnace boiler operator",
        "generating station main operator",
        "generating station operator",
        "generating station operator – electrical power systems",
        "generating station switchboard operator",
        "generation substation operator – electrical power systems",
        "heating and ventilation equipment tender",
        "heating stationary engineer",
        "heavy water steam plant operator",
        "hospital stationary engineer",
        "humidifying systems operator",
        "hydro-electric generating station operator",
        "hydro-electric power plant operator",
        "load dispatcher – electrical power systems",
        "mobile generator operator",
        "nuclear generating station field operator",
        "nuclear generating station operator",
        "nuclear generating station operator – electrical power systems",
        "nuclear reactor control room operator – electrical power systems",
        "nuclear reactor operator",
        "nuclear station control room operator",
        "operating engineer – power plant",
        "plant maintenance stationary engineer",
        "power control room operator – electrical power systems",
        "power dispatcher",
        "power dispatcher – electrical power systems",
        "power dispatcher – generating station",
        "power engineer",
        "power engineer apprentice",
        "power plant operator",
        "power plant operator – electrical power systems",
        "power plant stationary engineer",
        "power reactor operator – electrical power systems",
        "power station operator – electrical power systems",
        "power substation operator",
        "power switchboard operator – electrical power systems",
        "power switchboard operator apprentice – electrical power systems",
        "power system operator",
        "power system operator – offshore drilling",
        "powerhouse operator",
        "rectifier operator – electrical power systems",
        "refrigeration plant operator",
        "second-class power engineer",
        "second-class stationary engineer",
        "station operator – electrical power systems",
        "stationary diesel engine operator",
        "stationary engineer",
        "stationary engineer \"A\" and refrigeration plant operator",
        "stationary engineer \"B\" and refrigeration plant operator",
        "stationary engineer apprentice",
        "stationary operating engineer",
        "stationary power engineer",
        "steam operator",
        "steam plant operator",
        "steam power plant stationary engineer",
        "steam turbine operator – electrical power systems",
        "substation inspector – electrical power systems",
        "substation operator",
        "substation operator – electrical power systems",
        "system control centre operator – electrical power systems",
        "system controller – electrical power systems",
        "system operator – electrical power systems",
        "thermal plant operator",
        "third-class power engineer",
        "third-class stationary engineer",
        "turbine operator – stationary engines"
    ],
    "main duties": [
        "Operate automated or computerized control systems, stationary engines and auxiliary equipment such as reactors, boilers, turbines, generators, pumps, compressors, pollution control devices and other equipment to generate electrical power and to provide light, heat, ventilation and refrigeration for buildings and industrial plants and facilities",
        "Start up and shut down power plant equipment, control switching operations, control water levels and communicate with systems operators to regulate and co-ordinate transmission loads, frequency and line voltages",
        "Monitor and inspect plant equipment, computer terminals, switches, valves, gauges, alarms, meters and other instruments to measure temperature, pressure, air and fuel flow and emissions to detect leaks or other equipment malfunctions and to ensure plant equipment is operating at maximum efficiency",
        "Analyze and record instrument readings and equipment malfunctions",
        "Troubleshoot and perform corrective action and minor repairs to prevent equipment or system failure",
        "Respond to emergency situations if required",
        "Clean and lubricate generators, turbines, pumps and compressors and perform other routine equipment maintenance duties using appropriate lubricants and hand, power and precision tools",
        "Maintain a daily log of operation, maintenance and safety activities, and write reports on plant operation and non-compliance",
        "May assist in the development of operation, maintenance and safety procedures.",
        "Operate and monitor computerized switchboards and auxiliary equipment in electrical control centres to control the distribution and to regulate the flow of electrical power in the transmission network",
        "Co-ordinate, schedule and direct generating station and substation power loads and line voltages to meet distribution demands during daily operations, system outages, repairs and importing or exporting of power",
        "Monitor and visually inspect station instruments, meters and alarms to ensure transmission voltages and line loadings are within prescribed limits and to detect equipment failure, line disturbances and outages",
        "Issue work and test permits to electrical and mechanical maintenance personnel, assist maintenance and technical personnel to locate and isolate system problems, and assist during routine system testing",
        "Complete and maintain station records, logs and reports."
    ],
    "employment requirements": [
        "Completion of secondary school is usually required.",
        "Power engineers require a college training program in power engineering and several years of work experience.",
        "Power engineers require a provincial or territorial power engineering certificate according to class.",
        "Stationary engineer trade certification according to class is compulsory in Nova Scotia and Quebec and available, but voluntary in New Brunswick.",
        "Power systems operators require completion of a three- to five-year power system operator apprenticeship program \r\n or over three years of work experience in the trade and some college or industry courses in electrical and electronic technology.",
        "Trade certification is available, but voluntary for power systems operators in Newfoundland and Labrador.",
        "Control room operators at nuclear power plants require licensing from the Canadian Nuclear Safety Commission."
    ],
    "additional information": [
        "There is little mobility between nuclear power generation station operators and other classic or alternative power generation station operators.",
        "Progression from lower to higher classes for power or stationary engineers is dependent on further training and experience.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Nuclear power station equipment mechanics (in 7311 Construction millwrights and industrial mechanics",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7311&ver=16"
        },
        {
            "name": "Supervisors of power engineers and power systems operators (in 9212 Supervisors, petroleum, gas and chemical processing and utilities",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9212&ver=16"
        }
    ]
}