{
    "id": "9243",
    "name": "Water and waste treatment plant operators",
    "lead statement": "Water treatment plant operators monitor and operate computerized control systems and related equipment in water filtration and treatment plants to regulate the treatment and distribution of water. Liquid waste plant operators monitor and operate computerized control systems and related equipment in wastewater, sewage treatment and liquid waste plants to regulate the treatment and disposal of sewage and wastes. They are employed by municipal governments and industrial facilities. This unit group also includes waste treatment plant operators in composting plants and other waste management facilities.",
    "example titles": [
        "environmental systems operator – water treatment",
        "filter plant operator – water treatment",
        "filtration plant controller – water treatment",
        "industrial waste treatment plant operator",
        "liquid waste process operator",
        "liquid waste processing plant operator",
        "liquid waste treatment plant operator",
        "pump station operator – water treatment",
        "pumphouse operator – water treatment",
        "sewage plant operator",
        "sewage-processing equipment tender",
        "waste treatment plant operator",
        "wastewater collection operator",
        "wastewater collection systems operator",
        "wastewater treatment operator",
        "wastewater treatment plant operator",
        "wastewater treatment plant worker",
        "water and wastewater technician",
        "water filtration plant operator",
        "water gate operator",
        "water plant pump operator",
        "water purification plant operator",
        "water treatment operator",
        "water treatment plant operator",
        "water treatment plant process technician",
        "water treatment systems operator",
        "water utility operator",
        "waterworks pump house operator",
        "waterworks pumping station operator",
        "well-point pump operator"
    ],
    "main duties": [
        "Operate and monitor computerized control systems and related equipment in water filtration and treatment plants to regulate the treatment and distribution of water",
        "Monitor and inspect plant equipment and systems to detect equipment malfunctions and to ensure plant systems are operating normally",
        "Read flow meters, gauges and other recording instruments to measure water output and consumption levels, bacterial content, chlorine and fluoride levels",
        "Collect and test water samples for chemical and bacterial content, analyze test results and instrument readings and make adjustments to plant equipment and systems to ensure quality control",
        "Provide verbal or written instructions for process control changes to waterworks system to ensure water produced meets standardized quality requirements",
        "Perform security checks in plant and on grounds",
        "Respond to public enquiries regarding water quality issues and emergencies",
        "Complete and maintain plant logs, reports and statistics",
        "May perform minor maintenance or assist skilled tradespersons with installation and repair of plant machinery",
        "May measure, mix and transport chemicals to maintain feed stocks.",
        "Operate and monitor computerized control systems and related equipment in wastewater treatment, sewage treatment and liquid waste plants to regulate the flow of sewage through settling, aeration and digestion tanks, and to treat and dispose of sewage and wastes",
        "Patrol plant to check pumps, motors, filters, chlorinators and other plant equipment; monitor and read gauges, meters and other recording instruments to detect equipment malfunctions and ensure plant systems and equipment are operating within prescribed limits",
        "Test and adjust chemical feed rates to ensure that disinfection processes meet quality standards",
        "Collect waste and sewage samples, test and analyze results and make adjustments to plant equipment and systems as required",
        "Perform security checks in plant and on grounds",
        "Complete and maintain plant logs and reports",
        "Perform preventive maintenance on plant equipment to ensure that the facility operates in accordance with required standards",
        "May assist skilled tradespersons with installation and repair of plant machinery."
    ],
    "employment requirements": [
        "Completion of secondary school is required.",
        "College or industry training courses in chemistry, pollution control or related subjects are usually required.",
        "Certification in water treatment and distribution (level according to the classification of the plant) is required for water treatment plant operators.",
        "Drinking water certification is required in Quebec and Ontario for operators whose work involves water treatment and distribution.",
        "Certification in wastewater collection and wastewater treatment (level according to the classification of the plant) is required for wastewater treatment plant operators.",
        "Solid waste, landfill or compost facility operator certification may be required for operators in waste treatment plants.",
        "Certification in workplace hazardous materials information system (WHMIS), transportation of dangerous goods (TDG), and courses in safety practices may be required.",
        "On-the-job training is provided.",
        "Previous experience as a worker in the water treatment or wastewater field may be required."
    ],
    "additional information": [
        "There is limited mobility between water treatment plant and waste plant operators.",
        "Progression to supervisory positions is possible with experience."
    ],
    "exclusions": [
        {
            "name": "Chemical engineers (2134)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2134&ver=16"
        },
        {
            "name": "Chemical technologists and technicians (2211)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=2&val1=2211&ver=16"
        },
        {
            "name": "Supervisors, petroleum, gas and chemical processing and utilities (9212)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9212&ver=16"
        },
        {
            "name": "Water and waste plant labourers (in 9613 Labourers in chemical products processing and utilities",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=9&val1=9613&ver=16"
        },
        {
            "name": "Waterworks and gas maintenance workers (7442)",
            "url": "http://noc.esdc.gc.ca/English/NOC/Profile.aspx?val=7&val1=7442&ver=16"
        }
    ]
}